import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: 'Доброжелательность',
  shortDescription: 'Доброжелательность отражает различие людей в плане их отношения к сотрудничеству и социальной гармонии. Доброжелательные люди ценят отношения с другими.',
  description: `Поэтому они более дружелюбны, учтивы, щедры,
  услужливы, и готовы пожертвовать своими интересами ради других.
  Доброжелательные люди также имеют более оптимистичный взгляд на
  человеческую природу. Они верят, что люди по натуре честны, порядочны и заслуживают доверия.
  <br /><br />
Недоброжелательные люди ставят собственный интерес выше отношений с другими.
Они в целом меньше переживают за благополучие других и менее склонны
расширять свои интересы для других людей. Иногда их сомнительное отношение к
человеческим мотивам делает их подозрительными, недружелюбными и несговорчивыми.
<br /><br />
Очевидно, доброжелательность необходима для обретения и сохранения
популярности. Доброжелательные люди нравятся другим больше, чем недоброжелательные.
С другой стороны, данная черта не всегда полезна в ситуациях, требующих тяжелых или
абсолютно объективных решений. Недоброжелательные люди обычно лучше преуспевают в качестве
учёных, критиков или солдатов.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Вы имеете низкую Доброжелательность. Вы менее склонны волноваться за чужие потребности, 
      чем ваши собственные. Люди видят Вас как жёсткую, критичную и бескомпромиссную личность.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш уровень Доброжелательности средний. Иногда Вы склонны волноваться за чужие потребности, однако в
      целом, не желаете жертвовать собой ради других.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш высокий уровень Доброжелательности говорит о том, что вы больше интересуетесь чужими 
      желаниями и благополучием. Вы приятны, сострадательны и сговорчивы.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Доверие',
      text: `Человек с высоким доверием предполагает, что большинство людей
по своей природе честны и имеют добрые намерения. Люди с низким доверием считают других
эгоистичными, коварными и потенциально опасными.`
    },
    {
      facet: 2,
      title: 'Искренность',
      text: `Люди с высоким результатом по этой шкале не видят нужды в
притворстве и манипуляции при общении с другими, потому они искренни и откровенны.
Люди с низким результатом верят, что в отношениях не обойтись без некоторого
жульничества. Нужно уточнить, что люди с низким показателем не безпринципны и не аморальны, 
а лишь более дефенсивны и менее склонны раскрывать всю правду.`
    },
    {
      facet: 3,
      title: 'Альтруизм',
      text: `Альтруистичные люди считают, что помощь другим - это уже награда.
Соответственно, они более склонны помогать тем, кто в нужде. Альтруистичные люди считают
помощь другим скорее формой самоудовлетворения, чем самопожертвованием. Люди
с низким результатом по этой шкале не особо любят помогать другим.
Просьбы о помощи воспринимаются для них как навязывание, а не возможность
самореализации.`
    },
    {
      facet: 4,
      title: 'Сотрудничество',
      text: `Люди с высоким результатом по этой шкале не любят конфронтации.
Они готовы пожертвовать собственными потребностями, чтобы сохранить отношения
с другими. Люди с низким результатом по этой шкале более склонны
припугивать других, чтобы добиться своих целей.`
    },
    {
      facet: 5,
      title: 'Скромность',
      text: `Люди с высокой скромностью не любят ставить
себя выше других. С одной стороны, это может быть вызвано
низкой уверенностью в себе или низкой самооценкой. Несмотря на это,
некоторые люди с высокой самооценкой находят нескромное поведение неподобающим.
Люди, описывающие себя как превосходнее других, воспринимаются
другими как неприятно высокомерные.`
    },
    {
      facet: 6,
      title: 'Сочувствие',
      text: `Люди с высоким сочувствием мягкосердечны и сострадательны.
Они глубоко чувствуют боль других и легко поддаются жалости.
Люди с низким результатом по этой шкале не сильно поддаются человеческим страданиям.
Они ценят свою способность делать объективные суждения, основанные на разуме, и
больше сосредоточены на истине и беспристрастном правосудии, чем милосердии.`
    }
  ]
}

export default agreeableness