import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: 'Доброжелательность',
  shortDescription: 'Доброжелательность отражает индивидуальные различия в стремлении к сотрудничеству и социальной гармонии. Доброжелательные люди ценят умение ладить с другими.',
  description: `Поэтому они внимательны, дружелюбны, щедры, готовы помочь и идти на компромисс в своих интересах ради других. Доброжелательные люди также имеют оптимистичный взгляд на человеческую природу. Они верят, что люди в основном честные, порядочные и заслуживающие доверия. <br /><br />
Недоброжелательные люди ставят собственные интересы выше, чем умение ладить с другими. Они, как правило, не заботятся о благополучии других и поэтому вряд ли будут стараться ради других людей. Иногда их скептицизм по поводу мотивов других людей делает их подозрительными, недружелюбными и не склонными к сотрудничеству.
<br /><br />
Доброжелательность, очевидно, полезна для достижения и поддержания популярности. Доброжелательных людей любят больше, чем недоброжелательных. С другой стороны, доброжелательность не полезна в ситуациях, требующих жестких или абсолютно объективных решений. Недоброжелательные люди могут быть отличными учеными, критиками или солдатами.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш уровень доброжелательности низкий, что указывает на меньшую озабоченность потребностями других по сравнению с вашими собственными. Люди видят вас как жесткого, критичного и бескомпромиссного человека.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш уровень доброжелательности средний, что указывает на некоторую озабоченность потребностями других, но, как правило, нежелание жертвовать собой ради других.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш высокий уровень доброжелательности указывает на сильный интерес к потребностям и благополучию других. Вы приятны в общении, сочувствующие и готовы к сотрудничеству.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Доверие',
      text: `Человек с высоким уровнем доверия предполагает, что большинство людей справедливы, честны и имеют добрые намерения. Люди с низким уровнем доверия видят других как эгоистичных, коварных и потенциально опасных.`
    },
    {
      facet: 2,
      title: 'Моральность',
      text: `Люди с высокими показателями по этой шкале не видят необходимости в притворстве или манипуляциях при общении с другими и поэтому откровенны, честны и искренни. Люди с низкими показателями считают, что определенная доля обмана в социальных отношениях необходима. Людям относительно легко общаться с прямолинейными людьми с высокими показателями по этой шкале. Им, как правило, сложнее общаться с непрямолинейными людьми с низкими показателями. Следует уточнить, что люди с низкими показателями не являются беспринципными или аморальными; они просто более осторожны и менее склонны открыто раскрывать всю правду.`
    },
    {
      facet: 3,
      title: 'Альтруизм',
      text: `Альтруистичные люди находят в помощи другим людям истинное удовлетворение. Следовательно, они, как правило, готовы помочь тем, кто в этом нуждается. Альтруистичные люди считают, что делать что-то для других — это форма самореализации, а не самопожертвования. Люди с низкими показателями по этой шкале не особенно любят помогать нуждающимся. Просьбы о помощи воспринимаются ими как навязчивость, а не как возможность для самореализации.`
    },
    {
      facet: 4,
      title: 'Сотрудничество',
      text: `Люди, набравшие высокие баллы по этой шкале, не любят конфронтации. Они вполне готовы идти на компромисс или отказываться от своих нужд ради того, чтобы ладить с другими. Те, кто набирает низкие баллы по этой шкале, с большей вероятностью будут запугивать других, чтобы добиться своего.`
    },
    {
      facet: 5,
      title: 'Скромность',
      text: `Люди с высокими показателями по этой шкале не любят утверждать, что они лучше других. В некоторых случаях такая позиция может быть связана с низкой самооценкой или неуверенностью в себе. Тем не менее, некоторые люди с высокой самооценкой считают нескромность неприличной. Те, кто готов описывать себя как превосходящих других, склонны восприниматься окружающими как неприятно высокомерные.`
    },
    {
      facet: 6,
      title: 'Сочувствие',
      text: `Люди, набравшие высокие баллы по этой шкале, добросердечны и сострадательны. Они сопереживают чужой боли и легко поддаются жалости. Люди с низкими показателями не сильно подвержены влиянию человеческих страданий. Они гордятся тем, что делают объективные суждения, основанные на разуме. Они больше заботятся о правде и беспристрастной справедливости, чем о милосердии.`
    }
  ]
}

export default agreeableness
