import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: 'Доброжелательность',
  shortDescription: 'Доброжелательность отражает индивидуальные различия в стремлении к сотрудничеству и социальной гармонии. Доброжелательные люди ценят хорошие отношения с другими.',
  description: `Поэтому они внимательны, дружелюбны,
щедры, готовы помочь и поступиться своими интересами ради
других. Доброжелательные люди также смотрят на человеческую
природу оптимистично. Они верят, что люди по своей сути честны,
порядочны и заслуживают доверия. <br /><br />
Недоброжелательные люди ставят личные интересы выше отношений с
другими. Их, как правило, мало волнует благополучие окружающих, и
поэтому они вряд ли будут стараться ради других людей.
Иногда их скептицизм по отношению к чужим мотивам делает их
подозрительными, недружелюбными и несклонными к сотрудничеству.
<br /><br />
Доброжелательность, очевидно, помогает завоёвывать и сохранять
популярность. Доброжелательных людей любят больше, чем
недоброжелательных. С другой стороны, доброжелательность бесполезна в
ситуациях, требующих жёстких или абсолютно объективных решений.
Недоброжелательные люди могут стать отличными учёными, критиками
или военными.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твой результат по Доброжелательности низкий: потребности
других волнуют тебя меньше, чем собственные. Окружающие видят тебя
жёстким, критичным и неуступчивым человеком.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твой уровень Доброжелательности средний: ты в какой-то мере
учитываешь потребности других, но в целом не готов жертвовать
собой ради них.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твой высокий уровень Доброжелательности говорит о сильном
интересе к потребностям и благополучию других. Ты приятный,
отзывчивый и готовый к сотрудничеству человек.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Доверие',
      text: `Человек с высоким доверием исходит из того, что большинство
людей справедливы, честны и имеют добрые намерения. Люди с низким
доверием видят других эгоистичными, лукавыми и потенциально опасными.`
    },
    {
      facet: 2,
      title: 'Прямота',
      text: `Люди с высокими результатами по этой шкале не видят
необходимости в притворстве или манипуляциях при общении с другими и
поэтому откровенны, искренни и прямодушны. Люди с низкими
результатами считают, что определённая доля хитрости в социальных
отношениях необходима. Окружающим относительно легко общаться с
прямолинейными людьми с высокими результатами по этой шкале. С
непрямолинейными людьми с низкими результатами общаться, как правило,
труднее. Важно подчеркнуть, что низкие результаты не означают
беспринципность или безнравственность; такие люди просто более
сдержанны и менее склонны открыто говорить всю правду.`
    },
    {
      facet: 3,
      title: 'Альтруизм',
      text: `Альтруистичные люди получают искреннее удовольствие от помощи
другим. Поэтому они обычно готовы помочь тем, кто в этом нуждается.
Альтруисты воспринимают заботу о других как форму самореализации, а
не самопожертвования. Люди с низкими результатами по этой шкале не
особенно любят помогать нуждающимся. Просьбы о помощи воспринимаются
ими как обуза, а не как возможность самореализации.`
    },
    {
      facet: 4,
      title: 'Сотрудничество',
      text: `Люди с высокими результатами по этой шкале не любят
конфронтаций. Они охотно идут на компромисс или отказываются от
собственных потребностей, чтобы сохранить хорошие отношения с
другими. Те, у кого результаты низкие, скорее склонны добиваться
своего, оказывая давление на окружающих.`
    },
    {
      facet: 5,
      title: 'Скромность',
      text: `Люди с высокими результатами по этой шкале не любят заявлять,
что они лучше других. В некоторых случаях такое отношение может
проистекать из неуверенности в себе или низкой самооценки. Тем не
менее некоторые люди с высокой самооценкой считают нескромность
неуместной. Те, кто охотно называет себя превосходящими других,
обычно воспринимаются окружающими как неприятно высокомерные.`
    },
    {
      facet: 6,
      title: 'Сочувствие',
      text: `Люди с высокими результатами по этой шкале мягкосердечны и
сострадательны. Они остро чувствуют чужую боль и легко проникаются
жалостью. Люди с низкими результатами не так сильно затронуты
человеческими страданиями. Они гордятся тем, что выносят объективные
суждения на основе разума. Их больше заботит истина и беспристрастная
справедливость, чем милосердие.`
    }
  ]
}

export default agreeableness
