import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'Добросовестность',
  shortDescription: 'Добросовестность касается того, как мы контролируем, регулируем и направляем наши импульсы.',
  description: `Импульсы не являются по своей природе плохими; иногда временные ограничения требуют быстрого решения, и следование первому импульсу может быть эффективным ответом. Также, в моменты отдыха, а не работы, спонтанные и импульсивные действия могут быть веселыми. Импульсивные люди могут восприниматься другими как яркие, приятные в общении и эксцентричные.<br /><br />Тем не менее, следование импульсам может привести к неприятностям различными способами. Некоторые импульсы являются антисоциальными. Неконтролируемые антисоциальные поступки не только вредят другим членам общества, но и могут привести к возмездию в отношении совершившего такие импульсивные действия. Еще одна проблема импульсивных поступков заключается в том, что они часто приносят немедленные награды, но нежелательные долгосрочные последствия. Примеры включают чрезмерное общение, которое приводит к увольнению с работы, оскорбление, вызывающее разрыв важного отношения, или употребление наркотиков, вызывающих удовольствие, которые в конечном итоге разрушают здоровье.<br /><br />Импульсивное поведение, даже если оно не является серьезно разрушительным, снижает эффективность человека значительным образом. Действуя импульсивно, человек лишает себя возможности обдумать альтернативные варианты действий, некоторые из которых могли бы быть более мудрыми, чем импульсивный выбор. Импульсивность также отвлекает людей во время выполнения проектов, требующих организованных последовательностей шагов или этапов. Достижения импульсивного человека поэтому малы, разбросаны и непоследовательны.<br /><br />Отличительной чертой интеллекта, что потенциально отличает людей от более ранних форм жизни, является способность думать о будущих последствиях, прежде чем действовать по импульсу. Интеллектуальная деятельность включает в себя обдумывание долгосрочных целей, организацию и планирование путей к этим целям, а также настойчивость в достижении своих целей, несмотря на кратковременные импульсы, противоречащие им. Идея о том, что интеллект включает в себя контроль над импульсами, прекрасно выражена в термине «благоразумие», альтернативном названии для домена Добросовестности. Благоразумный означает как мудрый, так и осторожный.<br /><br/>Люди, которые набирают высокие баллы по шкале Добросовестности, действительно воспринимаются другими как умные. Преимущества высокой добросовестности очевидны. Добросовестные люди избегают неприятностей и достигают высоких уровней успеха благодаря целенаправленному планированию и настойчивости. Они также положительно воспринимаются другими как умные и надежные. С другой стороны, они могут быть навязчивыми перфекционистами и трудоголиками. Более того, крайне добросовестные люди могут восприниматься как чопорные и скучные.<br /><br />Недобросовестные люди могут подвергаться критике за их ненадежность, отсутствие амбиций и неспособность придерживаться правил, но они испытают много кратковременных удовольствий и никогда не будут названы чопорными.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат по шкале Добросовестности низкий, что указывает на то, что вы предпочитаете жить настоящим моментом и делать то, что приносит удовольствие сейчас. Ваша работа, как правило, небрежна и неорганизованна.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат по шкале Добросовестности средний. Это означает, что вы достаточно надежны, организованы и самоконтролируемы.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат по шкале Добросовестности высокий. Это означает, что вы ставите перед собой четкие цели и стремитесь к их достижению с решимостью. Люди считают вас надежным и трудолюбивым.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Уверенность в своих силах',
      text: `Уверенность в своих силах описывает уверенность в своей способности достигать целей. Люди с высокими показателями верят, что обладают необходимым интеллектом (здравым смыслом), стремлением и самоконтролем для достижения успеха. Люди с низкими показателями не чувствуют себя эффективными и могут ощущать, что не контролируют свою жизнь.`
    },
    {
      facet: 2,
      title: 'Организованность',
      text: `Люди с высокими показателями организованности хорошо организованы. Они любят жить по распорядку и графику. Они ведут списки и составляют планы. Люди с низкими показателями, как правило, неорганизованны и рассеяны.`
    },
    {
      facet: 3,
      title: 'Чувство долга',
      text: `Эта шкала отражает силу чувства долга и обязательств у человека. Те, кто набирает высокие баллы по этой шкале, имеют сильное чувство морального долга. Люди с низкими показателями считают контракты, правила и регламенты чрезмерно ограничивающими. Их могут воспринимать как ненадежных или даже безответственных.`
    },
    {
      facet: 4,
      title: 'Стремление к достижениям',
      text: `Люди, которые набирают высокие баллы по этой шкале, усердно стремятся к достижению совершенства. Их стремление быть признанными как успешные удерживает их на пути к высоким целям. У них часто есть четкое направление в жизни, но чрезвычайно высокие показатели могут указывать на чрезмерную сосредоточенность и одержимость работой. Люди с низкими показателями довольствуются минимальным количеством работы и могут восприниматься другими как ленивые.`
    },
    {
      facet: 5,
      title: 'Самодисциплина',
      text: `Самодисциплина, то, что многие называют силой воли, относится к способности упорствовать в трудных или неприятных задачах до их завершения. Люди с высокой самодисциплиной способны преодолевать нежелание начинать задачи и оставаться на пути, несмотря на отвлекающие факторы. Люди с низкой самодисциплиной откладывают дела на потом и плохо доводят их до конца, часто не завершая задачи, которые они очень хотят выполнить.`
    },
    {
      facet: 6,
      title: 'Осторожность',
      text: `Осторожность описывает склонность обдумывать возможности перед действием. Люди с высокими показателями осторожности не торопятся с принятием решений. Люди с низкими показателями часто говорят или делают первое, что приходит в голову, не обдумывая альтернативы и вероятные последствия этих альтернатив.`
    }
  ]
}

export default conscientiousness
