import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'Добросовестность',
  shortDescription: 'Добросовестность касается того, как мы контролируем, регулируем и направляем свои импульсы.',
  description: `Импульсы сами по себе не являются чем-то плохим;
иногда ограничения по времени требуют мгновенного решения, и действие
по первому импульсу может оказаться эффективным ответом. Кроме того,
в часы отдыха, а не работы, действовать спонтанно и импульсивно бывает
весело. Импульсивные люди могут восприниматься окружающими как яркие,
весёлые и эксцентричные.
<br /><br />
Тем не менее действия под влиянием импульса могут привести к неприятностям
по целому ряду причин. Некоторые импульсы асоциальны. Неконтролируемые
асоциальные поступки не только вредят другим членам общества, но и могут
повлечь возмездие в адрес того, кто совершает такие импульсивные действия.
Другая проблема импульсивных поступков в том, что они часто приносят
немедленное удовлетворение, но имеют нежелательные долгосрочные
последствия. Примеры: чрезмерное увлечение развлечениями, из-за которого
увольняют с работы; обидное оскорбление, разрушившее важные
отношения; или употребление доставляющих удовольствие веществ,
которые в конечном счёте разрушают здоровье.
<br /><br />
Импульсивное поведение, даже если оно не приводит к серьёзным разрушениям,
заметно снижает эффективность человека. Действуя импульсивно, человек
не обдумывает альтернативные варианты действий, некоторые из которых
были бы мудрее импульсивного выбора. Импульсивность также сбивает
людей с толку в проектах, требующих последовательного выполнения
шагов или этапов. Поэтому достижения импульсивного человека
невелики, разрозненны и непоследовательны.
<br /><br />
Признак интеллекта, то, что, возможно, отличает человека от более ранних
форм жизни, — это способность обдумать будущие последствия, прежде чем
действовать по импульсу. Разумная деятельность включает размышления о
долгосрочных целях, организацию и планирование путей к этим целям и
упорство в их достижении, несмотря на кратковременные импульсы,
влекущие в противоположную сторону. Мысль о том, что интеллект связан
с контролем над импульсами, хорошо передаёт термин «рассудительность» —
альтернативное название области Добросовестности. Рассудительность
означает одновременно мудрость и осторожность.
<br /><br/>
Люди с высокими результатами по
шкале Добросовестности действительно воспринимаются окружающими как умные.
Преимущества высокой добросовестности очевидны. Добросовестные люди
избегают неприятностей и достигают высоких успехов благодаря целенаправленному
планированию и настойчивости. Окружающие также ценят их как умных и
надёжных. Из недостатков: они могут быть навязчивыми перфекционистами
и трудоголиками. Более того, чрезмерно добросовестных людей могут
считать занудами и скучными.
<br /><br />
Недобросовестных людей могут критиковать за
ненадёжность, отсутствие амбиций и неумение держаться в рамках,
но они получат множество кратковременных удовольствий и их
никогда не назовут занудами.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твой результат по Добросовестности низкий: ты любишь жить
моментом и делать то, что доставляет удовольствие сейчас. Твоя работа
обычно выполняется небрежно и неорганизованно.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твой результат по Добросовестности средний. Это значит, что ты
достаточно надёжен, организован и умеешь себя контролировать.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твой результат по Добросовестности высокий. Это значит, что ты
ставишь чёткие цели и упорно к ним идёшь. Люди считают тебя надёжным
и трудолюбивым.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Самоэффективность',
      text: `Самоэффективность описывает уверенность в своей способности
добиваться целей. Люди с высокими результатами верят, что обладают
интеллектом (здравым смыслом), энергией и самоконтролем, необходимыми
для достижения успеха. Люди с низкими результатами не чувствуют себя
эффективными и могут ощущать, что не контролируют свою жизнь.`
    },
    {
      facet: 2,
      title: 'Организованность',
      text: `Люди с высокими результатами по организованности хорошо
организованы. Они любят жить по распорядку и расписанию. Они ведут
списки и строят планы. Люди с низкими результатами, как правило,
неорганизованны и рассеянны.`
    },
    {
      facet: 3,
      title: 'Чувство долга',
      text: `Эта шкала отражает силу чувства долга и обязательств человека.
Те, у кого высокие результаты по этой шкале, обладают сильным чувством
морального долга. Люди с низкими результатами считают договоры, правила
и предписания чрезмерно стесняющими. Их, скорее всего, воспринимают как
ненадёжных или даже безответственных.`
    },
    {
      facet: 4,
      title: 'Стремление к достижениям',
      text: `Люди с высокими результатами по этой шкале упорно стремятся к
высоким достижениям. Желание быть признанными успешными удерживает их на
пути к амбициозным целям. У них часто есть сильное ощущение направления
в жизни, однако чрезмерно высокие результаты могут указывать на
чрезмерную целеустремлённость и одержимость работой. Люди с низкими
результатами довольствуются минимальным объёмом работы и могут
восприниматься окружающими как ленивые.`
    },
    {
      facet: 5,
      title: 'Самодисциплина',
      text: `Самодисциплина — то, что многие называют силой воли, — это
способность доводить трудные или неприятные задачи до конца. Люди с
высокой самодисциплиной способны преодолевать нежелание приступать к
задачам и не сбиваться с пути, несмотря на отвлекающие факторы. Люди с
низкой самодисциплиной откладывают дела на потом и плохо доводят начатое
до конца, часто не завершая задачи — даже те, которые очень хотят
завершить.`
    },
    {
      facet: 6,
      title: 'Осторожность',
      text: `Осторожность описывает склонность обдумывать возможные варианты,
прежде чем действовать. Люди с высокими результатами по шкале
Осторожности не торопятся при принятии решений. Люди с низкими
результатами часто говорят или делают первое, что приходит в голову,
не обдумывая альтернативы и их вероятные последствия.`
    }
  ]
}

export default conscientiousness
