import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'Рассудительность',
  shortDescription: 'Рассудительность определяет нашу способность контролировать, управлять и руководить нашими импульсами.',
  description: `Импульсы – не всегда наши враги. Иногда временные рамки требуют от нас
  быстрого решения, а потому действие под влиянием первого импульса может стать эффективным
  ответом. Спонтанность и импульсивность – это наша способность к веселью в свободное от работы время. 
  Импульсивных людей обычно видят как задорных, красочных и весёлых.
<br /><br />
Тем не менее, такая импульсивность может привести к ряду проблем. Некоторые из наших желаний, в своей натуре,
антисоциальны и неприемлемы. Без необходимого контроля, антисоциальные действия 
не только вредят другим членам общества, но и способны воздать по заслугам их виновнику. 
Другая проблема импульсивных поступков в том, что они приносят удовольствие сейчас, 
однако часто влекут нежеланные последствия в будущем. Примером может послужить чрезмерная социализация, которая
приводит к увольнению с работы, оскорбление, приводящее к разрушению важных отношений, или же употребление 
наркотиков, которые вызывают удовольствие, но в конце концов лишь разрушают здоровье.
<br /><br />
Импульсивное поведение, даже если оно не несёт серьезных разрушений, способно сказаться на эффективности. 
Действуя импульсивно, человек не предполагает альтернатив, некоторые из которых могли бы
быть более мудрым выбором, чем подсказанный ощущениями. Такие люди также склонны отвлекаться во время проектов,
требующих организованной последовательности шагов или стадий. Из-за этого достижения импульсивных личностей
оказываются маленькими, рассеянными и непоследовательными.
<br /><br />
Способность разумно мыслить, отличающая людей от ранних форм жизни, также наделила их 
способностью рассматривать последствия перед тем, как действовать.
Интеллектуальная активность позволяет рассматривать долгосрочные цели, организовать и планировать 
способы их достижения, и проявлять настойчивость в их достижении  перед лицом кратковременных ощущений. 
Идея того, что интеллект требует контроль над импульсами, отлично описывается термином 
"рассудительность". Рассудительный человек наделен мудростью и осторожностью. Однако не каждый рассудительный
человек имеет высокий интеллект, а многие исследования показывают нейтральную связь данной шкалы с уровнем IQ.
<br /><br/>
Как правило, людей с высокой добросовестностью считают умнее.
Польза такого отношения к жизни очевидна: добросовестность помогает избегать проблем и
достигать высоких уровней успеха через планирование и настойчивость. 
Их также считают более интеллектуальными, надёжными людьми. С другой стороны, они 
более склонны к навязчивому перфекционизму и трудоголизму. Помимо этого, чрезмерно рассудительных людей
нередко считают душными и скучными в общении.
<br /><br />
Людей с низкой рассудительностью часто критикуют за безалаберность, нехватку амбиций
и неспособность оставаться в рамках, однако испытают много кратковременных удовольствий, и их никогда
не назовут "душными".`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат Добросовестности низкий. Вы любите жить в
настоящем моменте и делать то, что кажется приятным. Ваша работа более
беззаботна и неорганизованна.` 
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат Добросовестности средний.
      Вы довольно надёжны, организованны и обладаете некоторым чувством самоконтроля.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат Добросовестности высокий. Вы устанавливаете чёткие цели
      и стремитесь к ним с решительностью. Люди воспринимают вас как надёжного
      и трудолюбивого человека.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Уверенность в себе',
      text: `Уверенность в себе - это вера в свои способности
к выполнению дел. Люди с высокими результатами верят, что обладают достаточным
интеллектом, стимулом и самоконтролем для достижения успеха. Люди с низким результатом
чувствуют себя неэффективными, и им не хватает чувства контроля над собственной жизнью.`
    },
    {
      facet: 2,
      title: 'Порядочность',
      text: `Люди с высокими показателями порядочности хорошо организованы.
Они любят жить по заведенному порядку и расписаниям, а также склонны составлять списки
и строить планы. Люди с низким результатом - неорганизованы и разрозненны.`
    },
    {
      facet: 3,
      title: 'Чувство долга',
      text: `Эта шкала отражает чувство долга и умение брать обязательства.
Люди с высоким результатом обладают сильным чувством морального долга.
Люди с низким результатом находят слишком ограничивающими контракты, правила и уставы.
Они с большей вероятностью будут считаться ненадежными или даже безответственными.`
    },
    {
      facet: 4,
      title: 'Стремление к достижениям', //хочется "стремление к превосходству"
      text: `Люди, набирающие высокий результат по этой шкале, стремятся к
достижению превосходных результатов. Их жажда признания и успеха мотивирует
их двигаться к своим возвышенным целям. Они обычно обладают сильным чувством
направления в жизни, однако могут быть чрезмерно целеустремленны и
зациклены на своей работе. Люди с низким результатом довольствуются
небольшим объемом работы, и обычно считаются ленивыми.`
    },
    {
      facet: 5,
      title: 'Самодисциплина',
      text: `Самодисциплина, или, как её часто называют, сила воли,
подразумевает под собой способность человека сохранять настойчивость, выполняя тяжёлые
или неприятные задачи, пока они не будут завершены. Люди с высоким чувством
самодисциплины легче преодолевают нежелание приступать к задачам и
остаются на верном пути, несмотря на отвлекающие факторы. Люди с низкой
самодисциплиной откладывают дела на потом и менее исполнительны.
Они часто не в состоянии выполнить даже те задачи, которые очень желают сделать.`
    },
    {
      facet: 6,
      title: 'Осторожность',
      text: `Осторожность - склонность обдумывать возможные варианты событий, прежде
чем действовать. Люди с высоким результатом не торопятся с принятием решений.
Люди с низким результатом часто говорят или делают первую пришедшую в голову мысль,
не обдумывая альтернативные идеи и возможные их последствия.`
    }
  ]
}

export default conscientiousness