import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: 'Экстраверсия',
  shortDescription: 'Экстраверсия характеризуется выраженным взаимодействием с внешним миром.',
  description: `Экстраверты любят находиться среди людей, полны энергии и часто испытывают положительные эмоции. Они, как правило, энтузиасты, ориентированные на действие, и с готовностью откликаются на возможности для новых впечатлений. В группах они любят говорить, проявлять себя и привлекать к себе внимание.<br /><br />Интроверты лишены той бурной энергии и активности, которые присущи экстравертам. Они склонны быть тихими, сдержанными, обдуманными и отстраненными от социального мира. Их недостаток социального взаимодействия не следует интерпретировать как застенчивость или депрессию; интроверту просто требуется меньше стимуляции, чем экстраверту, и он предпочитает быть в одиночестве.<br /><br />Независимость и сдержанность интроверта иногда ошибочно принимают за недружелюбие или высокомерие. На самом деле, интроверт, который высоко оценивается по шкале доброжелательности, не будет активно искать общения, но будет весьма приятен в общении, если к нему обратиться.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат по шкале экстраверсии низкий, что указывает на вашу интровертность, сдержанность и тихий характер. Вы наслаждаетесь уединением и одиночными занятиями. Ваше общение, как правило, ограничивается несколькими близкими друзьями.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат по шкале экстраверсии средний, что указывает на то, что вы не являетесь ни замкнутым одиночкой, ни веселым болтуном. Вы получаете удовольствие как от времени, проведенного с другими, так и от времени наедине с собой.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат по шкале экстраверсии высокий, что указывает на вашу общительность, открытость, энергичность и живость. Вы предпочитаете находиться среди людей большую часть времени.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Дружелюбие',
      text: `Дружелюбные люди искренне любят других и открыто демонстрируют положительные чувства к ним. Они быстро заводят друзей, и им легко формировать близкие, интимные отношения. Низкие показатели по шкале дружелюбия не обязательно означают холодность и враждебность, но такие люди не стремятся к общению и воспринимаются как отстраненные и сдержанные.`
    },
    {
      facet: 2,
      title: 'Общительность',
      text: `Общительные люди находят компанию других приятной и стимулирующей. Они наслаждаются возбуждением толпы. Люди с низкими показателями по этой шкале склонны чувствовать себя подавленными в больших группах и поэтому активно избегают их. Они не обязательно не любят быть с людьми, но их потребность в уединении и времени для себя гораздо выше, чем у тех, кто имеет высокие показатели по этой шкале.`
    },
    {
      facet: 3,
      title: 'Напористость',
      text: `Люди с высокими показателями напористости любят высказываться, брать на себя руководство и направлять действия других. Они склонны быть лидерами в группах. Люди с низкими показателями, как правило, мало говорят и позволяют другим контролировать деятельность группы.`
    },
    {
      facet: 4,
      title: 'Уровень активности',
      text: `Активные люди ведут быстрый, насыщенный образ жизни. Они двигаются быстро, энергично и активно, участвуют во многих делах. Люди с низкими показателями по этой шкале следуют более медленному и расслабленному темпу.`
    },
    {
      facet: 5,
      title: 'Поиск острых ощущений',
      text: `Люди с высокими показателями по этой шкале легко скучают без высокого уровня стимуляции. Они любят яркие огни и суету. Они склонны к риску и поиску острых ощущений. Люди с низкими показателями подавлены шумом и суматохой и избегают острых ощущений.`
    },
    {
      facet: 6,
      title: 'Жизнерадостность',
      text: `Эта шкала измеряет положительное настроение и чувства, а не негативные эмоции (которые являются частью домена невротизма). Люди с высокими показателями по этой шкале обычно испытывают широкий спектр положительных чувств, включая счастье, энтузиазм, оптимизм и радость. Люди с низкими показателями не так склонны к таким энергичным, приподнятым настроениям.`
    }
  ]
}

export default extraversion
