import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: 'Экстраверсия',
  shortDescription: 'Экстраверсия характеризуется выраженной вовлечённостью во внешний мир.',
  description: `Экстраверты любят быть среди людей, полны энергии и
часто испытывают положительные эмоции. Это, как правило, полные энтузиазма
и ориентированные на действие люди, которые на возможность развлечься
скорее ответят «Да!» или «Пошли!». В группах они любят разговаривать,
проявлять себя и привлекать к себе внимание.
<br /><br />
Интровертам не хватает живости, энергии и уровня активности
экстравертов. Они, как правило, тихие, сдержанные, неторопливые и
отстранённые от социального мира. Их низкая социальная вовлечённость
не должна трактоваться как застенчивость или подавленность;
интроверту просто нужно меньше стимулов, чем экстраверту, и он
предпочитает одиночество. <br /><br />Независимость и сдержанность интроверта
иногда ошибочно принимают за недружелюбие или высокомерие. На самом
деле интроверт с высокими показателями доброжелательности не будет
сам искать общества, но окажется вполне приятным собеседником, если
к нему подойдут.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твой результат по Экстраверсии низкий: ты интровертен,
сдержан и спокоен. Тебе нравятся одиночество и занятия наедине с
собой. Твоё общение обычно ограничивается несколькими близкими друзьями.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твой результат по Экстраверсии средний: ты не являешься ни
угрюмым одиночкой, ни весёлым болтуном. Тебе нравится проводить время
с другими, но и наедине с собой.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твой результат по Экстраверсии высокий: ты общительный,
открытый, энергичный и жизнерадостный. Ты предпочитаешь большую часть
времени проводить среди людей.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Дружелюбие',
      text: `Дружелюбные люди искренне любят других людей и открыто
выражают к ним положительные чувства. Они быстро заводят друзей, и им
легко удаётся выстраивать близкие, доверительные отношения. Люди с
низкими результатами по Дружелюбию не обязательно холодны и враждебны,
но они не идут навстречу другим и воспринимаются как отстранённые и
сдержанные.`
    },
    {
      facet: 2,
      title: 'Общительность',
      text: `Общительные люди находят компанию других приятно
стимулирующей и приносящей удовлетворение. Им нравится оживление толпы.
Люди с низкими результатами чувствуют себя подавленными в больших
скоплениях людей и поэтому активно их избегают. Они не обязательно
не любят иногда бывать с людьми, но их потребность в уединении и
личном времени гораздо сильнее, чем у людей с высокими результатами
по этой шкале.`
    },
    {
      facet: 3,
      title: 'Напористость',
      text: `Люди с высокими результатами по Напористости любят высказываться,
брать на себя ответственность и направлять действия других. В группах
они, как правило, лидеры. Люди с низкими результатами обычно немногословны
и позволяют другим руководить деятельностью группы.`
    },
    {
      facet: 4,
      title: 'Уровень активности',
      text: `Активные люди ведут стремительную, насыщенную жизнь. Они
двигаются быстро, энергично и решительно и вовлечены во множество
занятий. Люди с низкими результатами по этой шкале предпочитают более
медленный, размеренный и расслабленный темп жизни.`
    },
    {
      facet: 5,
      title: 'Поиск острых ощущений',
      text: `Люди с высокими результатами по этой шкале быстро скучают без
высокого уровня стимуляции. Им нравятся яркие огни, шум и суета. Они
склонны рисковать и искать острых ощущений. Люди с низкими результатами
чувствуют себя подавленными шумом и суетой и не любят поиска острых
ощущений.`
    },
    {
      facet: 6,
      title: 'Жизнерадостность',
      text: `Эта шкала измеряет положительное настроение и чувства, а не
негативные эмоции (которые относятся к области Нейротизма). Люди с
высокими результатами по этой шкале обычно испытывают целый спектр
положительных чувств, включая счастье, энтузиазм, оптимизм и радость.
Люди с низкими результатами менее склонны к такому энергичному и
приподнятому настроению.`
    }
  ]
}

export default extraversion
