import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: 'Невротизм',
  shortDescription: 'Невротизм относится к склонности испытывать негативные чувства.',
  description: `Фрейд изначально использовал термин невроз для описания состояния, характеризующегося психическим расстройством, эмоциональными страданиями и неспособностью эффективно справляться с обычными жизненными требованиями. Он предполагал, что у каждого человека есть признаки невроза, но мы различаемся по степени страданий и специфическим симптомам расстройства. Сегодня невротизм относится к склонности испытывать негативные чувства. <br /><br />Те, кто набирает высокие баллы по шкале невротизма, могут испытывать преимущественно одно конкретное негативное чувство, такое как тревога, гнев или депрессия, но, скорее всего, они будут испытывать несколько из этих эмоций. <br /><br />Люди с высоким уровнем невротизма эмоционально реактивны. Они эмоционально реагируют на события, которые не затронули бы большинство людей, и их реакции, как правило, более интенсивны, чем обычно. Они чаще интерпретируют обычные ситуации как угрожающие, а мелкие разочарования как безнадежно сложные. <br /><br />Их негативные эмоциональные реакции, как правило, сохраняются необычно долго, что означает, что они часто находятся в плохом настроении. Эти проблемы с эмоциональной регуляцией могут снижать способность невротика ясно мыслить, принимать решения и эффективно справляться со стрессом.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат по шкале невротизма низкий, что указывает на то, что вы исключительно спокойны, уравновешены и невозмутимы. Вы не реагируете с интенсивными эмоциями, даже на ситуации, которые большинство людей описали бы как стрессовые.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат по шкале невротизма средний, что указывает на то, что уровень вашей эмоциональной реактивности типичен для общей популяции. Стрессовые и разочаровывающие ситуации несколько расстраивают вас, но вы, как правило, способны преодолеть эти чувства и справиться с этими ситуациями.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат по шкале невротизма высокий, что указывает на то, что вы легко расстраиваетесь, даже из-за того, что большинство людей считает обычными жизненными требованиями. Люди считают вас чувствительным и эмоциональным.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Тревожность',
      text: `Система "бей или беги" в мозге тревожных людей слишком легко и часто активируется. Поэтому люди с высоким уровнем тревожности часто чувствуют, что что-то опасное вот-вот произойдет. Они могут бояться конкретных ситуаций или просто испытывать общий страх. Они чувствуют себя напряженными, нервными и беспокойными. Люди с низким уровнем тревожности, как правило, спокойны и бесстрашны.`
    },
    {
      facet: 2,
      title: 'Гнев',
      text: `Люди с высоким уровнем гнева чувствуют ярость, когда что-то идет не так, как они хотят. Они чувствительны к справедливому обращению и чувствуют обиду и горечь, когда считают, что их обманывают. Эта шкала измеряет склонность к чувству гнева; выражает ли человек раздражение и враждебность, зависит от его уровня по шкале Доброжелательности. Люди с низкими показателями не часто и не легко злятся.`
    },
    {
      facet: 3,
      title: 'Депрессия',
      text: `Эта шкала измеряет склонность к чувству грусти, подавленности и уныния. Люди с высокими показателями испытывают недостаток энергии и трудности с началом деятельности. Люди с низкими показателями, как правило, свободны от этих депрессивных чувств.`
    },
    {
      facet: 4,
      title: 'Застенчивость',
      text: `Застенчивые люди чувствительны к тому, что о них думают другие. Их беспокойство по поводу отвержения и насмешек заставляет их чувствовать себя неловко и неуютно в обществе. Они легко смущаются и часто испытывают чувство стыда. Их страхи, что другие будут критиковать или насмехаться над ними, преувеличены и нереалистичны, но их неловкость и дискомфорт могут сделать эти страхи самосбывающимся пророчеством. Люди с низкими показателями, напротив, не страдают от ошибочного впечатления, что все их наблюдают и оценивают. Они не чувствуют себя нервными в социальных ситуациях.`
    },
    {
      facet: 5,
      title: 'Несдержанность',
      text: `Несдержанные люди испытывают сильные влечения и желания, которые им трудно подавить. Они склонны ориентироваться на краткосрочные удовольствия и награды, а не на долгосрочные последствия. Люди с низкими показателями не испытывают сильных, непреодолимых влечений и, следовательно, не поддаются искушению чрезмерно потакать своим желаниям.`
    },
    {
      facet: 6,
      title: 'Уязвимость',
      text: `Люди с высокими показателями по шкале уязвимости испытывают панику, замешательство и беспомощность под давлением или стрессом. Люди с низкими показателями чувствуют себя более уверенно, спокойно и ясно мыслят в стрессовых ситуациях.`
    }
  ]
}

export default neuroticism
