import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: 'Нейротизм',
  shortDescription: 'Нейротизм означает склонность к переживанию негативных чувств.',
  description: `Изначально Фрейд использовал термин «невроз» для описания
состояния, характеризующегося душевным страданием, эмоциональной болью и
неспособностью эффективно справляться с обычными требованиями жизни. Он
предполагал, что каждый человек проявляет некоторые признаки невроза, но
мы различаемся по степени страданий и по конкретным симптомам дистресса.
Сегодня под нейротизмом понимают склонность к переживанию негативных
чувств. <br /><br />Те, у кого высокие результаты по Нейротизму, могут
испытывать преимущественно какое-то одно конкретное негативное чувство,
например тревогу, гнев или депрессию, но, скорее всего, будут переживать
несколько из этих эмоций. <br /><br />Люди с высоким нейротизмом эмоционально
реактивны. Они реагируют эмоционально на события, которые не затронули бы
большинство людей, и их реакции обычно интенсивнее нормы. Они чаще
воспринимают обычные ситуации как угрожающие, а мелкие неурядицы — как
безнадёжно трудные. <br /><br />Их негативные эмоциональные реакции, как
правило, сохраняются необычно долго, из-за чего они часто пребывают в
плохом настроении. Эти проблемы с эмоциональной регуляцией могут снижать
способность человека ясно мыслить, принимать решения и эффективно
справляться со стрессом.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твой результат по Нейротизму низкий: ты исключительно
спокоен, собран и невозмутим. Ты не реагируешь сильными эмоциями даже
на ситуации, которые большинство людей назвали бы стрессовыми.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твой результат по Нейротизму средний: твой уровень эмоциональной
реактивности типичен для большинства людей. Стрессовые и фрустрирующие
ситуации расстраивают тебя в некоторой степени, но в целом ты способен
справиться с этими чувствами и с самими ситуациями.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твой результат по Нейротизму высокий: тебя легко вывести из
равновесия, даже тем, что большинство людей считает обычными требованиями
жизни. Окружающие считают тебя чувствительным и эмоциональным человеком.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Тревожность',
      text: `У тревожных людей система мозга «бей или беги» включается
слишком легко и слишком часто. Поэтому люди с высокой тревожностью часто
чувствуют, будто вот-вот случится что-то опасное. Они могут бояться
конкретных ситуаций или просто постоянно чего-то опасаться. Они чувствуют
напряжение, нервозность и взвинченность. Люди с низкой Тревожностью, как
правило, спокойны и бесстрашны.`
    },
    {
      facet: 2,
      title: 'Гневливость',
      text: `Люди с высокими результатами по Гневу приходят в ярость, когда
дела идут не так, как им хочется. Они тонко чувствуют справедливое к себе
отношение и испытывают обиду и горечь, когда им кажется, что их обманывают.
Эта шкала измеряет склонность испытывать гнев; выражает ли человек
раздражение и враждебность, зависит от уровня его Доброжелательности.
Люди с низкими результатами гневаются редко и неохотно.`
    },
    {
      facet: 3,
      title: 'Депрессивность',
      text: `Эта шкала измеряет склонность чувствовать грусть, уныние и
упадок духа. Людям с высокими результатами не хватает энергии, и им
трудно начинать какие-либо дела. Люди с низкими результатами, как
правило, свободны от этих депрессивных чувств.`
    },
    {
      facet: 4,
      title: 'Застенчивость',
      text: `Застенчивые люди чувствительны к тому, что о них думают другие.
Опасения быть отвергнутыми и осмеянными заставляют их чувствовать себя
робко и неуютно рядом с окружающими. Их легко смутить, и они часто
испытывают стыд. Их страхи, что другие будут критиковать или высмеивать
их, преувеличены и нереалистичны, но неловкость и дискомфорт могут
превратить эти страхи в самосбывающееся пророчество. Люди с низкими
результатами, напротив, не страдают от ложного ощущения, что все за ними
наблюдают и судят их. Они не нервничают в социальных ситуациях.`
    },
    {
      facet: 5,
      title: 'Невоздержанность',
      text: `Невоздержанные люди испытывают сильные желания и позывы,
которым им трудно противостоять. Они склонны ориентироваться на
краткосрочные удовольствия и награды, а не на долгосрочные последствия.
Люди с низкими результатами не испытывают сильных, непреодолимых позывов
и поэтому не поддаются соблазну потакать своим слабостям.`
    },
    {
      facet: 6,
      title: 'Уязвимость',
      text: `Люди с высокими результатами по Уязвимости под давлением или
стрессом испытывают панику, растерянность и беспомощность. Люди с низкими
результатами в стрессовых ситуациях чувствуют себя более собранными,
уверенными и ясно мыслящими.`
    }
  ]
}

export default neuroticism
