import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: 'Открытость к опыту',
  shortDescription: 'Открытость к опыту описывает измерение когнитивного стиля, которое отличает воображаемых, творческих людей от приземленных, традиционных людей.',
  description: `Открытые люди интеллектуально любознательны, ценят искусство и чувствительны к красоте. По сравнению с закрытыми людьми, они более осведомлены о своих чувствах. Они склонны мыслить и действовать индивидуалистично и нестандартно. Интеллектуалы обычно получают высокие баллы по шкале открытости к опыту; поэтому этот фактор также называют Культурой или Интеллектом. <br /><br />Тем не менее, Интеллект, вероятно, лучше всего рассматривать как один из аспектов открытости к опыту. Баллы по шкале открытости к опыту лишь умеренно связаны с количеством лет образования и результатами стандартных тестов на интеллект.<br /><br />Еще одной характеристикой открытого когнитивного стиля является способность мыслить символами и абстракциями, далекими от конкретного опыта. В зависимости от конкретных интеллектуальных способностей индивида, это символическое мышление может принимать форму математического, логического или геометрического мышления, художественного и метафорического использования языка, музыкальной композиции или исполнения, или одного из многих визуальных или исполнительских искусств.<br /><br />Люди с низкими баллами по шкале открытости к опыту склонны иметь узкие, общепринятые интересы. Они предпочитают простое, прямолинейное и очевидное сложному, двусмысленному и тонкому. Они могут относиться к искусству и наукам с подозрением, считая эти занятия абстрактными или бесполезными. Закрытые люди предпочитают знакомое новому; они консервативны и сопротивляются изменениям.<br /><br />Открытость часто представляется психологами как более здоровая или зрелая, поскольку они сами часто открыты к опыту. Однако открытые и закрытые стили мышления полезны в разных условиях. Интеллектуальный стиль открытого человека может быть полезен профессору, но исследования показали, что закрытое мышление связано с превосходной производительностью труда в полиции, продажах и ряде сервисных профессий.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат по шкале открытости к опыту низкий, что указывает на то, что вы предпочитаете думать простыми и ясными категориями. Другие описывают вас как приземленного, практичного и консервативного человека.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат по шкале открытости к опыту средний, что указывает на то, что вы цените традиции, но готовы пробовать новое. Ваше мышление ни простое, ни сложное. Для других вы кажетесь образованным человеком, но не интеллектуалом.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат по шкале открытости к опыту высокий, что указывает на то, что вы любите новизну, разнообразие и перемены. Вы любознательны, воображаемы и креативны.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Воображение',
      text: `Для воображаемых людей реальный мир часто кажется слишком простым и обыденным. Люди с высокими баллами по этой шкале используют фантазию как способ создания более богатого и интересного мира. Люди с низкими баллами по этой шкале больше ориентированы на факты, чем на фантазию.`
    },
    {
      facet: 2,
      title: 'Художественные интересы',
      text: `Люди с высокими баллами по этой шкале любят красоту, как в искусстве, так и в природе. Они легко вовлекаются и погружаются в художественные и природные события. Они не обязательно имеют художественное образование или талант, хотя многие из них будут. Определяющими чертами этой шкалы являются интерес и восприятие естественной и искусственной красоты. Люди с низкими баллами не обладают эстетической чувствительностью и интересом к искусству.`
    },
    {
      facet: 3,
      title: 'Эмоциональность',
      text: `Люди с высокими баллами по шкале эмоциональности хорошо осознают и понимают свои чувства. Люди с низкими баллами менее осведомлены о своих чувствах и, как правило, не выражают свои эмоции открыто.`
    },
    {
      facet: 4,
      title: 'Стремление к приключениям',
      text: `Люди с высокими баллами по шкале стремления к приключениям жаждут пробовать новые виды деятельности, путешествовать в чужие страны и испытывать разные вещи. Они находят знакомое и рутинное скучным и готовы выбрать новый маршрут домой просто потому, что он другой. Люди с низкими баллами склонны чувствовать себя некомфортно с изменениями и предпочитают знакомые рутины.`
    },
    {
      facet: 5,
      title: 'Интеллект',
      text: `Интеллект и художественные интересы — два наиболее важных, центральных аспекта открытости к опыту. Люди с высокими баллами по шкале интеллекта любят играть с идеями. Они открыты для новых и необычных идей и любят обсуждать интеллектуальные вопросы. Им нравятся загадки, головоломки и интеллектуальные задачи. Люди с низкими баллами по шкале интеллекта предпочитают иметь дело с людьми или вещами, а не с идеями. Они считают интеллектуальные упражнения пустой тратой времени. Интеллект не следует путать с интеллектом. Интеллект — это интеллектуальный стиль, а не интеллектуальная способность, хотя люди с высокими баллами по шкале интеллекта получают немного более высокие результаты на стандартизированных тестах на интеллект, чем люди с низкими баллами.`
    },
    {
      facet: 6,
      title: 'Либерализм',
      text: `Психологический либерализм относится к готовности бросить вызов авторитету, традициям и общепринятым ценностям. В своей крайней форме психологический либерализм может даже представлять собой откровенную враждебность к правилам, симпатию к нарушителям закона и любовь к двусмысленности, хаосу и беспорядку. Психологические консерваторы предпочитают безопасность и стабильность, которые приносит следование традициям. Психологический либерализм и консерватизм не идентичны политической принадлежности, но, безусловно, склоняют людей к определенным политическим партиям.`
    }
  ]
}

export default openness
