import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: 'Открытость опыту',
  shortDescription: 'Открытость опыту описывает измерение стилей мышления, которые отличают творческих, изобретательных людей от обычных, приземлённых людей.',
  description: `Открытые люди – люди с интеллектуальными интересами, тонким восприятием искусства
  и чувствительностью к красоте. По сравнению с закрытыми людьми, они более осведомлены о своих чувствах.
  Они склонны мыслить индивидуально и нестандартно. Как правило, интеллектуалы набирают больший результат
   по этой шкале; поэтому этот фактор также назывался "Культурой интеллекта".
 <br /><br />Несмотря на это, интеллект является лишь одной чертой открытости опыта.
  Результаты по шкале открытости опыту слабо соотносятся с количеством лет обучения и
  баллами на стандартных тестах, измеряющих интеллект.
<br /><br />
Другой характеристикой открытого стиля мышления является склонность мыслить символами и абстракциями, 
оторванными от конкретного опыта. В зависимости от интеллектуальных способностей человека,
символическая картина мира может принимать форму математического, логического или геометрического мышления,
использования художественных образов и метафор в языке, музыкальных композиций, выступлений, или одного из
многих визуальных, либо исполнительных видов искусства.
<br /><br />
Люди с низкой открытостью склонны иметь узкие, частые интересы. Они с большим предпочтением
выберут простое, однозначное и очевидное в пользу сложного, многозначного и тонкого. Они могут
с подозрением относиться к искусству и науке, считая эти начинания заумными или непрактичными.
Закрытые люди консервативны, не любят изменения и предпочитают то, что уже знакомо.
<br /><br />
Открытость опыту часто представляется как более здоровая форма мышления со стороны
психологов, которые сами по себе часто имеют высокую открытость. Однако открытый
и закрытый стили мышления могут быть полезны в разном окружении. Интеллектуальный стиль может
быть полезен для профессоров, учёных или творческих людей. Однако исследования показали,
что закрытое мышление связано с лучшим исполнением работы в полиции, сфере продаж и многих других профессиях.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Ваш результат по шкале Открытость низкий, поэтому вы предпочитаете
мыслить простыми и понятными терминами. Другие описали бы вас как
приземлённого, практичного и консервативного человека.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Ваш результат по шкале Открытость средний. Вы любите традицию, однако
также готовы пробовать новые вещи. Ваше мышление нельзя назвать ни простым,
ни сложным. Другие описали бы вас как образованного человека, но не как интеллектуала.`
    },
    {
      score: 'high', // do not translate this line
      text: `Ваш результат по шкале Открытость высокий. Вы любите новизну,
      разнообразие и перемены. Вы любознательный, изобретательный и творческий человек.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Воображение',
      text: `Люди с богатым воображением считают реальный мир
слишком простым и обыденным. Они используют фантазию как инструмент
для создания более богатого и интересного мира. Люди с низким
воображением ориентируются больше на факты, чем на фантазию.`
    },
    {
      facet: 2,
      title: 'Интерес к искусству',
      text: `Люди, набравшие высокий результат, любят красоту как в искусстве,
так и в природе. Они легко вовлекаются в события художественного и
естественного мира и как бы поглощаются ими. Высокий уровень художественного
интереса не обязательно говорит о художественном образовании или талантах,
несмотря на их крепкую взаимосвязь. Определяющими факторами этой шкалы
являются интерес к искусству и тонкое понимание естественной и
искусственной красоты. Люди с низким результатом с бо́льшим трудом
понимают многие произведения из сферы искусства, требующие эстетической чувствительности.`
    },
    {
      facet: 3,
      title: 'Эмоциональность',
      text: `Люди с высоким уровнем эмоциональности имеют развитую способность к
осознанию своих чувств. Люди с низкими показателями по этой шкале менее
осведомлены о своих чувствах и редко выражают свои эмоции.`
    },
    {
      facet: 4,
      title: 'Авантюризм',
      text: `Люди с высокими результатами авантюризма любят искать приключения,
пробовать что-то новое, они готовы отправиться в путешествие за границу
и испытать разные вещи. Им скучно уже известное и рутинное, и они
готовы выбрать новый маршрут домой только для того, чтобы сменить
привычную колею. Люди с низкими результатами склонны чувствовать
себя некомфортно при переменах, отдавая предпочтение привычному распорядку дня.`
    },
    {
      facet: 5,
      title: 'Интеллект',
      text: `Интеллект и интерес к искусству – два наиболее
важных аспекта Открытости. Люди с высокими показателями
интеллекта любят импровизировать с идеями. Они открыты новым и необычным идеям
и любят обсуждать интеллектуальные вопросы. Им нравятся загадки и головоломки.
Люди с низким показателем интеллекта предпочитают иметь дело либо с людьми,
либо с вещами. Интеллект не следует отождествлять с IQ, так как под этим
подразумевается стиль мышления, а не какая-либо способность, однако люди
с высокими баллами по шкале интеллекта набирают относительно высокий результат
в стандартизированных тестах, измеряющих его. `
    },
    {
      facet: 6,
      title: 'Либерализм',
      text: `Психологический либерализм подразумевает готовность бросить
вызов авторитету, условностям и традиционным ценностям. В крайней форме,
психологический либерализм может даже представлять собой откровенную
враждебность к правилам и любовь к хаосу и беспорядку. Люди с низким
показателем по этой черте предпочитают безопасность и стабильность,
следуя традициям.`
    }
  ]
}

export default openness
