import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: 'Открытость опыту',
  shortDescription: 'Открытость опыту описывает измерение когнитивного стиля, отличающее людей с богатым воображением и творческих от практичных и консервативных.',
  description: `Открытые люди интеллектуально любознательны,
ценят искусство и чувствительны к красоте. По сравнению с закрытыми
людьми они, как правило, лучше осознают свои чувства. Они склонны мыслить
и действовать индивидуалистично и нонконформистски. Интеллектуалы обычно
имеют высокие результаты по Открытости опыту; поэтому этот фактор также
называли Культурой или Интеллектом. <br /><br />Тем не менее Интеллект, скорее
всего, правильнее рассматривать как один из аспектов открытости опыту.
Результаты по Открытости опыту лишь умеренно связаны с количеством лет
образования и показателями стандартных тестов интеллекта.
<br /><br />
Ещё одна черта открытого когнитивного стиля — способность мыслить
символами и абстракциями, далёкими от конкретного опыта. В зависимости
от конкретных интеллектуальных способностей человека это символическое
мышление может принимать форму математического, логического или
геометрического мышления, художественного и метафорического использования
языка, сочинения или исполнения музыки, а также одного из множества
изобразительных или исполнительских видов искусства.
<br /><br />
Люди с низкими результатами по открытости опыту, как правило, имеют
узкие, обычные интересы. Они предпочитают простое, прямое и очевидное
сложному, неоднозначному и тонкому. Они могут относиться к искусству и
науке с подозрением, считая эти занятия непонятными или практически
бесполезными. Закрытые люди предпочитают привычное новому; они
консервативны и сопротивляются переменам.
<br /><br />
Психологи, которые сами нередко открыты опыту, часто представляют
открытость как более здоровое или зрелое качество. Однако открытый и
закрытый стили мышления полезны в разных средах. Интеллектуальный стиль
открытого человека может отлично служить профессору, но исследования
показали, что закрытое мышление связано с более высокой эффективностью
работы в полиции, торговле и ряде сфер обслуживания.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твой результат по Открытости опыту низкий: ты любишь мыслить
простыми и ясными категориями. Окружающие описывают тебя как практичного,
земного и консервативного человека.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твой результат по Открытости опыту средний: ты ценишь
традиции, но готов пробовать новое. Твоё мышление нельзя назвать ни
простым, ни сложным. Окружающим ты кажешься образованным человеком,
но не интеллектуалом.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твой результат по Открытости опыту высокий: ты любишь новизну,
разнообразие и перемены. Ты любознательный, с богатым воображением и
творческий человек.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Воображение',
      text: `Для людей с богатым воображением реальный мир часто слишком
прост и обыден. Люди с высокими результатами по этой шкале используют
фантазию как способ создать более богатый и интересный мир. Люди с
низкими результатами по этой шкале больше ориентированы на факты, чем на
фантазии.`
    },
    {
      facet: 2,
      title: 'Художественные интересы',
      text: `Люди с высокими результатами по этой шкале любят красоту — как в
искусстве, так и в природе. Они легко вовлекаются в художественные и
природные события и погружаются в них. Они не обязательно получили
художественное образование или обладают талантом, хотя многие из них —
да. Определяющими чертами этой шкалы являются интерес к естественной и
искусственной красоте и способность её ценить. Людям с низкими
результатами не хватает эстетической чувствительности и интереса к
искусству.`
    },
    {
      facet: 3,
      title: 'Эмоциональность',
      text: `Люди с высокой Эмоциональностью хорошо осознают и понимают свои
чувства. Люди с низкими результатами меньше осознают свои чувства и, как
правило, не выражают эмоции открыто.`
    },
    {
      facet: 4,
      title: 'Готовность к приключениям',
      text: `Люди с высокими результатами по готовности к приключениям стремятся
пробовать новые занятия, путешествовать в другие страны и узнавать
разное. Привычное и рутинное навевает на них скуку, и они выберут новую
дорогу домой просто потому, что она другая. Люди с низкими результатами
обычно чувствуют себя некомфортно при переменах и предпочитают привычный
уклад.`
    },
    {
      facet: 5,
      title: 'Интеллект',
      text: `Интеллект и художественные интересы — два самых важных,
центральных аспекта открытости опыту. Люди с высокими результатами по
Интеллекту любят играть с идеями. Они непредвзяты к новым и необычным
идеям и любят обсуждать интеллектуальные вопросы. Им нравятся загадки,
головоломки и задачи на сообразительность. Люди с низкими результатами
по Интеллекту предпочитают иметь дело с людьми или вещами, а не с идеями.
Интеллектуальные упражнения они считают пустой тратой времени. Интеллект
не следует путать с умом. Интеллект — это интеллектуальный стиль, а не
интеллектуальная способность, хотя люди с высокими результатами по
Интеллекту набирают в стандартных тестах интеллекта немного больше
очков, чем люди с низкими результатами.`
    },
    {
      facet: 6,
      title: 'Либерализм',
      text: `Психологический либерализм означает готовность оспаривать
авторитеты, условности и традиционные ценности. В самой крайней форме
психологический либерализм может выражаться даже в открытой враждебности
к правилам, сочувствии к нарушителям закона и любви к неоднозначности,
хаосу и беспорядку. Психологические консерваторы предпочитают безопасность
и стабильность, которые даёт следование традиции. Психологический
либерализм и консерватизм не тождественны политическим убеждениям, но,
безусловно, склоняют людей к определённым политическим партиям.`
    }
  ]
}

export default openness
