const russian = {
  language: {
    label: 'Russian',
    locale: 'ru'
  },
  seo: {
    keywords:
      'тест Большой пятерки, тест B5, тест BigFive, личностные качества, сравнить, бесплатно, Джордан Пертерсон'
  },
  frontpage: {
    seo: {
      title: 'Бесплатный тест личности BigFive с открытым исходным кодом',
      description:
        'Пройдите бесплатный личностный тест с открытым исходным кодом. Узнайте свои личностные качества и сравните себя со своим партнером, коллегами, друзьями или семьей.'
    },
    title: 'Тест личности BigFive',
    call_to_action: 'Примите участие сейчас',
    no_registration: '* Без регистрации',
    tests_taken:
      'Более <green>{n}</green> человек на данный момент приняло участие',
    compare: {
      title: 'Сравните себя с другими.',
      text1:
        'Сравните себя со своим партнером, коллегами, друзьями или семьей.',
      text2: 'Узнайте, чем вы отличаетесь от других по пяти аспектам:',
      action: 'Убедитесь сами'
    },
    share:
      'Поделитесь своими результатами с друзьями и узнайте, насколько вы совместимы.',
    cards: {
      open: {
        title: 'Открытый',
        text: 'Этот тест является проектом с открытым исходным кодом и лицензией MIT.'
      },
      free: {
        title: 'Бесплатный',
        text: 'Этот тест - бесплатный'
      },
      scientific: {
        title: 'Научный',
        text: 'Большая пятерка - это научно обоснованная и надежная модель для измерения личности.'
      },
      translated: {
        title: 'Перевод',
        text: 'Переведен более чем на 20 языков. Помоги нам <a href="https://b5.translations.alheimsins.net/" rel="noreferrer" target="blank">тут</a>!'
      }
    },
    description: {
      top: 'Узнайте себя лучше с помощью этого <violet>бесплатного</violet> личностного теста.',
      subtop: 'Это',
      subtop2:
        'наиболее научно обоснованная и надежная психологическая модель для измерения личности.',
      reference: `Тесты и анализы для этой страницы взяты из
<a href="http://ipip.ori.org" rel="noopener" target="_blank">ipip.ori.org</a>,
inventory is from <i>Johnson's (2014) 120-item IPIP NEO-PI-R</i>.`,
      info: 'Следующий тест состоит из 120 вопросов и займет примерно 10 минут вашего времени.',
      result:
        'После прохождения теста вы получите подробное описание вашей личности по следущим аспектам:',
      tests_taken: 'Выполненные тесты'
    }
  },
  about: {
    seo: {
      title: 'Про нас',
      description:
        'BigFive возглавляет очень активная и преданная своему делу команда, которая постоянно стремится развивать проект.'
    }
  },
  toolbar: {
    home: 'Домашняя страница',
    result: 'Результаты',
    compare: 'Сравнить',
    articles: 'Статья',
    privacy: 'Защита персональных данных',
    about: 'О нас',
    see_results: 'Посмотрите свои результаты',
    compare_with: 'Сравнить с другими',
    faq: 'FAQ'
  },
  facets: {
    openness_to_experience: {
      title: 'Открытось опыту'
    },
    conscientiousness: {
      title: 'Добросовестность'
    },
    extraversion: {
      title: 'Экстраверсия'
    },
    agreeableness: {
      title: 'Уживчивость'
    },
    neuroticism: {
      title: 'Невротизм'
    }
  },
  common: {
    and: 'и',
    pages: 'содержание',
    languages: 'языки',
    save: 'Save',
    close: 'Close'
  },
  form: {
    information: 'Информация',
    informationText:
      'Мы используем предоставленную вами информацию, чтобы предоставить вам',
    mostAccurate: 'максимально точный результат.',
    readMoreAbout: 'Узнайте больше',
    privacy: 'Защита персональных данных',
    nextButton: 'Ок, следующий вопрос',
    declineButton: 'Продолжить, не делясь',
    prefferedLanguage: 'Мой предпочтительный язык',
    selectLanguage: 'Выбрать язык',
    iama: 'Я',
    male: 'Мужчина',
    female: 'Женщина',
    age: 'Возраст',
    iam: 'Я',
    yearsOld: 'лет',
    ageWarning: 'Вам должно быть не менее 16 лет',
    language: 'Язык',
    gender: 'Пол',
    confirmInfo: 'Подтвердить информацию',
    confirm: 'Подтвердить',
    toTestButton: 'Хорошо, давайте перейдем к тесту'
  },
  test: {
    next: 'Далее',
    back: 'Назад',
    more: 'Больше',
    seeResults: 'Увидеть результаты'
  },
  big_five: {
    title: 'Что такое Большая пятерка?',
    seo: {
      title: 'Что такое Большая пятерка?',
      description: 'Узнайте больше про Большую пятерку'
    }
  },
  openness_to_experience: {
    title: 'Открытость опыту',
    seo: {
      title: 'Обзор аспекта Открытость опыту.',
      description:
        'Узнайте больше про аспект Открытость опыту в модели Большой пятерки'
    }
  },
  conscientiousness: {
    title: 'Добросовестность',
    seo: {
      title: 'Обзор аспекта Добросовестность',
      description:
        'Узнайте больше про аспект Добросовестность в модели Большой пятерки'
    }
  },
  extraversion: {
    title: 'Экстраверсия',
    seo: {
      title: 'Обзор аспекта Экстраверсия',
      description:
        'Узнайте больше про аспект Экстраверсия в модели Большой пятерки'
    }
  },
  agreeableness: {
    title: 'Уживчивость',
    seo: {
      title: 'Обзор аспекта Уживчивость',
      description:
        'Узнайте больше про аспект Уживчивость в модели Большой пятерки'
    }
  },
  neuroticism: {
    title: 'Невротизм',
    seo: {
      title: 'Обзор аспекта Невротизм',
      description:
        'Узнайте больше про аспект Невротизм в модели Большой пятерки'
    }
  },
  getCompare: {
    title: 'Сравните людей или команды',
    description1:
      'Сравните результаты вашего теста личности BigFive с результатами других участников.',
    description2: 'Введите ID результатов вашего теста, например',
    description3: 'в поле ввода ID',
    needToAddPeople: 'Вам необходимо добавить людей, чтобы сравнить их',
    addAnother: 'Добавить еще одного человека',
    addPerson: 'Добавить человека',
    comparePeople: 'Сравнить людей',
    nameOfPerson: 'Имя человека',
    urlOrId: 'URL-ссылка или ID для сравнения',
    name: 'Имя'
  },
  results: {
    theBigFive: 'Большая пятерка',
    score: 'Баллы',
    important: 'Важно!',
    saveResults:
      'Сохраните этот ID, чтобы позднее получить результаты или чтобы',
    compare: 'сравнить',
    toOthers: 'себя с другими',
    seo: {
      title: 'Мои результаты личностного теста BigFive',
      description:
        'Узнайте о своей личности и сравните себя по следующим пяти аспектам: Невротизм, Открытость опыту, Добросовестность, Экстраверсия, Уживчивость'
    }
  },
  getResult: {
    result: 'Результаты',
    explanation:
      'Если вы прошли тест и сохранили свой ID, вы можете увидеть результаты, введя свой ID, например',
    idInput: 'в поле ввода ID',
    urlOrId: 'URL-ссылка или ID для сравнения',
    getResult: 'К результату',
    viewPrevious: 'Просмотреть предыдущий результат'
  },
  shareLinks: {
    copyLink: 'Скопировать ссылку в буфер обмена',
    shareFacebook: 'Поделиться на Facebook',
    shareTwitter: 'Поделиться в Twitter',
    copiedLink: 'Скопировать ссылку',
    shareResults: 'Поделитесь своим результатом!'
  }
};

export default russian;
