const ukrainian = {
  language: {
    label: 'Ukrainian',
    locale: 'uk'
  },
  seo: {
    keywords:
      "особистісний тест Великої п'ятірки, тест B5, тест BigFive, особистісні якості, порівняти, безкоштовно, Джордан Петерсон"
  },
  frontpage: {
    seo: {
      title: 'Безкоштовний тест особистості від BigFive з відкритим кодом',
      description:
        "Пройдіть безкоштовний тест особистості з відкритим кодом. Дізнайтесь про свої особові якості та порівняйте себе зі своїм партнером, колегами, друзями чи сім'єю."
    },
    title: 'Тест особистості від BigFive',
    call_to_action: 'Прийміть участь зараз',
    no_registration: '* Без реєстрації',
    tests_taken:
      'Більш ніж <green>{n}</green> людей на даний момент пройшли тест',
    compare: {
      title: 'Порівняйте себе з іншими.',
      text1: "Порівняйте себе зі своїм партнером, колегами, друзями чи сім'єю.",
      text2: "Дізнайтесь, чим ви відрізняєтесь від інших по п'яти аспектам:",
      action: 'Переконайтесь самі'
    },
    share:
      'Поділитесь своїми результатами з друзями та дізнайтесь, наскільки ви сумісні.',
    cards: {
      open: {
        title: 'Відкритий',
        text: 'Цей тест є проектом з відкритим кодом та ліцензією MIT.'
      },
      free: {
        title: 'Безкоштовний',
        text: 'Цей тест - безкоштовний'
      },
      scientific: {
        title: 'Науковий',
        text: "Велика п'ятірка - це научно обґрунтована та надійна модель для визначення особистісних якостей."
      },
      translated: {
        title: 'Перекладений',
        text: 'Перекладений більш ніж на 20 мов. Допоможи нам <a href="https://b5.translations.alheimsins.net/" rel="noreferrer" target="blank"> тут </a>!'
      }
    },
    description: {
      top: 'Дізнайтеся себе краще за допомогою цього <violet>безкоштовного</violet> тесту особистості.',
      subtop: 'Це',
      subtop2:
        'найбільш науково обґрунтована і надійна психологічна модель для визначення особистості.',
      reference: `Тести і аналізи для цієї сторінки взяті з
<a href="http://ipip.ori.org" rel="noopener" target="_blank"> ipip.ori.org </a>,
inventory is from <i> Johnson's (2014) 120-item IPIP NEO-PI-R </ i> .`,
      info: 'Наступний тест складається з 120 питань і займе приблизно 10 хвилин вашого часу.',
      result:
        'Після проходження тесту ви отримаєте детальний опис вашої особистості по наступним аспектам:',
      tests_taken: 'Виконані тести'
    }
  },
  about: {
    seo: {
      title: 'Про нас',
      description:
        'BigFive очолює дуже активна і віддана своїй справі команда, яка постійно прагне розвивати проект.'
    }
  },
  toolbar: {
    home: 'Домашня сторінка',
    result: 'Результати',
    compare: 'Порівняти',
    articles: 'Статті',
    privacy: 'Захист персональних даних',
    about: 'Про нас',
    see_results: 'Ваші результати',
    compare_with: 'Порівняти з іншими',
    faq: 'FAQ'
  },
  facets: {
    openness_to_experience: {
      title: 'Відкритий досвід'
    },
    conscientiousness: {
      title: 'Сумлінність'
    },
    extraversion: {
      title: 'Екстраверсія'
    },
    agreeableness: {
      title: 'Лад з оточуючими'
    },
    neuroticism: {
      title: 'Невротизм'
    }
  },
  common: {
    and: 'і',
    pages: 'зміст',
    languages: 'мови',
    save: 'Save',
    close: 'Close'
  },
  form: {
    information: 'Інформація',
    informationText: 'Ми використовуємо надану вами інформацію, щоб надати вам',
    mostAccurate: 'максимально точний результат.',
    readMoreAbout: 'Дізнайтеся більше',
    privacy: 'Захист персональних даних',
    nextButton: 'Ок, наступне питання',
    declineButton: 'Продовжити не поділившись',
    prefferedLanguage: 'Моя бажана мова',
    selectLanguage: 'Вибір мови',
    iama: 'Я',
    male: 'Чоловік',
    female: 'Жінка',
    age: 'Вік',
    iam: 'Мені',
    yearsOld: 'років',
    ageWarning: 'Вам повинно бути не менше 16 років',
    language: 'Мова',
    gender: 'Стать',
    confirmInfo: 'Підтвердити інформацію',
    confirm: 'Підтвердити',
    toTestButton: 'Добре, перейдемо до тесту'
  },
  test: {
    next: 'Далі',
    back: 'Назад',
    more: 'Більше',
    seeResults: 'Побачити результати'
  },
  big_five: {
    title: "Що таке Велика п'ятірка?",
    seo: {
      title: "Що таке Велика п'ятірка?",
      description: "Дізнайтеся більше про Велику п'ятірку"
    }
  },
  openness_to_experience: {
    title: 'Відкритість досвіду',
    seo: {
      title: 'Огляд аспекту Відкритість досвіду.',
      description:
        "Дізнайтеся більше про аспект Відкритості досвіду в моделі Великої п'ятірки"
    }
  },
  conscientiousness: {
    title: 'Сумлінність',
    seo: {
      title: 'Огляд аспекту Сумлінність',
      description:
        "Дізнайтеся більше про аспект Сумлінності в моделі Великої п'ятірки"
    }
  },
  extraversion: {
    title: 'Екстраверсія',
    seo: {
      title: 'Огляд аспекту Екстраверсія',
      description:
        "Дізнайтеся більше про аспект Екстраверсії в моделі Великої п'ятірки"
    }
  },
  agreeableness: {
    title: 'Лад з оточуючими',
    seo: {
      title: 'Огляд аспекту Лад з оточуючими',
      description:
        "Дізнайтеся більше про аспект Лад з оточуючими в моделі Великої п'ятірки"
    }
  },
  neuroticism: {
    title: 'Невротизм',
    seo: {
      title: 'Огляд аспекту Невротизм',
      description:
        "Дізнайтеся більше про аспект Невротизму в моделі Великої п'ятірки"
    }
  },
  getCompare: {
    title: 'Порівняйте людей або команди',
    description1:
      'Порівняйте результати вашого тесту особистості BigFive з результатами інших учасників.',
    description2: 'Введіть ID результатів вашого тесту, наприклад',
    description3: 'в поле введення ID',
    needToAddPeople: 'Вам необхідно додати людей, щоб порівняти їх',
    addAnother: 'Додати ще одну людину',
    addPerson: 'Додати людину',
    comparePeople: 'Порівняти результати людей',
    nameOfPerson: "Ім'я людини",
    urlOrId: 'URL-посилання або ID для порівняння',
    name: "Ім'я"
  },
  results: {
    theBigFive: "Велика п'ятірка",
    score: 'Бали',
    important: 'Важливо!',
    saveResults: 'Збережіть цей ID, щоб пізніше отримати результати або щоб',
    compare: 'порівняти',
    toOthers: 'свої результати з іншими',
    seo: {
      title: 'Мої результати особистісного тесту BigFive',
      description:
        "Дізнайтеся про свою особистість і порівняйте себе з наступних п'яти аспектів: Невротизм, Відкритість досвіду, Сумлінність, Екстраверсія, Лад з оточуючими"
    }
  },
  getResult: {
    result: 'Результати',
    explanation:
      'Якщо ви пройшли тест і зберегли свій ID, ви можете побачити результати, ввівши свій ID, наприклад',
    idInput: 'в поле введення ID',
    urlOrId: 'URL-посилання або ID для порівняння',
    getResult: 'До результату',
    viewPrevious: 'Переглянути попередній результат'
  },
  shareLinks: {
    copyLink: 'Копіювати посилання в буфер обміну',
    shareFacebook: 'Поділитися на Facebook',
    shareTwitter: 'Поділитися в Twitter',
    copiedLink: 'Копіювати посилання',
    shareResults: 'Поділіться своїм результатом!'
  }
};

export default ukrainian;
