import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: 'ความเป็นมิตร',
  shortDescription: 'ความเป็นมิตรสะท้อนถึงความแตกต่างระหว่างบุคคลในด้านความใส่ใจต่อการร่วมมือและความกลมเกลียวทางสังคม ผู้ที่มีความเป็นมิตรสูงให้คุณค่ากับการอยู่ร่วมกับผู้อื่นอย่างราบรื่น',
  description: `พวกเขาจึงเป็นผู้ที่เห็นอกเห็น เป็นมิตร ใจกว้าง
พร้อมช่วยเหลือ และยินยอมประนีประนอมผลประโยชน์ของตนเอง
กับผู้อื่น ผู้ที่มีความเป็นมิตรยังมองธรรมชาติของมนุษย์
ในแง่ดี พวกเขาเชื่อว่าคนทั่วไปนั้นซื่อสัตย์ ดีงาม และ
ไว้วางใจได้ <br /><br />
ในทางกลับกัน ผู้ที่มีความเป็นมิตรต่ำจะให้ความสำคัญกับผลประโยชน์
ของตนเองเหนือการอยู่ร่วมกับผู้อื่น โดยทั่วไปพวกเขาไม่ค่อย
ใส่ใจความเป็นอยู่ของคนอื่น และจึงไม่ค่อยเต็มใจที่จะ
อุทิศตนเพื่อผู้อื่น บางครั้งความสงสัยในเจตนาของผู้อื่น
ทำให้พวกเขากลายเป็นคนหวาดระแวง ไม่เป็นมิตร และ
ไม่ร่วมมือ
<br /><br />
ความเป็นมิตรเป็นคุณประโยชน์อย่างชัดเจนต่อการได้รับและ
รักษาความนิยมชมชอบ ผู้ที่มีความเป็นมิตรมักเป็นที่ชื่นชอบ
มากกว่าผู้ที่ไม่เป็นมิตร อย่างไรก็ตาม ความเป็นมิตรไม่ได้
เป็นประโยชน์ในสถานการณ์ที่ต้องการการตัดสินใจที่เด็ดขาด
หรือเป็นกลางอย่างสมบูรณ์ ผู้ที่มีความเป็นมิตรต่ำสามารถเป็น
นักวิทยาศาสตร์ นักวิจารณ์ หรือทหารที่ยอดเยี่ยมได้`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `คะแนนความเป็นมิตรของคุณอยู่ในระดับต่ำ ซึ่งบ่งชี้ว่าคุณใส่ใจ
ความต้องการของผู้อื่นน้อยกว่าความต้องการของตนเอง ผู้อื่นมอง
คุณเป็นคนที่เด็ดขาด จับผิด และไม่ยอมประนีประนอม`
    },
    {
      score: 'neutral', // do not translate this line
      text: `ระดับความเป็นมิตรของคุณอยู่ในระดับปานกลาง ซึ่งบ่งชี้ว่าคุณ
ใส่ใจความต้องการของผู้อื่นในระดับหนึ่ง แต่โดยทั่วไปแล้ว
คุณไม่เต็มใจที่จะเสียสละตนเองเพื่อผู้อื่น`
    },
    {
      score: 'high', // do not translate this line
      text: `ระดับความเป็นมิตรที่สูงของคุณบ่งชี้ว่าคุณมีความสนใจอย่างมาก
ต่อความต้องการและความเป็นอยู่ที่ดีของผู้อื่น คุณเป็นคนน่ารื่นรมย์
เห็นอกเห็นใจ และร่วมมือกับผู้อื่นได้ดี`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'ความไว้วางใจ',
      text: `ผู้ที่มีความไว้วางใจสูงจะถือว่าคนส่วนใหญ่เป็นคน
ยุติธรรม ซื่อสัตย์ และมีเจตนาดี ส่วนผู้ที่มีความไว้วางใจต่ำ
มองผู้อื่นว่าเห็นแก่ตัว ไม่ซื่อตรง และอาจเป็นอันตรายได้`
    },
    {
      facet: 2,
      title: 'ความซื่อตรง',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้มองว่าไม่จำเป็นต้อง
แสร้งทำหรือบงการผู้อื่นเมื่อต้องติดต่อกับคนอื่น พวกเขาจึง
เป็นคนซื่อตรง เปิดเผย และจริงใจ ส่วนผู้ที่ได้คะแนนต่ำเชื่อว่า
การปิดบังในระดับหนึ่งเป็นสิ่งจำเป็นในความสัมพันธ์ทางสังคม
ผู้คนสามารถเข้าถึงผู้ที่ได้คะแนนสูงซึ่งมีความตรงไปตรงมาได้
ค่อนข้างง่าย แต่มักรู้สึกว่าเข้าถึงผู้ที่ได้คะแนนต่ำซึ่งไม่
ตรงไปตรงมาได้ยากกว่า อย่างไรก็ตาม ควรทำความเข้าใจว่าผู้ที่
ได้คะแนนต่ำไม่ได้เป็นคนไร้หลักการหรือไร้ศีลธรรม พวกเขาเพียง
แค่ระมัดระวังตัวมากกว่าและไม่เต็มใจที่จะเปิดเผยความจริง
ทั้งหมดอย่างเปิดเผย`
    },
    {
      facet: 3,
      title: 'ความเสียสละเพื่อผู้อื่น',
      text: `ผู้ที่มีความเสียสละเพื่อผู้อื่นรู้สึกว่าการช่วยเหลือ
คนอื่นเป็นเรื่องที่คุ้มค่าอย่างแท้จริง ด้วยเหตุนี้พวกเขาจึง
เต็มใจที่จะช่วยเหลือผู้ที่เดือดร้อนโดยทั่วไป ผู้ที่มีความ
เสียสละมองว่าการทำสิ่งต่าง ๆ เพื่อผู้อื่นเป็นการบรรลุ
คุณค่าในตนเองมากกว่าที่จะเป็นการเสียสละ ส่วนผู้ที่ได้คะแนน
ต่ำในมาตรวัดนี้ไม่ค่อยชอบช่วยเหลือผู้ที่เดือดร้อน คำขอ
ความช่วยเหลือทำให้พวกเขารู้สึกว่าเป็นภาระมากกว่าที่จะเป็น
โอกาสในการบรรลุคุณค่าในตนเอง`
    },
    {
      facet: 4,
      title: 'ความร่วมมือ',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้ไม่ชอบการเผชิญหน้า
พวกเขายินดีอย่างเต็มที่ที่จะประนีประนอมหรือละทิ้งความ
ต้องการของตนเองเพื่อให้อยู่ร่วมกับผู้อื่นได้อย่างราบรื่น
ส่วนผู้ที่ได้คะแนนต่ำในมาตรวัดนี้มีแนวโน้มที่จะข่มขู่
ผู้อื่นเพื่อให้ได้สิ่งที่ตนต้องการมากกว่า`
    },
    {
      facet: 5,
      title: 'ความถ่อมตน',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้ไม่ชอบอ้างว่าตนเอง
ดีกว่าผู้อื่น ในบางกรณี ทัศนคตินี้อาจมาจากความมั่นใจ
ในตนเองหรือการเห็นคุณค่าในตนเองที่ต่ำ อย่างไรก็ตาม
ผู้ที่มีการเห็นคุณค่าในตนเองสูงบางคนก็มองว่าการไม่ถ่อมตน
เป็นเรื่องไม่เหมาะสม ส่วนผู้ที่เต็มใจจะอธิบายตนเองว่า
เหนือกว่าผู้อื่นมักถูกมองว่าเป็นคนยโสโอหังอย่างน่ารำคาญ`
    },
    {
      facet: 6,
      title: 'ความเห็นอกเห็นใจ',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้เป็นคนใจอ่อนและมี
ความเมตตา พวกเขารู้สึกถึงความเจ็บปวดของผู้อื่นราวกับเป็น
ของตนเองและสะเทือนใจได้ง่าย ส่วนผู้ที่ได้คะแนนต่ำไม่ได้
รับผลกระทบจากความทุกข์ยากของมนุษย์อย่างรุนแรงนัก พวกเขา
ภาคภูมิใจในการตัดสินอย่างเป็นกลางโดยอาศัยเหตุผล พวกเขา
ใส่ใจความจริงและความยุติธรรมที่ไม่ลำเอียงมากกว่าความเมตตา`
    }
  ]
}

export default agreeableness
