import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'ความมีวินัย',
  shortDescription: 'ความมีวินัยเกี่ยวข้องกับวิธีที่เราควบคุม ระงับ และชี้นำแรงกระตุ้นของเราเอง',
  description: `แรงกระตุ้นไม่ได้เป็นสิ่งไม่ดีในตัวมันเอง
บางครั้งข้อจำกัดด้านเวลาทำให้จำเป็นต้องตัดสินใจอย่างรวดเร็ว
และการกระทำตามแรงกระตุ้นแรกอาจเป็นการตอบสนองที่มีประสิทธิภาพ
นอกจากนี้ ในยามพักผ่อนมากกว่ายามทำงาน การกระทำตามธรรมชาติ
และตามแรงกระตุ้นก็สามารถสร้างความสนุกสนานได้ ผู้ที่กระทำ
ตามแรงกระตุ้นอาจถูกผู้อื่นมองว่าเป็นคนมีสีสัน อยู่ด้วยแล้ว
สนุก และขี้เล่น
<br /><br />
อย่างไรก็ตาม การกระทำตามแรงกระตุ้นอาจนำไปสู่ปัญหาได้หลายทาง
แรงกระตุ้นบางอย่างเป็นพฤติกรรมต่อต้านสังคม การกระทำที่ต่อต้าน
สังคมโดยไม่ได้ควบคุมไม่เพียงแต่ทำร้ายสมาชิกคนอื่นในสังคมเท่านั้น
แต่ยังอาจนำมาซึ่งการตอบโต้ต่อผู้ที่ก่อเหตุกระทำตามแรงกระตุ้น
ดังกล่าวอีกด้วย ปัญหาอีกประการหนึ่งของการกระทำตามแรงกระตุ้นคือ
มักให้ผลตอบแทนในระยะสั้นแต่ก่อผลเสียในระยะยาว ตัวอย่างเช่น
การเข้าสังคมมากเกินไปจนนำไปสู่การถูกไล่ออกจากงาน การพูดจา
ดูหมิ่นจนทำให้ความสัมพันธ์ที่สำคัญต้องแตกหัก หรือการใช้
สารเสพติดที่ก่อความสุขซึ่งในที่สุดจะทำลายสุขภาพของตนเอง
<br /><br />
พฤติกรรมที่กระทำตามแรงกระตุ้น แม้จะไม่ได้สร้างความเสียหาย
อย่างร้ายแรง ก็ลดประสิทธิภาพของบุคคลในหลายด้านที่สำคัญ
การกระทำตามแรงกระตุ้นทำให้ไม่ได้พิจารณาทางเลือกอื่นในการ
กระทำ ซึ่งบางทางเลือกนั้นอาจชาญฉลาดกว่าทางเลือกที่ทำตาม
แรงกระตุ้น ความหุนหันพลันแล่นยังทำให้คนเสียสมาธิระหว่าง
โครงการที่ต้องการลำดับขั้นตอนหรือระยะที่เป็นระบบอีกด้วย
ผลงานของผู้ที่กระทำตามแรงกระตุ้นจึงมักมีน้อย กระจัดกระจาย
และไม่สม่ำเสมอ
<br /><br />
คุณลักษณะสำคัญของสติปัญญา ซึ่งอาจเป็นสิ่งที่แยกมนุษย์ออกจาก
สิ่งมีชีวิตรูปแบบเดิม คือความสามารถในการคิดถึงผลที่จะตามมา
ในอนาคตก่อนที่จะกระทำตามแรงกระตุ้น กิจกรรมที่ใช้สติปัญญา
เกี่ยวข้องกับการไตร่ตรองเป้าหมายระยะยาว การจัดระเบียบและ
วางแผนเส้นทางสู่เป้าหมายเหล่านั้น และการยืนหยัดมุ่งสู่
เป้าหมายแม้เผชิญกับแรงกระตุ้นชั่วคราวที่ขัดขวาง แนวคิดที่ว่า
สติปัญญาเกี่ยวข้องกับการควบคุมแรงกระตุ้นนั้นถูกสื่อออกมา
ได้อย่างดีด้วยคำว่า "ความรอบคอบชาญฉลาด" ซึ่งเป็นอีกชื่อหนึ่ง
ของด้านความมีวินัย ความรอบคอบชาญฉลาดหมายถึงทั้งความฉลาด
และความระมัดระวัง
<br /><br/>
ผู้ที่ได้คะแนนสูงในมาตรวัด
ความมีวินัยได้รับการมองจากผู้อื่นว่าเป็นคนฉลาดจริง ๆ
ประโยชน์ของความมีวินัยสูงนั้นเห็นได้ชัด ผู้ที่มีวินัยหลีกเลี่ยง
ปัญหาและประสบความสำเร็จในระดับสูงผ่านการวางแผนที่มีเป้าหมาย
และความอุตสาหะ พวกเขายังได้รับการมองในเชิงบวกจากผู้อื่นว่า
เป็นคนฉลาดและไว้วางใจได้ ในด้านลบ พวกเขาอาจเป็นคนที่
ยึดติดกับความสมบูรณ์แบบและเป็นคนบ้างาน นอกจากนี้ ผู้ที่มี
วินัยสูงมากอาจถูกมองว่าเป็นคนเคร่งขรึมและน่าเบื่อ
<br /><br />
ผู้ที่ขาดความมีวินัยอาจถูกวิจารณ์เรื่อง
ความไม่น่าเชื่อถือ ขาดความทะเยอทะยาน และไม่ยอมอยู่ในกรอบ
แต่พวกเขาจะได้สัมผัสความสุขชั่วคราวมากมาย และจะไม่มีวัน
ถูกเรียกว่าเป็นคนเคร่งขรึม`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `คะแนนความมีวินัยของคุณอยู่ในระดับต่ำ ซึ่งบ่งชี้ว่าคุณชอบ
ใช้ชีวิตอยู่กับปัจจุบันและทำในสิ่งที่รู้สึกดีในตอนนี้ งานของคุณ
มักไม่รอบคอบและไม่เป็นระเบียบ`
    },
    {
      score: 'neutral', // do not translate this line
      text: `คะแนนความมีวินัยของคุณอยู่ในระดับปานกลาง ซึ่งหมายความว่าคุณ
เป็นคนที่ไว้วางใจได้ เป็นระเบียบ และควบคุมตนเองได้ในระดับที่
เหมาะสม`
    },
    {
      score: 'high', // do not translate this line
      text: `คะแนนความมีวินัยของคุณอยู่ในระดับสูง ซึ่งหมายความว่าคุณ
ตั้งเป้าหมายที่ชัดเจนและไล่ตามเป้าหมายเหล่านั้นด้วยความมุ่งมั่น
ผู้คนมองคุณเป็นคนที่ไว้วางใจได้และขยันหมั่นเพียร`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'ความเชื่อมั่นในความสามารถของตนเอง',
      text: `ความเชื่อมั่นในความสามารถของตนเองหมายถึงความมั่นใจ
ในความสามารถของตนที่จะทำสิ่งต่าง ๆ ให้สำเร็จ ผู้ที่ได้คะแนนสูง
เชื่อว่าตนมีสติปัญญา (สามัญสำนึก) แรงขับเคลื่อน และการควบคุม
ตนเองที่จำเป็นต่อการประสบความสำเร็จ ส่วนผู้ที่ได้คะแนนต่ำ
ไม่รู้สึกว่าตนมีประสิทธิภาพ และอาจรู้สึกว่าตนไม่สามารถ
ควบคุมชีวิตของตนเองได้`
    },
    {
      facet: 2,
      title: 'ความเป็นระเบียบเรียบร้อย',
      text: `ผู้ที่ได้คะแนนสูงด้านความเป็นระเบียบเรียบร้อยเป็นคนที่
จัดระเบียบได้ดี พวกเขาชอบใช้ชีวิตตามกิจวัตรและตารางเวลา
พวกเขาจดรายการและวางแผน ส่วนผู้ที่ได้คะแนนต่ำมักเป็นคน
ไม่เป็นระเบียบและกระจัดกระจาย`
    },
    {
      facet: 3,
      title: 'ความรู้สึกในหน้าที่',
      text: `มาตรวัดนี้สะท้อนถึงความแข็งแกร่งของความรู้สึกในหน้าที่
และภาระผูกพันของบุคคล ผู้ที่ได้คะแนนสูงในมาตรวัดนี้มีความรู้สึก
ในภาระผูกพันทางศีลธรรมอย่างแรงกล้า ส่วนผู้ที่ได้คะแนนต่ำมองว่า
สัญญา กฎ และระเบียบข้อบังคับเป็นการจำกัดอิสรภาพมากเกินไป
พวกเขามักถูกมองว่าไม่น่าเชื่อถือหรือแม้กระทั่งไม่รับผิดชอบ`
    },
    {
      facet: 4,
      title: 'ความมุ่งมั่นสู่ความสำเร็จ',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้
พยายามอย่างหนักเพื่อให้บรรลุความเป็นเลิศ แรงขับเคลื่อนที่จะ
ได้รับการยอมรับว่าประสบความสำเร็จทำให้พวกเขาเดินหน้าสู่
เป้าหมายอันสูงส่ง พวกเขามักมีทิศทางในชีวิตที่ชัดเจน แต่ผู้ที่
ได้คะแนนสูงมากอาจจดจ่ออยู่กับสิ่งเดียวและหมกมุ่นกับงานมาก
เกินไป ส่วนผู้ที่ได้คะแนนต่ำพอใจที่จะทำงานเพียงน้อยที่สุด
และอาจถูกผู้อื่นมองว่าเป็นคนขี้เกียจ`
    },
    {
      facet: 5,
      title: 'วินัยในตนเอง',
      text: `วินัยในตนเอง ซึ่งหลายคนเรียกว่าพลังใจ หมายถึงความ
สามารถในการยืนหยัดทำงานที่ยากหรือไม่พึงประสงค์จนกว่าจะ
สำเร็จ ผู้ที่มีวินัยในตนเองสูงสามารถเอาชนะความลังเลที่จะ
เริ่มทำงานและยืนหยัดในแนวทางของตนแม้มีสิ่งที่ทำให้เสียสมาธิ
ส่วนผู้ที่มีวินัยในตนเองต่ำมักผัดวันประกันพรุ่งและทำงาน
ไม่ต่อเนื่อง มักทำงานไม่สำเร็จ แม้แต่งานที่พวกเขาอยากทำ
ให้สำเร็จเป็นอย่างยิ่ง`
    },
    {
      facet: 6,
      title: 'ความรอบคอบ',
      text: `ความรอบคอบหมายถึงแนวโน้มที่จะไตร่ตรองความเป็นไปได้
ต่าง ๆ ก่อนลงมือทำ ผู้ที่ได้คะแนนสูงในมาตรวัดความรอบคอบ
ใช้เวลาอย่างเต็มที่ในการตัดสินใจ ส่วนผู้ที่ได้คะแนนต่ำมัก
พูดหรือทำสิ่งแรกที่นึกขึ้นได้โดยไม่ได้พิจารณาทางเลือกอื่น
และผลที่อาจเกิดขึ้นจากทางเลือกเหล่านั้น`
    }
  ]
}

export default conscientiousness
