import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: 'ความเปิดเผยต่อโลกภายนอก',
  shortDescription: 'ความเปิดเผยต่อโลกภายนอกมีลักษณะเด่นคือการมีส่วนร่วมกับโลกภายนอกอย่างชัดเจน',
  description: `ผู้ที่มีบุคลิกเปิดเผยสนุกกับการอยู่ร่วมกับผู้คน เต็มไปด้วยพลัง
และมักสัมผัสอารมณ์เชิงบวก พวกเขามักเป็นคนกระตือรือร้น
ชอบลงมือทำ และพร้อมที่จะพูดว่า "ลุยเลย!" หรือ "ไปกันเถอะ!"
เมื่อมีโอกาสที่น่าตื่นเต้น เมื่ออยู่ในกลุ่มพวกเขาชอบพูดคุย
แสดงตัวตน และดึงดูดความสนใจมาที่ตนเอง
<br /><br />
ผู้ที่มีบุคลิกเก็บตัวขาดความกระฉับกระเฉง พลังงาน และระดับ
กิจกรรมของผู้ที่มีบุคลิกเปิดเผย พวกเขามักเป็นคนเงียบ ๆ
ไม่โดดเด่น รอบคอบ และไม่ผูกพันกับโลกทางสังคม การที่พวกเขา
ไม่ค่อยเข้าสังคมไม่ควรถูกตีความว่าเป็นความขี้อายหรือความ
ซึมเศร้า ผู้ที่มีบุคลิกเก็บตัวเพียงต้องการสิ่งเร้าน้อยกว่า
ผู้ที่มีบุคลิกเปิดเผยและชอบอยู่คนเดียว <br /><br />ความเป็นอิสระ
และความสงวนตัวของผู้ที่มีบุคลิกเก็บตัวบางครั้งถูกเข้าใจผิดว่า
เป็นความไม่เป็นมิตรหรือความหยิ่งยโส ในความเป็นจริง ผู้ที่มี
บุคลิกเก็บตัวซึ่งได้คะแนนสูงในด้านความเป็นมิตรจะไม่เข้าหา
ผู้อื่น แต่จะเป็นคนที่น่ารื่นรมย์อยู่พอสมควรเมื่อมีคนเข้ามา
ติดต่อด้วย`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `คะแนนความเปิดเผยต่อโลกภายนอกของคุณอยู่ในระดับต่ำ ซึ่งบ่งชี้ว่าคุณ
เป็นคนเก็บตัว สงวนตัว และเงียบ คุณสนุกกับความสงัดและกิจกรรม
ที่ทำคนเดียว การเข้าสังคมของคุณมักจำกัดอยู่เฉพาะเพื่อนสนิท
ไม่กี่คน`
    },
    {
      score: 'neutral', // do not translate this line
      text: `คะแนนความเปิดเผยต่อโลกภายนอกของคุณอยู่ในระดับปานกลาง ซึ่งบ่งชี้ว่าคุณ
ไม่ได้เป็นคนเก็บตัวเงียบเหงาและไม่ได้เป็นคนช่างพูดร่าเริง
คุณสนุกกับเวลาที่อยู่กับผู้อื่น แต่ก็สนุกกับเวลาที่อยู่คนเดียวเช่นกัน`
    },
    {
      score: 'high', // do not translate this line
      text: `คะแนนความเปิดเผยต่อโลกภายนอกของคุณอยู่ในระดับสูง ซึ่งบ่งชี้ว่าคุณ
เป็นคนชอบเข้าสังคม เปิดเผย มีพลัง และร่าเริง คุณชอบอยู่
ท่ามกลางผู้คนเป็นส่วนใหญ่ของเวลา`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'ความเป็นมิตร',
      text: `ผู้ที่เป็นมิตรชื่นชอบผู้อื่นอย่างแท้จริง
และแสดงความรู้สึกเชิงบวกต่อผู้อื่นอย่างเปิดเผย พวกเขาหาเพื่อน
ได้อย่างรวดเร็วและสร้างความสัมพันธ์ที่ใกล้ชิดสนิทสนมได้ง่าย
ส่วนผู้ที่ได้คะแนนต่ำด้านความเป็นมิตรไม่จำเป็นต้องเป็นคนเย็นชา
และเป็นปฏิปักษ์ แต่พวกเขาไม่เข้าหาผู้อื่นและถูกมองว่าเป็นคน
ห่างเหินและสงวนตัว`
    },
    {
      facet: 2,
      title: 'ความชอบอยู่ร่วมกับผู้คน',
      text: `ผู้ที่ชอบอยู่ร่วมกับผู้คนมองว่าการอยู่กับผู้อื่น
เป็นเรื่องที่น่าตื่นเต้นและคุ้มค่า พวกเขาสนุกกับความคึกคัก
ของฝูงชน ส่วนผู้ที่ได้คะแนนต่ำมักรู้สึกท่วมท้นกับฝูงชนจำนวน
มากและจึงหลีกเลี่ยงอย่างจงใจ พวกเขาไม่จำเป็นต้องเกลียดการอยู่
กับผู้คนในบางครั้ง แต่ความต้องการความเป็นส่วนตัวและเวลาของ
ตนเองมีมากกว่าผู้ที่ได้คะแนนสูงในมาตรวัดนี้อย่างมาก`
    },
    {
      facet: 3,
      title: 'ความกล้าแสดงออก',
      text: `ผู้ที่ได้คะแนนสูงด้านความกล้าแสดงออกชอบพูด
ในสิ่งที่คิด เข้าควบคุม และชี้นำกิจกรรมของผู้อื่น พวกเขามัก
เป็นผู้นำในกลุ่ม ส่วนผู้ที่ได้คะแนนต่ำมักไม่ค่อยพูดและปล่อย
ให้ผู้อื่นควบคุมกิจกรรมของกลุ่ม`
    },
    {
      facet: 4,
      title: 'ระดับกิจกรรม',
      text: `ผู้ที่มีระดับกิจกรรมสูงใช้ชีวิตที่เร่งรีบและ
ยุ่งวุ่นวาย พวกเขาเคลื่อนไหวอย่างรวดเร็ว กระฉับกระเฉง และ
แข็งแรง และพวกเขามีส่วนร่วมในกิจกรรมมากมาย ส่วนผู้ที่ได้
คะแนนต่ำในมาตรวัดนี้ใช้ชีวิตในจังหวะที่ช้ากว่า ผ่อนคลาย
และสบาย ๆ กว่า`
    },
    {
      facet: 5,
      title: 'ความชอบความตื่นเต้น',
      text: `ผู้ที่ได้คะแนนสูงในมาตรวัดนี้เบื่อง่ายหากไม่มีสิ่งเร้า
ในระดับสูง พวกเขาชอบแสงไฟที่สว่างจ้าและบรรยากาศที่คึกคัก
พวกเขามักเสี่ยงและแสวงหาความตื่นเต้น ส่วนผู้ที่ได้คะแนนต่ำ
รู้สึกท่วมท้นกับเสียงและความวุ่นวาย และไม่ชอบการแสวงหา
ความตื่นเต้น`
    },
    {
      facet: 6,
      title: 'ความร่าเริง',
      text: `มาตรวัดนี้วัดอารมณ์และความรู้สึกเชิงบวก ไม่ใช่อารมณ์
เชิงลบ (ซึ่งเป็นส่วนหนึ่งของด้านความไม่มั่นคงทางอารมณ์)
ผู้ที่ได้คะแนนสูงในมาตรวัดนี้มักสัมผัสความรู้สึกเชิงบวก
หลากหลาย ได้แก่ ความสุข ความกระตือรือร้น ความมองโลกในแง่ดี
และความปีติยินดี ส่วนผู้ที่ได้คะแนนต่ำไม่ค่อยมีแนวโน้มที่จะ
มีจิตใจที่เปี่ยมพลังและร่าเริงเช่นนั้น`
    }
  ]
}

export default extraversion
