import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: 'ความไม่มั่นคงทางอารมณ์',
  shortDescription: 'ความไม่มั่นคงทางอารมณ์หมายถึงแนวโน้มที่จะสัมผัสความรู้สึกเชิงลบ',
  description: `ฟรอยด์เป็นผู้แรกที่ใช้คำว่า "ความป่วยทางประสาท" เพื่ออธิบาย
ภาวะที่มีลักษณะเด่นคือความทุกข์ทางจิตใจ ความทุกข์ทางอารมณ์
และความไม่สามารถรับมือกับความต้องการปกติของชีวิตได้อย่าง
มีประสิทธิภาพ ท่านเสนอว่าทุกคนแสดงสัญญาณของความป่วยทาง
ประสาทในระดับหนึ่ง แต่เราแตกต่างกันในระดับความทุกข์และ
อาการเฉพาะของความทุกข์นั้น ปัจจุบัน ความไม่มั่นคงทางอารมณ์
หมายถึงแนวโน้มที่จะสัมผัสความรู้สึกเชิงลบ <br /><br />ผู้ที่ได้คะแนนสูง
ด้านความไม่มั่นคงทางอารมณ์อาจสัมผัสความรู้สึกเชิงลบเฉพาะ
อย่างใดอย่างหนึ่งเป็นหลัก เช่น ความวิตกกังวล ความโกรธ หรือ
ความซึมเศร้า แต่มีแนวโน้มที่จะสัมผัสอารมณ์เหล่านี้หลายอย่าง
<br /><br />ผู้ที่มีความไม่มั่นคงทางอารมณ์สูงจะตอบสนองทางอารมณ์
อย่างไว พวกเขาตอบสนองทางอารมณ์ต่อเหตุการณ์ที่ไม่กระทบ
คนส่วนใหญ่ และปฏิกิริยาของพวกเขามักรุนแรงกว่าปกติ พวกเขา
มีแนวโน้มที่จะตีความสถานการณ์ธรรมดาว่าเป็นการคุกคาม และ
มองความหงุดหงิดเล็กน้อยว่าเป็นปัญหาที่ยากเกินแก้ไข <br /><br />ปฏิกิริยา
ทางอารมณ์เชิงลบของพวกเขามักคงอยู่เป็นเวลานานผิดปกติ ซึ่ง
หมายความว่าพวกเขามักอยู่ในอารมณ์ไม่ดีบ่อยครั้ง ปัญหาในการ
ควบคุมอารมณ์เหล่านี้อาจลดความสามารถของผู้ที่มีความไม่มั่นคง
ทางอารมณ์ในการคิดอย่างชัดเจน การตัดสินใจ และการรับมือกับ
ความเครียดอย่างมีประสิทธิภาพ`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `คะแนนความไม่มั่นคงทางอารมณ์ของคุณอยู่ในระดับต่ำ ซึ่งบ่งชี้ว่าคุณ
เป็นคนที่ใจเย็น ตั้งสติได้ และไม่หวั่นไหวง่ายอย่างยิ่ง คุณไม่
ตอบสนองด้วยอารมณ์ที่รุนแรง แม้กระทั่งในสถานการณ์ที่คนส่วนใหญ่
จะเรียกว่าตึงเครียด`
    },
    {
      score: 'neutral', // do not translate this line
      text: `คะแนนความไม่มั่นคงทางอารมณ์ของคุณอยู่ในระดับปานกลาง ซึ่งบ่งชี้ว่าระดับ
การตอบสนองทางอารมณ์ของคุณเป็นแบบทั่วไปของประชากรโดยรวม
สถานการณ์ที่ตึงเครียดและน่าหงุดหงิดทำให้คุณรู้สึกไม่สบายใจ
ในระดับหนึ่ง แต่โดยทั่วไปคุณสามารถลืมความรู้สึกเหล่านี้และ
รับมือกับสถานการณ์เหล่านั้นได้`
    },
    {
      score: 'high', // do not translate this line
      text: `คะแนนความไม่มั่นคงทางอารมณ์ของคุณอยู่ในระดับสูง ซึ่งบ่งชี้ว่าคุณ
ไม่สบายใจได้ง่าย แม้กระทั่งจากสิ่งที่คนส่วนใหญ่มองว่าเป็น
ความต้องการปกติของการใช้ชีวิต ผู้คนมองคุณเป็นคนที่อ่อนไหว
และอารมณ์อ่อน`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'ความวิตกกังวล',
      text: `ระบบ "สู้หรือหนี" ในสมองของผู้ที่วิตกกังวลถูกกระตุ้น
ให้ทำงานง่ายเกินไปและบ่อยเกินไป ด้วยเหตุนี้ ผู้ที่มีความวิตก
กังวลสูงจึงมักรู้สึกว่ามีอันตรายบางอย่างกำลังจะเกิดขึ้น
พวกเขาอาจกลัวสถานการณ์เฉพาะบางอย่างหรือกลัวโดยทั่วไป
พวกเขารู้สึกตึงเครียด กระวนกระวาย และประหม่า ส่วนผู้ที่มี
ความวิตกกังวลต่ำมักเป็นคนใจเย็นและไม่หวาดกลัว`
    },
    {
      facet: 2,
      title: 'ความโกรธ',
      text: `ผู้ที่ได้คะแนนสูงด้านความโกรธรู้สึกโกรธเกรี้ยวเมื่อ
สิ่งต่าง ๆ ไม่เป็นไปตามที่ตนต้องการ พวกเขาอ่อนไหวต่อการได้รับ
การปฏิบัติอย่างยุติธรรม และรู้สึกขุ่นเคืองเมื่อรู้สึกว่าตนถูก
เอาเปรียบ มาตรวัดนี้วัดแนวโน้มที่จะรู้สึกโกรธ ส่วนบุคคลจะ
แสดงความรำคาญและความเป็นปฏิปักษ์ออกมาหรือไม่นั้นขึ้นอยู่กับ
ระดับความเป็นมิตรของบุคคลนั้น ผู้ที่ได้คะแนนต่ำไม่ค่อยโกรธ
หรือโกรธได้ง่าย`
    },
    {
      facet: 3,
      title: 'ความซึมเศร้า',
      text: `มาตรวัดนี้วัดแนวโน้มที่จะรู้สึกเศร้า ท้อแท้ และหมด
กำลังใจ ผู้ที่ได้คะแนนสูงขาดพลังและเริ่มทำกิจกรรมได้ยาก
ส่วนผู้ที่ได้คะแนนต่ำมักไม่มีความรู้สึกซึมเศร้าเหล่านี้`
    },
    {
      facet: 4,
      title: 'ความเกร็งในสายตาผู้อื่น',
      text: `ผู้ที่เกร็งในสายตาผู้อื่นจะอ่อนไหวต่อสิ่งที่ผู้อื่น
คิดเกี่ยวกับตน ความกังวลเรื่องการถูกปฏิเสธและการถูกเยาะเย้ย
ทำให้พวกเขารู้สึกขี้อายและไม่สบายใจเมื่ออยู่ร่วมกับผู้อื่น
พวกเขาอับอายได้ง่ายและมักรู้สึกละอายใจ ความกลัวว่าผู้อื่นจะ
วิจารณ์หรือล้อเลียนพวกเขานั้นถูกขยายใหญ่เกินจริงและไม่สมจริง
แต่ความเก้ ๆ กัง ๆ และความไม่สบายใจของพวกเขาอาจทำให้ความ
กลัวเหล่านี้กลายเป็นจริงได้ ในทางตรงกันข้าม ผู้ที่ได้คะแนนต่ำ
ไม่ทุกข์ทรมานจากความเข้าใจผิดที่ว่าทุกคนกำลังจับตามองและ
ตัดสินพวกเขา พวกเขาไม่รู้สึกประหม่าในสถานการณ์ทางสังคม`
    },
    {
      facet: 5,
      title: 'ความขาดการยับยั้งชั่งใจ',
      text: `ผู้ที่ขาดการยับยั้งชั่งใจจะรู้สึกอยากและมีแรงกระตุ้น
ที่แรงกล้าซึ่งต้านทานได้ยาก พวกเขามักมุ่งไปที่ความสุขและ
ผลตอบแทนระยะสั้นมากกว่าผลในระยะยาว ส่วนผู้ที่ได้คะแนนต่ำ
ไม่สัมผัสความอยากที่แรงกล้าจนต้านไม่ได้ และผลที่ตามมาคือ
พวกเขาไม่พบว่าตนถูกล่อลวงให้ดื่มด่ำมากเกินไป`
    },
    {
      facet: 6,
      title: 'ความเปราะบาง',
      text: `ผู้ที่ได้คะแนนสูงด้านความเปราะบางจะสัมผัสความตื่นตระหนก
ความสับสน และความไร้ความช่วยเหลือเมื่ออยู่ภายใต้แรงกดดัน
หรือความเครียด ส่วนผู้ที่ได้คะแนนต่ำรู้สึกมั่นคง มั่นใจ และ
คิดได้ชัดเจนมากกว่าเมื่อเครียด`
    }
  ]
}

export default neuroticism
