export default {
  language: 'Russian',
  seo: {
    keywords: 'тест Большой пятерки, тест B5, тест BigFive, личностные качества, сравнить, бесплатно, Джордан Пертерсон'
  },
  frontpage: {
    seo: {
      title: 'Бесплатный тест личности BigFive с открытым исходным кодом',
      description: 'Пройдите бесплатный личностный тест с открытым исходным кодом. Узнайте свои личностные качества и сравните себя со своим партнером, коллегами, друзьями или семьей.'
    },
    title: 'Тест личности BigFive',
    call_to_action: 'Примите участие сейчас',
    no_registration: '* Без регистрации',
    tests_taken: 'Более 700 000 человек на данный момент приняло участие',
    compare: {
      title: 'Сравните себя с другими.',
      text1: 'Сравните себя со своим партнером, коллегами, друзьями или семьей.',
      text2: 'Узнайте, чем вы отличаетесь от других по пяти аспектам:',
      action: 'Убедитесь сами'
    },
    share: 'Поделитесь своими результатами с друзьями и узнайте, насколько вы совместимы.',
    cards: {
      open: {
        title: 'Открытый',
        text: 'Этот тест является проектом с открытым исходным кодом и лицензией MIT.'
      },
      free: {
        title: 'Бесплатный',
        text: 'Этот тест - бесплатный'
      },
      scientific: {
        title: 'Научный',
        text: 'Большая пятерка - это научно обоснованная и надежная модель для измерения личности.'
      },
      translated: {
        title: 'Перевод',
        text: 'Переведен более чем на 20 языков. Помоги нам <a href="https://b5.translations.alheimsins.net/" rel="noreferrer" target="blank">тут</a>!'
      }
    },
    description: {
      top: 'Узнайте себя лучше с помощью этого бесплатного личностного теста.',
      subtop: 'Это',
      subtop2: 'наиболее научно обоснованная и надежная психологическая модель для измерения личности.',
      reference: `Тесты и анализы для этой страницы взяты из
<a href="http://ipip.ori.org" rel="noopener" target="_blank">ipip.ori.org</a>,
inventory is from <i>Johnson's (2014) 120-item IPIP NEO-PI-R</i>.`,
      info: 'Следующий тест состоит из 120 вопросов и займет примерно 10 минут вашего времени.',
      result: 'После прохождения теста вы получите подробное описание вашей личности по следущим аспектам:',
      tests_taken: 'Выполненные тесты'
    }
  },
  about: {
    seo: {
      title: 'Про нас',
      description: 'BigFive возглавляет очень активная и преданная своему делу команда, которая постоянно стремится развивать проект.'
    }
  },
  toolbar: {
    home: 'Домашняя страница',
    result: 'Результаты',
    compare: 'Сравнить',
    articles: 'Статья',
    privacy: 'Защита персональных данных',
    about: 'О нас',
    see_results: 'Посмотрите свои результаты',
    compare_with: 'Сравнить с другими'
  },
  facets: {
    openness_to_experience: {
      title: 'Открытось опыту'
    },
    conscientiousness: {
      title: 'Добросовестность'
    },
    extraversion: {
      title: 'Экстраверсия'
    },
    agreeableness: {
      title: 'Уживчивость'
    },
    neuroticism: {
      title: 'Невротизм'
    }
  },
  common: {
    and: 'и',
    pages: 'содержание',
    languages: 'языки'
  },
  form: {
    information: 'Информация',
    informationText: 'Мы используем предоставленную вами информацию, чтобы предоставить вам',
    mostAccurate: 'максимально точный результат.',
    readMoreAbout: 'Узнайте больше',
    privacy: 'Защита персональных данных',
    nextButton: 'Ок, следующий вопрос',
    declineButton: 'Продолжить, не делясь',
    prefferedLanguage: 'Мой предпочтительный язык',
    selectLanguage: 'Выбрать язык',
    iama: 'Я',
    male: 'Мужчина',
    female: 'Женщина',
    age: 'Возраст',
    iam: 'Я',
    yearsOld: 'лет',
    ageWarning: 'Вам должно быть не менее 16 лет',
    language: 'Язык',
    gender: 'Пол',
    confirmInfo: 'Подтвердить информацию',
    confirm: 'Подтвердить',
    toTestButton: 'Хорошо, давайте перейдем к тесту'
  },
  test: {
    next: 'Далее',
    back: 'Назад',
    more: 'Больше',
    seeResults: 'Увидеть результаты'
  },
  big_five: {
    title: 'Что такое Большая пятерка?',
    seo: {
      title: 'Что такое Большая пятерка?',
      description: 'Узнайте больше про Большую пятерку'
    }
  },
  openness_to_experience: {
    title: 'Открытость опыту',
    seo: {
      title: 'Обзор аспекта Открытость опыту.',
      description: 'Узнайте больше про аспект Открытость опыту в модели Большой пятерки'
    }
  },
  conscientiousness: {
    title: 'Добросовестность',
    seo: {
      title: 'Обзор аспекта Добросовестность',
      description: 'Узнайте больше про аспект Добросовестность в модели Большой пятерки'
    }
  },
  extraversion: {
    title: 'Экстраверсия',
    seo: {
      title: 'Обзор аспекта Экстраверсия',
      description: 'Узнайте больше про аспект Экстраверсия в модели Большой пятерки'
    }
  },
  agreeableness: {
    title: 'Уживчивость',
    seo: {
      title: 'Обзор аспекта Уживчивость',
      description: 'Узнайте больше про аспект Уживчивость в модели Большой пятерки'
    }
  },
  neuroticism: {
    title: 'Невротизм',
    seo: {
      title: 'Обзор аспекта Невротизм',
      description: 'Узнайте больше про аспект Невротизм в модели Большой пятерки'
    }
  },
  getCompare: {
    title: 'Сравните людей или команды',
    description1: 'Сравните результаты вашего теста личности BigFive с результатами других участников.',
    description2: 'Введите ID результатов вашего теста, например',
    description3: 'в поле ввода ID',
    needToAddPeople: 'Вам необходимо добавить людей, чтобы сравнить их',
    addAnother: 'Добавить еще одного человека',
    addPerson: 'Добавить человека',
    comparePeople: 'Сравнить людей',
    nameOfPerson: 'Имя человека',
    urlOrId: 'URL-ссылка или ID для сравнения',
    name: 'Имя'
  },
  results: {
    theBigFive: 'Большая пятерка',
    score: 'Баллы',
    important: 'Важно!',
    saveResults: 'Сохраните этот ID, чтобы позднее получить результаты или чтобы',
    compare: 'сравнить',
    toOthers: 'себя с другими',
    seo: {
      title: 'Мои результаты личностного теста BigFive',
      description: 'Узнайте о своей личности и сравните себя по следующим пяти аспектам: Невротизм, Открытость опыту, Добросовестность, Экстраверсия, Уживчивость'
    }
  },
  getResult: {
    result: 'Результаты',
    explaination: 'Если вы прошли тест и сохранили свой ID, вы можете увидеть результаты, введя свой ID, например',
    idInput: 'в поле ввода ID',
    urlOrId: 'URL-ссылка или ID для сравнения',
    getResult: 'К результату'
  },
  shareLinks: {
    copyLink: 'Скопировать ссылку в буфер обмена',
    shareFacebook: 'Поделиться на Facebook',
    shareTwitter: 'Поделиться в Twitter',
    copiedLink: 'Скопировать ссылку',
    shareResults: 'Поделитесь своим результатом!'
  },
  opennessToExperience: {
    quote: 'Открытость опыту описывает аспект когнитивного стиля, который отличает творческих людей с богатым воображением от приземленных людей.',
    text1: `
      <p>
        Открытость опыту описывает аспект когнитивного стиля, который отличает творческих людей с богатым воображением от приземленных людей.
      </p>
      <p>
        Открытые люди являются <b>любознательными, ценящими искусство и чуткими к красоте</b>.
        Они, как правило, по сравнению с закрытыми людьми, более <b>осведомлены о своих чувствах</b>.
        Они склонны мыслить и действовать как индивидуалисты и нонконформисты.
      </p>
      <p>
        Интеллектуалы, как правило, зарабатывают высокий балл на аспекте Открытость опыту; следовательно, этот аспект также называют Культурой или Интеллектом.
      </p>
    `,
    text2: `
      <p>
        Тем не менее, интеллект, вероятно, лучше всего рассматривать как один из аспектов Открытости опыту.
        Показатели Открытости опыту лишь незначительно связаны с количеством лет обучения и результатами стандартных интеллектуальных тестов.
      </p>
      <p>
        Еще одна характеристика открытого когнитивного стиля - это способность мыслить символами и абстракциями, далекими от конкретного опыта.
      </p>
      <p>
        В зависимости от конкретных интеллектуальных способностей человека это символическое познание может принимать форму математического, логического или геометрического мышления, художественного и метафорического использования языка, музыкальной композиции, перфоманса или же одного из многих изобразительных или исполнительских видов искусства.
      </p>
      <div class="title">
        Низкие баллы
      </div>
      <p>
        Люди с <b>низкими баллами</b> аспекта Открытось опыту склонны иметь <b>узкие,общие интересы</b>.
      </p>
      <p>
        Они предпочитают <b>простоту, понятность</b> и очевидность сложному, неоднозначному и изящному.
      </p>
      <p>
        Они могут с подозрением относиться к искусствам и наукам, считая эти усилия непонятными или бесполезными на практике.
      </p>
      <p>
        Закрытые люди предпочитают привичное новизне, они консервативны и сопротивляются изменениям.
      </p>
      <p>
        Открытость часто преподносится психологами, которые, в свою очередь сами часто открыты для переживаний, как более здоровая или более зрелая. Однако открытый и закрытый стили мышления полезны в разных средах.
      </p>
      <p>
      Интеллектуальный стиль открытого человека может хорошо служить профессору, но исследования показали, что закрытое мышление связано с превосходной производительностью в работе полиции, продажах и ряде служебных профессий.
      </p>

      <div class="title">
        Воображение
      </div>
      <p>
        Для творческих личностей реальный мир часто слишком прост и обыденен.
      </p>
      <p>
        <b>Высокие баллы</b> здесь обозначают, что человек использует фантазию как способ создания более богатого, более интересного мира.
      </p>
      <p>
      <b>Низкие баллы</b> сигналируют о том,что человек больше ориентирован на факты,чем на фантазии.
      </p>

      <div class="title">
        Интерес к искусству
      </div>
      <p>
      <b>Высокие баллы</b> по данной шкале обозначают любовь к красоте и в природе, и в искусстве. Они легко вовлекаются и поглощаются художественными и природными событиями.
      </p>
      <p>
        Они не обязательно имеют художественное образование или талант, хотя для многих это и будет правдой. Определяющими чертами этой шкалы являются интерес и понимание естественной и искусственной красоты.
      </p>
      <p>
        <b>Низкие баллы</b> говорят об отсутствии эстетической чувствительности и интереса к искусству.
      </p>

      <div class="title">
        Эмоциональность
      </div>
      <p>
        Люди с высоким уровнем эмоциональности имеют хороший доступ к своим чувствам и осознают их.
      </p>
      <p>
        Низкие баллы говорят о том,что человек менее осведомлен о своих чувствах и склонен не выражать свои эмоции открыто.
      </p>

      <div class="title">
        Предприимчивость
      </div>
      <p>
        Высокие баллы говорят о том, что человек стремится попробовать что-то новое, поехать за границу и испытать разные вещи.
      </p>
      <p>
        Им скучно все знакомое и рутина, и они выберут новый маршрут домой только потому, что он другой.
      </p>
      <p>
        Люди с низкими баллами склонны чувствовать себя некомфортно при переменах и предпочитают привычный распорядок дня.
      </p>

      <div class="title">
        Интеллект
      </div>
      <p>
        Интеллект и художественные интересы - два наиболее важных и центральных аспекта открытости опыту. Люди с высокими баллами по данной шкале любят играть с идеями.
      </p>
      <p>
        Они открыты для новых и необычных идей и любят обсуждать интеллектуальные вопросы. Им нравятся загадки и головоломки. Люди с низким уровнем интеллекта предпочитают иметь дело либо с людьми, либо с вещами, а не с идеями.
      </p>
      <p>
        Они считают интеллектуальные упражнения пустой тратой времени.
      </p>
      <p>
        Интеллект не следует отождествлять с умом. Интеллект - это интеллектуальный стиль, а не интеллектуальные способности, хотя люди с высокими баллами по шкале Интеллект набирают немного больше баллов, чем люди с низкими, в стандартизированных тестах на интеллект.</p>

      <div class="title">
        Либерализм
      </div>
      <p>
        Психологический либерализм означает готовность бросить вызов авторитету, конвенции и традиционным ценностям.
      </p>
      <p>
        В своей самой крайней форме психологический либерализм может даже олицетворять откровенную враждебность к правилам, симпатию к нарушителям закона и любовь к двусмысленности, хаосу и беспорядку.
      </p>
      <p>
        Психологические консерваторы предпочитают безопасность и стабильность, привнесенные соответствием традициям. Психологический либерализм и консерватизм не тождественны политической принадлежности, но, безусловно, склоняют людей к определенным политическим партиям.
      </p>
    `
  }
}
