export default {
  language: 'Ukrainian',
  seo: {
    keywords: 'особистісний тест Великої п\'ятірки, тест B5, тест BigFive, особистісні якості, порівняти, безкоштовно, Джордан Петерсон'
  },
  frontpage: {
    seo: {
      title: 'Безкоштовний тест особистості від BigFive з відкритим кодом',
      description: 'Пройдіть безкоштовний тест особистості з відкритим кодом. Дізнайтесь про свої особові якості та порівняйте себе зі своїм партнером, колегами, друзями чи сім\'єю.'
    },
    title: 'Тест особистості від BigFive',
    call_to_action: 'Прийміть участь зараз',
    no_registration: '* Без реєстрації',
    tests_taken: 'Більш ніж 700 000 людей на даний момент пройшли тест',
    compare: {
      title: 'Порівняйте себе з іншими.',
      text1: 'Порівняйте себе зі своїм партнером, колегами, друзями чи сім\'єю.',
      text2: 'Дізнайтесь, чим ви відрізняєтесь від інших по п\'яти аспектам:',
      action: 'Переконайтесь самі'
    },
    share: 'Поділитесь своїми результатами з друзями та дізнайтесь, наскільки ви сумісні.',
    cards: {
      open: {
        title: 'Відкритий',
        text: 'Цей тест є проектом з відкритим кодом та ліцензією MIT.'
      },
      free: {
        title: 'Безкоштовний',
        text: 'Цей тест - безкоштовний'
      },
      scientific: {
        title: 'Науковий',
        text: 'Велика п\'ятірка - це научно обґрунтована та надійна модель для визначення особистісних якостей.'
      },
      translated: {
        title: 'Перекладений',
        text: 'Перекладений більш ніж на 20 мов. Допоможи нам <a href="https://b5.translations.alheimsins.net/" rel="noreferrer" target="blank"> тут </a>!'
      }
    },
    description: {
      top: 'Дізнайтеся себе краще за допомогою цього безкоштовного тесту особистості.',
      subtop: 'Це',
      subtop2: 'найбільш науково обґрунтована і надійна психологічна модель для визначення особистості.',
      reference: `Тести і аналізи для цієї сторінки взяті з
<a href="http://ipip.ori.org" rel="noopener" target="_blank"> ipip.ori.org </a>,
inventory is from <i> Johnson's (2014) 120-item IPIP NEO-PI-R </ i> .`,
      info: 'Наступний тест складається з 120 питань і займе приблизно 10 хвилин вашого часу.',
      result: 'Після проходження тесту ви отримаєте детальний опис вашої особистості по наступним аспектам:',
      tests_taken: 'Виконані тести'
    }
  },
  about: {
    seo: {
      title: 'Про нас',
      description: 'BigFive очолює дуже активна і віддана своїй справі команда, яка постійно прагне розвивати проект.'
    }
  },
  toolbar: {
    home: 'Домашня сторінка',
    result: 'Результати',
    compare: 'Порівняти',
    articles: 'Статті',
    privacy: 'Захист персональних даних',
    about: 'Про нас',
    see_results: 'Ваші результати',
    compare_with: 'Порівняти з іншими'
  },
  facets: {
    openness_to_experience: {
      title: 'Відкритий досвід'
    },
    conscientiousness: {
      title: 'Сумлінність'
    },
    extraversion: {
      title: 'Екстраверсія'
    },
    agreeableness: {
      title: 'Лад з оточуючими'
    },
    neuroticism: {
      title: 'Невротизм'
    }
  },
  common: {
    and: 'і',
    pages: 'зміст',
    languages: 'мови'
  },
  form: {
    information: 'Інформація',
    informationText: 'Ми використовуємо надану вами інформацію, щоб надати вам',
    mostAccurate: 'максимально точний результат.',
    readMoreAbout: 'Дізнайтеся більше',
    privacy: 'Захист персональних даних',
    nextButton: 'Ок, наступне питання',
    declineButton: 'Продовжити не поділившись',
    prefferedLanguage: 'Моя бажана мова',
    selectLanguage: 'Вибір мови',
    iama: 'Я',
    male: 'Чоловік',
    female: 'Жінка',
    age: 'Вік',
    iam: 'Мені',
    yearsOld: 'років',
    ageWarning: 'Вам повинно бути не менше 16 років',
    language: 'Мова',
    gender: 'Стать',
    confirmInfo: 'Підтвердити інформацію',
    confirm: 'Підтвердити',
    toTestButton: 'Добре, перейдемо до тесту'
  },
  test: {
    next: 'Далі',
    back: 'Назад',
    more: 'Більше',
    seeResults: 'Побачити результати'
  },
  big_five: {
    title: 'Що таке Велика п\'ятірка?',
    seo: {
      title: 'Що таке Велика п\'ятірка?',
      description: 'Дізнайтеся більше про Велику п\'ятірку'
    }
  },
  openness_to_experience: {
    title: 'Відкритість досвіду',
    seo: {
      title: 'Огляд аспекту Відкритість досвіду.',
      description: 'Дізнайтеся більше про аспект Відкритості досвіду в моделі Великої п\'ятірки'
    }
  },
  conscientiousness: {
    title: 'Сумлінність',
    seo: {
      title: 'Огляд аспекту Сумлінність',
      description: 'Дізнайтеся більше про аспект Сумлінності в моделі Великої п\'ятірки'
    }
  },
  extraversion: {
    title: 'Екстраверсія',
    seo: {
      title: 'Огляд аспекту Екстраверсія',
      description: 'Дізнайтеся більше про аспект Екстраверсії в моделі Великої п\'ятірки'
    }
  },
  agreeableness: {
    title: 'Лад з оточуючими',
    seo: {
      title: 'Огляд аспекту Лад з оточуючими',
      description: 'Дізнайтеся більше про аспект Лад з оточуючими в моделі Великої п\'ятірки'
    }
  },
  neuroticism: {
    title: 'Невротизм',
    seo: {
      title: 'Огляд аспекту Невротизм',
      description: 'Дізнайтеся більше про аспект Невротизму в моделі Великої п\'ятірки'
    }
  },
  getCompare: {
    title: 'Порівняйте людей або команди',
    description1: 'Порівняйте результати вашого тесту особистості BigFive з результатами інших учасників.',
    description2: 'Введіть ID результатів вашого тесту, наприклад',
    description3: 'в поле введення ID',
    needToAddPeople: 'Вам необхідно додати людей, щоб порівняти їх',
    addAnother: 'Додати ще одну людину',
    addPerson: 'Додати людину',
    comparePeople: 'Порівняти результати людей',
    nameOfPerson: 'Ім\'я людини',
    urlOrId: 'URL-посилання або ID для порівняння',
    name: 'Ім\'я'
  },
  results: {
    theBigFive: 'Велика п\'ятірка',
    score: 'Бали',
    important: 'Важливо!',
    saveResults: 'Збережіть цей ID, щоб пізніше отримати результати або щоб',
    compare: 'порівняти',
    toOthers: 'свої результати з іншими',
    seo: {
      title: 'Мої результати особистісного тесту BigFive',
      description: 'Дізнайтеся про свою особистість і порівняйте себе з наступних п\'яти аспектів: Невротизм, Відкритість досвіду, Сумлінність, Екстраверсія, Лад з оточуючими'
    }
  },
  getResult: {
    result: 'Результати',
    explaination: 'Якщо ви пройшли тест і зберегли свій ID, ви можете побачити результати, ввівши свій ID, наприклад',
    idInput: 'в поле введення ID',
    urlOrId: 'URL-посилання або ID для порівняння',
    getResult: 'До результату'
  },
  shareLinks: {
    copyLink: 'Копіювати посилання в буфер обміну',
    shareFacebook: 'Поділитися на Facebook',
    shareTwitter: 'Поділитися в Twitter',
    copiedLink: 'Копіювати посилання',
    shareResults: 'Поділіться своїм результатом!'
  },
  opennessToExperience: {
    quote: 'Відкритість досвіду описує аспект когнітивного стилю, який відрізняє творчих людей з багатою уявою від більш раціональних, приземлених людей.',
    text1: `
      <p>
        Відкритість досвіду описує аспект когнітивного стилю, який відрізняє творчих людей з багатою уявою від більш раціональних, приземлених людей.
      </p>
      <p>
        Відкриті люди є <b> допитливими, що цінують мистецтво і є чуйними до краси </b>.
        В порівнянні з закритими людьми, вони, як правило, більш <b> обізнані в своїх почуттях </b>.
        Вони схильні мислити і діяти як індивідуалісти і нонконформісти.
      </p>
      <p>
        Інтелектуали, як правило, заробляють високий бал на аспекті Відкритість досвіду; отже, цей аспект також називають Культурою або Інтелектом.
      </p>
    `,
    text2: `
      <p>
        Проте, інтелект, ймовірно, краще за все розглядати як один з аспектів відкритості до нового досвіду.
        Показники відкритості досвіду лише незначно пов'язані з кількістю років навчання і результатами стандартних інтелектуальних тестів.
      </p>
      <p>
        Ще одна характеристика відкритого когнітивного стилю - це здатність мислити символами і абстракціями, відокремлено від конкретного досвіду.
      </p>
      <p>
        Залежно від конкретних інтелектуальних здібностей людини, це символічне пізнання може приймати форму математичного, логічного або геометричного мислення, художнього та метафоричного використання мови, музичної композиції, перфомансу або ж одного з багатьох образотворчих або виконавських видів мистецтва.
      </p>
      <div class = "title">
        Низькі бали
      </div>
      <p>
        Люди з <b> низькими балами </b> аспекту відкритості досвіду схильні мати <b> вузькі, загальні інтереси </b>.
      </p>
      <p>
        Вони віддають перевагу <b>простому, зрозумілому </b> і очевидному, в супереч складному, неоднозначному і витонченому.
      </p>
      <p>
        Вони можуть з підозрою ставитися до мистецтв і наук, вважаючи ці зусилля незрозумілими або непрактичними.
      </p>
      <p>
        Закриті люди віддають перевагу звичному, перед новим, вони консервативні і менш відкриті до змін.
      </p>
      <p>
        Відкритість часто тлумачене психологами як більш зріла та здорова форма особистості, так як такі люди часто відкриті до нового досвіду. Однак як відкритий, так і закритий види особистості можусть мати перевагу в різних середовищах.
      </p>
      <p>
        Інтелектуальний стиль відкритої людини може більше підходити професору, але дослідження показали, що саме закрите мислення пов'язане з кращою продуктивністю в роботі поліції, сферах продажу і ряду службових професій.
      </p>

      <div class = "title">
        Уява
      </div>
      <p>
        Для творчих особистостей реальний світ часто занадто простий і буденний.
      </p>
      <p>
        <B> Високі бали </b> тут позначають, що людина використовує фантазію як спосіб створення багатшого, більш цікавого світу.
      </p>
      <p>
      <B> Низькі бали </b> сигналізують про те, що така людина більше опирається на фактичне, ніж на фантастичне.
      </p>

      <div class = "title">
        Інтерес до мистецтва
      </div>
      <p>
      <B> Високі бали </b> за даною шкалою означають любов до краси, природи, і мистецтва. Вони легко використовуються і проявляються в творчих та природніх продуктах діяльності.
      </p>
      <p>
        Такі люди не обов'язково мають художню освіту або талант, хоча в більшості випадків це може бути саме так. Визначальними рисами цієї якості є інтерес і розуміння природної та штучної краси.
      </p>
      <p>
        <B> Низькі бали </b> говорять про відсутність естетичної чутливості та інтересу до мистецтва.
      </p>

      <div class = "title">
        Емоційність
      </div>
      <p>
        Люди з високим рівнем емоційності мають високий ріень відчуття та усвідомлення своїх почуттів.
      </p>
      <p>
        Низькі бали свідчать про те, що людина менш обізнана в своїх почуттях і має схильність не висловлювати їх відкрито.
      </p>

      <div class = "title">
        Підприємливість
      </div>
      <p>
        Високі бали свідчать про те, що людина прагне спробувати щось нове, поїхати за кордон або спробувати щось нове.
      </p>
      <p>
        Їм нудно, коли довкола все знайоме і рутинне, вони підуть додому новим маршрутом лише аби відчути щось нове.
      </p>
      <p>
        Люди з низькими балами схильні відчувати себе некомфортно при змінах і вважають за краще звичний розпорядок дня.
      </p>

      <div class = "title">
        Інтелект
      </div>
      <p>
        Інтелект і художні інтереси - два найбільш важливих і центральних аспектів відкритості до нового досвіду. Люди з високими балами за даною шкалою люблять грати з ідеями.
      </p>
      <p>
        Вони відкриті до нових і незвичайних ідей і люблять обговорювати інтелектуальні питання. Їм подобаються нетривіальні задачі та головоломки. Люди з низьким рівнем інтелекту воліють мати справу або з людьми, або з речами, замість ідей.
      </p>
      <p>
        Вони вважають інтелектуальні вправи марною тратою часу.
      </p>
      <p>
        Інтелект не слід ототожнювати з інтелектуальністю (розумом). Інтелект - це інтелектуальний стиль, а не інтелектуальні здібності, хоча в стандартизованих тестах на інтелект люди з високими балами за шкалою інтелект набирають трохи більше балів. </p>
      </p>

      <div class = "title">
        Лібералізм
      </div>
      <p>
        Психологічний лібералізм означає готовність кинути виклик авторитету, конвенції і традиційним цінностям.
      </p>
      <p>
        У своїй найбільш крайній формі психологічний лібералізм може навіть уособлювати відверту ворожість до правил, симпатію до порушників закону і любов до двозначності, хаосу і безладу.
      </p>
      <p>
        Психологічні консерватори вважають за краще безпеку і стабільність, як результат відданості традиціям. Психологічний лібералізм і консерватизм не тотожні політичнії приналежності, але, безумовно, схиляють людей до певних політичних партій.
      </p>
    `
  }
}
