import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'कर्तव्यपरायणता',
  shortDescription: 'कर्तव्यपरायणता उस तरीके से संबंधित है जिससे हम अपनी आवेगों को नियंत्रित, विनियमित और निर्देशित करते हैं।',
  description: `आवेग स्वयं में बुरे नहीं होते;
कभी-कभी समय की बाधाएं त्वरित निर्णय मांगती हैं, और अपने पहले
आवेग पर कार्य करना एक प्रभावी प्रतिक्रिया हो सकती है। साथ ही, काम
के बजाय खेल के समय में, सहज और आवेगपूर्ण व्यवहार मज़ेदार हो सकता
है। आवेगपूर्ण व्यक्ति दूसरों की नज़र में रंगीन, साथ रहने में मज़ेदार
और सनकी लग सकते हैं।
<br /><br />
फिर भी, आवेग में कार्य करना कई तरीकों से मुसीबत में डाल सकता है।
कुछ आवेग असामाजिक होते हैं। अनियंत्रित असामाजिक कार्य न केवल
समाज के अन्य सदस्यों को नुकसान पहुंचाते हैं, बल्कि ऐसे आवेगपूर्ण
कार्यों करने वाले व्यक्ति के प्रति प्रतिशोध का कारण भी बन सकते हैं।
आवेगपूर्ण कार्यों की एक और समस्या यह है कि वे अक्सर तत्काल
इनाम तो देते हैं, परंतु अवांछनीय, दीर्घकालिक परिणाम लाते हैं।
उदाहरणों में शामिल हैं: अत्यधिक सामाजिकता जिससे नौकरी से निकाला
जाना, कोई अपमानजनक बात कह देना जिससे कोई महत्वपूर्ण रिश्ता
टूट जाए, या आनंद देने वाले नशीले पदार्थों का सेवन जो अंततः
स्वास्थ्य नष्ट कर दे।
<br /><br />
आवेगपूर्ण व्यवहार, भले ही गंभीर रूप से विनाशकारी न हो, व्यक्ति
की प्रभावशीलता को महत्वपूर्ण तरीकों से कम कर देता है। आवेग में
कार्य करने से वैकल्पिक उपायों पर विचार करने का अवसर नहीं मिलता,
जिनमें से कुछ आवेगपूर्ण चुनाव से अधिक बुद्धिमानीपूर्ण हो सकते थे।
आवेगपूर्णता उन परियोजनाओं के दौरान भी लोगों को भटका देती है
जिनमें संगठित चरणों या स्तरों के क्रम की आवश्यकता होती है। इसलिए
एक आवेगपूर्ण व्यक्ति की उपलब्धियां छोटी, बिखरी हुई और असंगत
होती हैं।
<br /><br />
बुद्धिमत्ता की एक पहचान, जो संभवतः मनुष्य को पूर्ववर्ती जीवन-रूपों से
अलग करती है, आवेग पर कार्य करने से पहले भविष्य के परिणामों के बारे में
सोचने की क्षमता है। बुद्धिमानीपूर्ण गतिविधि में दीर्घकालिक लक्ष्यों पर
विचार करना, उन लक्ष्यों तक पहुंचने के मार्गों का आयोजन और योजना बनाना,
और विपरीत अल्पकालिक आवेगों के सामने भी अपने लक्ष्यों की ओर
दृढ़ता से बढ़ते रहना शामिल है। यह विचार कि बुद्धिमत्ता में आवेग-
नियंत्रण शामिल है, विवेकपूर्णता शब्द में सुंदर ढंग से समाहित है — यह
कर्तव्यपरायणता क्षेत्र का एक वैकल्पिक नाम भी है। विवेकपूर्ण का अर्थ है
बुद्धिमान और सावधान — दोनों।
<br /><br/>
कर्तव्यपरायणता पैमाने पर उच्च स्कोर
करने वाले व्यक्तियों को वास्तव में दूसरे लोग बुद्धिमान समझते हैं।
उच्च कर्तव्यपरायणता के लाभ स्पष्ट हैं। कर्तव्यपरायण व्यक्ति मुसीबतों
से बचते हैं और उद्देश्यपूर्ण योजना एवं दृढ़ता के माध्यम से उच्च स्तर की
सफलता प्राप्त करते हैं। दूसरे लोग उन्हें बुद्धिमान और विश्वसनीय मानकर
सकारात्मक दृष्टि से देखते हैं। नकारात्मक पक्ष यह है कि वे पूर्णतावाद
के धुनी और कार्यपरक हो सकते हैं। इसके अतिरिक्त, अत्यंत कर्तव्यपरायण
व्यक्तियों को रूढ़िवादी और नीरस समझा जा सकता है।
<br /><br />
कम कर्तव्यपरायण लोगों की आलोचना उनकी अविश्वसनीयता,
महत्वाकांक्षा की कमी और सीमाओं में न रह पाने के कारण हो सकती है,
परंतु वे कई अल्पकालिक सुखों का अनुभव करेंगे और उन्हें कभी रूढ़िवादी
नहीं कहा जाएगा।`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `कर्तव्यपरायणता पर आपका स्कोर कम है, जो यह दर्शाता है कि आप
वर्तमान क्षण में जीना पसंद करते हैं और वही करते हैं जो अभी अच्छा
लगता है। आपका काम लापरवाह और अव्यवस्थित प्रवृत्ति का होता है।`
    },
    {
      score: 'neutral', // do not translate this line
      text: `कर्तव्यपरायणता पर आपका स्कोर औसत है। इसका अर्थ है कि आप
यथोचित रूप से विश्वसनीय, व्यवस्थित और आत्म-संयमी हैं।`
    },
    {
      score: 'high', // do not translate this line
      text: `कर्तव्यपरायणता पर आपका स्कोर उच्च है। इसका अर्थ है कि आप स्पष्ट
लक्ष्य निर्धारित करते हैं और उनका दृढ़ संकल्प के साथ अनुसरण करते हैं।
लोग आपको विश्वसनीय और परिश्रमी मानते हैं।`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'आत्म-प्रभावशीलता',
      text: `आत्म-प्रभावशीलता किसी कार्य को पूरा करने की अपनी क्षमता
में विश्वास को दर्शाती है। उच्च स्कोर वाले लोग मानते हैं कि सफलता
प्राप्त करने के लिए आवश्यक बुद्धिमत्ता (समझदारी), प्रेरणा और आत्म-
नियंत्रण उनके पास है। कम स्कोर वाले लोग स्वयं को प्रभावी नहीं महसूस
करते, और उन्हें ऐसा लग सकता है कि उनका अपने जीवन पर नियंत्रण नहीं है।`
    },
    {
      facet: 2,
      title: 'व्यवस्थितता',
      text: `व्यवस्थितता पर उच्च स्कोर वाले व्यक्ति सुसंगठित होते
हैं। वे दिनचर्या और समय-सारणी के अनुसार जीना पसंद करते हैं। वे
सूचियां बनाते हैं और योजनाएं तैयार करते हैं। कम स्कोर वाले लोग अव्यवस्थित
और बिखरे हुए होते हैं।`
    },
    {
      facet: 3,
      title: 'कर्तव्यनिष्ठा',
      text: `यह पैमाना व्यक्ति की कर्तव्य और दायित्व की भावना की
मज़बूती को दर्शाता है। इस पैमाने पर उच्च स्कोर करने वालों में नैतिक
दायित्व की गहरी भावना होती है। कम स्कोर वाले लोग अनुबंधों, नियमों
और विनियमों को अत्यधिक बंधनकारी पाते हैं। उन्हें अविश्वसनीय या यहां
तक कि गैर-ज़िम्मेदार समझा जा सकता है।`
    },
    {
      facet: 4,
      title: 'उपलब्धि-प्रयास',
      text: `इस पैमाने पर उच्च स्कोर करने वाले व्यक्ति उत्कृष्टता
प्राप्त करने के लिए कठिन प्रयास करते हैं। सफल के रूप में पहचाने जाने
की उनकी ललक उन्हें अपने उच्च लक्ष्यों की राह पर बनाए रखती है। उनके
जीवन में अक्सर दिशा की गहरी भावना होती है, परंतु अत्यंत उच्च स्कोर
वाले एकनिष्ठ होकर अपने काम के प्रति जुनूनी हो सकते हैं। कम स्कोर
वाले लोग न्यूनतम काम में ही संतुष्ट रहते हैं, और दूसरों की नज़र में
आलसी समझे जा सकते हैं।`
    },
    {
      facet: 5,
      title: 'आत्म-अनुशासन',
      text: `आत्म-अनुशासन — जिसे कई लोग इच्छा-शक्ति कहते हैं —
कठिन या अप्रिय कार्यों को पूरा होने तक करते रहने की क्षमता को
दर्शाता है। उच्च आत्म-अनुशासन वाले लोग कार्य शुरू करने की अनिच्छा
पर विजय पाते हैं और विकर्षणों के बावजूद अपनी राह पर बने रहते हैं। कम
आत्म-अनुशासन वाले लोग काम टालते हैं और उन्हें पूरा करने में कमज़ोर
दिखते हैं — अक्सर कार्यों को पूरा करने में असफल रहते हैं, यहां तक कि
उन्हें भी जिन्हें वे बहुत पूरा करना चाहते हैं।`
    },
    {
      facet: 6,
      title: 'सावधानी',
      text: `सावधानी कार्य करने से पहले संभावनाओं पर सोच-विचार
करने की प्रवृत्ति को दर्शाती है। सावधानी पैमाने पर उच्च स्कोर वाले लोग
निर्णय लेते समय अपना समय लेते हैं। कम स्कोर वाले लोग अक्सर विकल्पों
और उनके संभावित परिणामों पर विचार किए बिना मन में आई पहली बात कह
या कर देते हैं।`
    }
  ]
}

export default conscientiousness
