import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: 'बहिर्मुखता',
  shortDescription: 'बहिर्मुखता बाहरी दुनिया के साथ स्पष्ट सक्रिय जुड़ाव से पहचानी जाती है।',
  description: `बहिर्मुखी लोगों को लोगों के साथ रहना अच्छा लगता है, वे ऊर्जा
से भरे होते हैं, और अक्सर सकारात्मक भावनाओं का अनुभव करते हैं। वे
उत्साही, कार्य-उन्मुख व्यक्ति होते हैं जो उत्तेजना के अवसरों पर
"हां!" या "चलो!" कहने की संभावना रखते हैं। समूहों में वे बात करना,
अपनी बात दृढ़ता से रखना और अपनी ओर ध्यान आकर्षित करना पसंद करते हैं।
<br /><br />
अंतर्मुखी लोगों में बहिर्मुखी लोगों जैसा उल्लास, ऊर्जा और सक्रियता
का स्तर नहीं होता। वे शांत, संयत, विचारशील और सामाजिक दुनिया से
कुछ अलग रहने वाले होते हैं। उनकी सामाजिक भागीदारी की कमी को
शर्मीलापन या अवसाद के रूप में नहीं समझना चाहिए; अंतर्मुखी व्यक्ति
को बस बहिर्मुखी की तुलना में कम उत्तेजना की आवश्यकता होती है और
वह अकेले रहना पसंद करता है। <br /><br />अंतर्मुखी की स्वतंत्रता और संयम को
कभी-कभी असौहार्दता या घमंड समझ लिया जाता है। वास्तव में, ऐसा
अंतर्मुखी जो सामंजस्यता आयाम पर उच्च स्कोर करता हो, स्वयं दूसरों
की तलाश नहीं करेगा, परंतु जब कोई उससे संपर्क करेगा तो वह काफी
सुखद व्यवहार करेगा।`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `बहिर्मुखता पर आपका स्कोर कम है, जो यह दर्शाता है कि आप
अंतर्मुखी, संयत और शांत स्वभाव के हैं। आप एकाकीपन और एकांत
गतिविधियों का आनंद लेते हैं। आपकी सामाजिकता सामान्यतः कुछ चुनिंदा
घनिष्ठ मित्रों तक ही सीमित रहती है।`
    },
    {
      score: 'neutral', // do not translate this line
      text: `बहिर्मुखता पर आपका स्कोर औसत है, जो यह दर्शाता है कि आप न तो
कोई खामोश एकांतवासी हैं और न ही कोई हंसमुख बातूनी। आप दूसरों के
साथ समय का भी आनंद लेते हैं और अकेले समय का भी।`
    },
    {
      score: 'high', // do not translate this line
      text: `बहिर्मुखता पर आपका स्कोर उच्च है, जो यह दर्शाता है कि आप
मिलनसार, बाहर-उन्मुख, ऊर्जावान और जीवंत हैं। आप अधिकांश समय
लोगों के बीच रहना पसंद करते हैं।`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'मैत्रीपूर्णता',
      text: `मैत्रीपूर्ण लोग दूसरों को दिल से पसंद करते हैं और दूसरों
के प्रति अपनी सकारात्मक भावनाओं को खुलकर व्यक्त करते हैं। वे जल्दी
दोस्त बना लेते हैं और उनके लिए घनिष्ठ, अंतरंग संबंध बनाना आसान होता
है। मैत्रीपूर्णता पर कम स्कोर वाले लोग ज़रूरी नहीं कि ठंडे और शत्रुतापूर्ण
हों, परंतु वे दूसरों की ओर बढ़ते नहीं और दूसरों को दूर व संयत
प्रतीत होते हैं।`
    },
    {
      facet: 2,
      title: 'सामाजिकता',
      text: `सामाजिक लोगों को दूसरों की संगति सुखद रूप से उत्तेजक
और संतोषजनक लगती है। वे भीड़ के उत्साह का आनंद लेते हैं। कम स्कोर
वाले लोग बड़ी भीड़ से अभिभूत महसूस करते हैं और इसलिए सक्रिय रूप से
उससे बचते हैं। ज़रूरी नहीं कि वे कभी-कभी लोगों के साथ रहना नापसंद
करते हों, परंतु इस पैमाने पर उच्च स्कोर वाले व्यक्तियों की तुलना में
उन्हें एकांत और अपने लिए समय की आवश्यकता बहुत अधिक होती है।`
    },
    {
      facet: 3,
      title: 'दृढ़तापूर्ण अभिव्यक्ति',
      text: `इस पैमाने पर उच्च स्कोर वाले लोग खुलकर बात करना, कमान
संभालना और दूसरों की गतिविधियों का निर्देशन करना पसंद करते हैं।
वे समूहों में नेता बनते हैं। कम स्कोर वाले लोग सामान्यतः ज़्यादा बात
नहीं करते और समूहों की गतिविधियों का नियंत्रण दूसरों को करने देते हैं।`
    },
    {
      facet: 4,
      title: 'सक्रियता स्तर',
      text: `सक्रिय व्यक्ति तेज़ गति वाला, व्यस्त जीवन जीते हैं। वे तेज़ी से,
ऊर्जा और जोश के साथ आते-जाते हैं, और कई गतिविधियों में शामिल रहते
हैं। इस पैमाने पर कम स्कोर करने वाले लोग धीमी और अधिक आरामदेह,
शांत गति अपनाते हैं।`
    },
    {
      facet: 5,
      title: 'उत्तेजना की तलाश',
      text: `इस पैमाने पर उच्च स्कोर वाले लोग उच्च स्तर की उत्तेजना के
बिना जल्दी ऊब जाते हैं। उन्हें चमकीली रोशनी और हलचल भरा माहौल
पसंद आता है। वे जोखिम उठाने और रोमांच की तलाश करने की संभावना
रखते हैं। कम स्कोर वाले लोग शोर और कोलाहल से अभिभूत हो जाते हैं
और रोमांच की तलाश से विमुख रहते हैं।`
    },
    {
      facet: 6,
      title: 'प्रसन्नता',
      text: `यह पैमाना सकारात्मक मनोदशा और भावनाओं को मापता है,
नकारात्मक भावनाओं को नहीं (जो न्यूरोटिसिज़्म क्षेत्र का हिस्सा हैं)।
इस पैमाने पर उच्च स्कोर करने वाले व्यक्ति सामान्यतः सकारात्मक
भावनाओं की एक श्रृंखला का अनुभव करते हैं, जिनमें खुशी, उत्साह,
आशावाद और आनंद शामिल हैं। कम स्कोर वाले लोग इतने ऊर्जावान,
उल्लासमय मनोदशा के प्रवण नहीं होते।`
    }
  ]
}

export default extraversion
