import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: '宜人性',
  shortDescription: '宜人性反映了个体在合作与维系社会和谐方面的差异。宜人性高的人重视与他人和睦相处。',
  description: `因此，他们体贴、友善、慷慨、乐于助人，
并愿意在与他人的利益发生冲突时做出让步。宜人性高的人对人性
持乐观的看法，相信人们基本上是诚实、正直、
值得信赖的。<br /><br />
宜人性低的人把自身利益置于与他人和睦相处之上。
他们通常不太关心他人的福祉，
因此不太可能为他人付出额外的努力。
有时，他们对他人动机的怀疑会使他们变得
多疑、不友善、不合作。
<br /><br />
显然，宜人性有助于赢得并维持人缘。
宜人性高的人比宜人性低的人更受人喜爱。
另一方面，在需要强硬或绝对客观决策的场合，
宜人性并无优势。宜人性低的人可以成为出色的
科学家、评论家或军人。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `你的宜人性得分较低，表明你更关注自身的需求，
而不是他人的需求。在别人眼中，你强硬、挑剔、
不愿妥协。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `你的宜人性处于中等水平，表明你对他人的需求
有一定的关心，但总体来说，不太愿意为他人
牺牲自己。`
    },
    {
      score: 'high', // do not translate this line
      text: `你的宜人性得分较高，表明你非常关注他人的需求
与福祉。你和蔼可亲、富有同情心、乐于合作。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '信任',
      text: `信任度高的人会假定大多数人是公平、诚实、
怀有善意的。信任度低的人则认为他人自私、
狡诈，并且可能带来危险。`
    },
    {
      facet: 2,
      title: '坦率',
      text: `在这一维度上得分高的人认为，与他人交往时
没有必要伪装或操纵，因此他们坦诚、直率、
真诚。得分低的人则认为，在社会关系中一定程度的
掩饰是必要的。人们通常觉得与直率的高分者
相处比较容易，而与不够直率的低分者相处
则相对困难。需要说明的是，低分者并非
没有原则或不道德；他们只是更加谨慎设防，
不太愿意公开袒露全部真相。`
    },
    {
      facet: 3,
      title: '利他',
      text: `利他的人会由衷地觉得帮助他人是一件有意义、
有回报的事。因此，他们通常愿意帮助
有需要的人。利他的人认为，为他人做事是一种
自我实现，而不是自我牺牲。在这一维度上得分低的人
并不特别喜欢帮助有需要的人。求助的请求
在他们看来是一种打扰，而不是自我实现的机会。`
    },
    {
      facet: 4,
      title: '合作',
      text: `在这一维度上得分高的人不喜欢冲突。
他们非常愿意做出妥协，或压抑自己的需求，
以便与他人和睦相处。得分低的人则更有可能
通过威慑他人来达到自己的目的。`
    },
    {
      facet: 5,
      title: '谦逊',
      text: `在这一维度上得分高的人不喜欢声称
自己比别人优秀。在某些情况下，这种态度
可能源于自信心或自尊较低。不过，也有一些
自尊很高的人觉得不谦逊是不体面的。
那些愿意自诩高人一等的人，往往会被他人
视为令人反感的傲慢。`
    },
    {
      facet: 6,
      title: '同理心',
      text: `在这一维度上得分高的人心地柔软、
富有同情心。他们能感同身受地体会他人的痛苦，
很容易心生怜悯。得分低的人受人间疾苦
的影响较弱。他们以基于理性做出客观判断为荣，
比起仁慈，他们更看重真相与公正。`
    }
  ]
}

export default agreeableness
