import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: '尽责性',
  shortDescription: '尽责性关乎我们控制、调节和引导自身冲动的方式。',
  description: `冲动本身并非坏事；
有时时间紧迫，需要我们当机立断，此时凭第一冲动
行事可能是一种有效的应对方式。此外，在玩乐而非
工作之时，随性而行、冲动而为也别有一番乐趣。
在别人眼中，冲动的人可能多姿多彩、
相处有趣、甚至有些古灵精怪。
<br /><br />
尽管如此，凭冲动行事可能在多个方面带来麻烦。
有些冲动是反社会的。不受控制的反社会行为
不仅会伤害社会中的其他成员，还可能使
这类冲动行为的实施者遭到惩罚。冲动行为的另一个
问题是，它们往往带来即时的回报，却造成不良的
长期后果。例如：过度社交导致丢掉工作，
脱口而出的一句辱骂导致一段重要关系破裂，
或者使用带来快感的药物最终毁掉健康。
<br /><br />
冲动行为即便没有严重的破坏性，也会在重要方面
削弱一个人的做事成效。冲动行事让人无法
深思熟虑其他行动方案，而其中有些方案本来
会比冲动的选择更明智。冲动还会使人在需要
按有序步骤或阶段推进的项目中偏离轨道。
因此，冲动的人取得的成就往往
微小、零散、且不稳定。
<br /><br />
智慧的一个标志——也是人类区别于早期生命形式的
潜在特质——是在凭冲动行动之前思考未来后果的
能力。智慧的行为包括思考长远目标、
组织和规划通往这些目标的路径，并在
与之相悖的短暂冲动面前坚持自己的目标。
智慧包含冲动控制这一观点，被"审慎"一词
巧妙地概括——"审慎"正是尽责性这一维度的
另一种称呼。审慎既意味着明智，也意味着谨慎。
<br /><br/>
事实上，在尽责性量表上得分高的人
会被他人视为有智慧。
尽责性高的益处显而易见。尽责的人
能避开麻烦，并通过有目的的规划和坚持取得
高度的成功。他们也被他人正面地视为
聪明而可靠。从消极的一面看，他们可能
是强迫性的完美主义者和工作狂。
此外，极度尽责的人可能会被视为
古板而乏味。
<br /><br />
尽责性低的人可能会因不可靠、缺乏上进心、
不循规蹈矩而受到批评，但他们会体验到
许多短暂的快乐，而且他们永远不会
被人说成古板。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `你的尽责性得分较低，表明你喜欢活在当下，
做当下感觉舒服的事。你的工作往往
比较马虎、缺乏条理。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `你的尽责性得分处于中等水平。这意味着你
相当可靠、有条理，且有自控力。`
    },
    {
      score: 'high', // do not translate this line
      text: `你的尽责性得分较高。这意味着你会设定清晰的
目标，并坚定地为之努力。人们认为你
可靠且勤奋。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '自我效能',
      text: `自我效能描述了一个人对自己完成事情的能力的
信心。得分高的人相信自己具备取得成功所需的
智慧（常识）、动力和自控力。得分低的人觉得自己
办事不力，可能会有一种无法掌控自己生活的感觉。`
    },
    {
      facet: 2,
      title: '条理性',
      text: `条理性得分高的人做事井井有条。
他们喜欢按照惯例和时间表生活。他们
会列清单、做计划。得分低的人往往
缺乏条理、散漫无序。`
    },
    {
      facet: 3,
      title: '责任感',
      text: `这一量表反映了一个人责任感的强弱。
在这一量表上得分高的人有很强的道德义务感。
得分低的人觉得合同、规则和规章制度
过于束缚。他们很可能被视为不可靠，
甚至不负责任。`
    },
    {
      facet: 4,
      title: '追求成就',
      text: `在这一量表上得分高的人为追求卓越而不懈努力。
渴望被认可为成功者的动力，使他们始终朝着
远大目标前进。他们往往有很强的人生方向感，
但得分极高者可能过于专注单一目标，甚至
痴迷于工作。得分低的人满足于以最少的付出
得过且过，可能会被他人视为懒惰。`
    },
    {
      facet: 5,
      title: '自律',
      text: `自律——也就是许多人所说的意志力——指的是
坚持完成困难或不愉快的任务直至完成的能力。
自律性强的人能够克服开始任务时的不情愿，
并在有干扰的情况下保持正轨。自律性弱的人
做事拖延、有始无终，常常无法完成任务——
即使是他们非常想完成的任务。`
    },
    {
      facet: 6,
      title: '谨慎',
      text: `谨慎描述了在行动前仔细考虑各种可能性的
倾向。在谨慎量表上得分高的人做决定时
从容不迫。得分低的人常常不假思索地说出或做出
脑海中冒出的第一件事，而不会权衡各种选择
及其可能的后果。`
    }
  ]
}

export default conscientiousness
