import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: '外向性',
  shortDescription: '外向性的显著特征是高度投入外部世界。',
  description: `外向的人喜欢与人相处，精力充沛，
并且经常体验到积极的情绪。他们往往热情、
行动导向，遇到令人兴奋的机会时很可能会说
"好！"或"我们走吧！"。在群体中，他们喜欢
交谈、表现自己，并吸引他人的注意。
<br /><br />
内向的人缺乏外向者的热情、精力和活动水平。
他们往往安静、低调、从容不迫，并且
较少参与社交活动。他们缺乏社交参与
不应被解读为害羞或抑郁；
内向者只是比外向者需要更少的刺激，
并且更喜欢独处。<br /><br />内向者的独立和矜持
有时会被误解为不友善或傲慢。事实上，
一个在宜人性维度上得分高的内向者虽然不会
主动接近他人，但在别人主动接近时会
相当和蔼可亲。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `你的外向性得分较低，表明你内向、
矜持、安静。你享受独处和独自进行的活动。
你的社交往往仅限于少数几个亲密朋友。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `你的外向性得分处于中等水平，表明你
既不是沉默寡言的独行者，也不是活泼爱聊的
健谈者。你既享受与他人相处的时光，
也享受独处的时光。`
    },
    {
      score: 'high', // do not translate this line
      text: `你的外向性得分较高，表明你善于交际、
开朗外向、精力充沛、充满活力。你大多数时候
都喜欢身处人群之中。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '热情',
      text: `热情的人由衷地喜欢他人，并坦率地向他人
表达积极的情感。他们交朋友很快，也很容易
建立亲密的关系。热情度得分低的人不一定
冷漠或敌对，但他们不会主动接触他人，
会给人疏远和矜持的印象。`
    },
    {
      facet: 2,
      title: '乐群性',
      text: `乐群的人觉得与他人相处是令人愉悦、
有激励性且有回报的。他们享受人群带来的
兴奋感。得分低的人往往会对人群感到不知所措，
因此会主动避开人多的场合。他们不一定
不喜欢偶尔与人相处，但他们对独处和私人时间的
需求远大于在这一量表上得分高的人。`
    },
    {
      facet: 3,
      title: '果断性',
      text: `果断性得分高的人喜欢表达意见、
掌控局面，并指挥他人的活动。他们往往是
群体中的领导者。得分低的人往往话不多，
让他人来主导群体的活动。`
    },
    {
      facet: 4,
      title: '活跃性',
      text: `活跃的人过着快节奏、忙碌的生活。
他们行动迅速、精力充沛、充满活力，
并且参与许多活动。在这一量表上得分低的人
则遵循更缓慢、更悠闲、更放松的生活节奏。`
    },
    {
      facet: 5,
      title: '寻求刺激',
      text: `在这一量表上得分高的人如果缺少高强度刺激
就容易感到无聊。他们喜欢明亮的灯光和
喧嚣热闹的环境。他们很可能冒险并寻求
刺激。得分低的人则容易被噪音和喧闹淹没，
并且厌恶寻求刺激的行为。`
    },
    {
      facet: 6,
      title: '积极情绪',
      text: `这一量表测量的是积极的情绪和感受，
而非消极情绪（消极情绪属于神经质维度）。
在这一量表上得分高的人通常会体验到一系列
积极感受，包括快乐、热情、乐观和喜悦。
得分低的人则不太容易表现出这种
精力充沛、兴致高昂的状态。`
    }
  ]
}

export default extraversion
