import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: '神经质',
  shortDescription: '神经质指的是体验消极情绪的倾向。',
  description: `弗洛伊德最初用"神经症"一词来描述一种
以精神痛苦、情感折磨以及无法有效应对生活
正常需求为特征的状态。他认为每个人都表现出
某些神经症的迹象，只是我们痛苦的程度和具体的
症状各不相同。如今，神经质指的是体验
消极情绪的倾向。<br /><br />神经质得分高的人可能
主要体验某一种特定的消极情绪，如焦虑、
愤怒或抑郁，但也可能同时体验到其中
几种情绪。<br /><br />神经质高的人情绪反应强烈。
对大多数人不会造成影响的事件，他们也会产生
情绪反应，而且他们的反应往往比常人更强烈。
他们更容易把普通的情境解读为威胁，
把小小的挫折视为难以逾越的困难。<br /><br />他们的消极
情绪反应往往会持续异常长的时间，这意味着
他们常常心情不佳。这些情绪调节方面的问题
会削弱神经质者清晰思考、做出决定以及
有效应对压力的能力。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `你的神经质得分较低，表明你格外冷静、
沉着、处变不惊。即使是大多数人认为
有压力的情境，你也不会产生强烈的情绪反应。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `你的神经质得分处于中等水平，表明你的情绪
反应程度与一般人群相当。有压力或令人沮丧的
情境会让你有些不安，但你通常能够平复
这些情绪，并妥善应对这些情境。`
    },
    {
      score: 'high', // do not translate this line
      text: `你的神经质得分较高，表明你容易心绪不宁，
即使是大多数人认为正常的生活要求也会让你
烦恼。人们认为你敏感且情绪化。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '焦虑',
      text: `焦虑者大脑中的"战斗或逃跑"系统太容易、
太频繁地被激活。因此，焦虑程度高的人常常觉得
似乎有危险即将发生。他们可能害怕某些特定的
情境，也可能只是笼统地感到恐惧。他们感到
紧张、焦躁、不安。焦虑程度低的人通常
平静而无畏。`
    },
    {
      facet: 2,
      title: '愤怒',
      text: `愤怒得分高的人在事情不如所愿时会感到
恼怒。他们很在意自己是否被公平对待，当觉得
自己被欺骗时会感到怨恨和愤懑。这一量表测量的
是感到愤怒的倾向；至于是否会表达出不满
和敌意，则取决于个体在宜人性维度上的水平。
得分低的人不常生气，也不容易动怒。`
    },
    {
      facet: 3,
      title: '抑郁',
      text: `这一量表测量的是感到悲伤、沮丧和
气馁的倾向。得分高的人缺乏活力，难以
主动开始行动。得分低的人往往较少受到
这些抑郁情绪的困扰。`
    },
    {
      facet: 4,
      title: '自我意识',
      text: `自我意识强的人对别人如何看待自己很敏感。
对被拒绝和被嘲笑的担忧使他们在与人相处时
感到害羞和不自在。他们容易尴尬，常常感到
羞愧。他们担心别人会批评或取笑自己，这种
担忧被夸大了，并不现实，但他们的局促和不安
可能会让这些担忧成为自我实现的预言。
相比之下，得分低的人不会受"人人都在关注和
评判自己"这种错误印象的困扰。他们在社交
场合中不会感到紧张。`
    },
    {
      facet: 5,
      title: '冲动性',
      text: `冲动性强的人会感受到难以抗拒的强烈渴望
和冲动。他们往往倾向于追求即时的快乐
和回报，而非考虑长远后果。得分低的人不会
体验到强烈而无法抗拒的渴望，因此也不会
发现自己受到放纵的诱惑。`
    },
    {
      facet: 6,
      title: '脆弱性',
      text: `脆弱性得分高的人在压力之下会感到
恐慌、困惑和无助。得分低的人在压力之下
则会感到更加镇定、自信，思维也更清晰。`
    }
  ]
}

export default neuroticism
