import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: '经验开放性',
  shortDescription: '经验开放性描述了一种认知风格维度，它将富有想象力和创造力的人与脚踏实地、因循传统的人区分开来。',
  description: `开放的人求知欲强、欣赏艺术、
对美敏感。与封闭的人相比，他们往往
更能觉察自己的感受。他们倾向于以
个人主义的、不随俗的方式思考和
行动。知识分子的经验开放性得分通常较高；
因此，这一因素也曾被称为"文化"或
"智力"。<br /><br />不过，"智力"或许更适合被视为经验开放性的
一个方面。经验开放性的得分与受教育年限
以及标准智力测验的得分只有中等程度的相关。
<br /><br />
开放型认知风格的另一个特征，是善于以
远离具体经验的符号和抽象概念进行思考。
根据个体具体智力能力的不同，这种符号化的认知
可能表现为数学、逻辑或几何思维，
艺术化和隐喻式的语言运用，音乐创作或表演，
或众多视觉与表演艺术中的一种。
<br /><br />
经验开放性得分低的人往往兴趣狭窄而平常。
他们偏爱朴素、直截了当、一目了然的事物，
而不是复杂、含混、微妙的事物。他们可能对
艺术和科学抱有怀疑，认为这些事业深奥难懂
或毫无实际用处。封闭的人偏爱熟悉胜过新奇；
他们保守，抗拒变化。
<br /><br />
心理学家常常把开放性描绘为更健康或更成熟，
而他们自己往往就是经验开放的人。然而，
开放与封闭的思维风格在不同的环境中各有其用。
开放者的知性风格或许很适合教授，但研究
表明，封闭式思维与警务、销售以及若干
服务行业中的出色工作表现相关。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `你的经验开放性得分较低，表明你喜欢以
朴素简单的方式思考。别人会认为你脚踏实地、
务实、保守。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `你的经验开放性得分处于中等水平，表明你
既乐于保持传统，也愿意尝试新事物。你的思维
既不简单，也不复杂。在别人看来，你是
一个受过良好教育的人，但不是知识分子。`
    },
    {
      score: 'high', // do not translate this line
      text: `你的经验开放性得分较高，表明你喜欢新奇、
多样与变化。你充满好奇心、富有想象力和
创造力。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '想象力',
      text: `对富有想象力的人来说，现实世界往往
过于平淡无奇。在这一量表上得分高的人会
借助幻想来创造一个更丰富、更有趣的世界。
得分低的人则更关注事实而非幻想。`
    },
    {
      facet: 2,
      title: '艺术兴趣',
      text: `在这一量表上得分高的人热爱美，
无论是艺术之美还是自然之美。他们很容易
沉浸于艺术与自然的事物之中。他们不一定
受过艺术训练或有艺术天赋，尽管很多人确实如此。
这一量表的决定性特征是对自然之美和
人工之美的兴趣与欣赏。得分低的人缺乏
审美感受力，对艺术也缺乏兴趣。`
    },
    {
      facet: 3,
      title: '情绪感受',
      text: `情绪感受性高的人能够很好地接触并觉察
自己的感受。得分低的人对自己感受的觉察
较少，也往往不会公开地表达自己的情绪。`
    },
    {
      facet: 4,
      title: '敢于尝试',
      text: `敢于尝试得分高的人渴望尝试新的活动、
到异国旅行、体验不同的事物。他们觉得
熟悉与例行公事令人厌倦，仅仅因为一条
回家路线不一样，就会选择走它。得分低的人
往往对变化感到不自在，更喜欢熟悉的惯例。`
    },
    {
      facet: 5,
      title: '思辨',
      text: `思辨与艺术兴趣是经验开放性中最重要、
最核心的两个方面。思辨得分高的人喜欢
玩味各种观念。他们对新奇和不寻常的想法
持开放态度，喜欢就知识性的话题展开辩论。
他们喜欢谜语、智力题和脑筋急转弯。
思辨得分低的人更愿意与人或事物打交道，
而不是与观念打交道。他们认为智力上的操练
是浪费时间。思辨不应与智力混为一谈。
思辨是一种知性风格，而非智力能力，尽管
思辨得分高的人在标准化智力测验上的得分
略高于思辨得分低的人。`
    },
    {
      facet: 6,
      title: '自由主义',
      text: `心理学意义上的自由主义指的是一种乐于
挑战权威、习俗和传统价值观的倾向。在其最
极端的形式下，心理自由主义甚至可能表现为
对规则的公然敌视、对违法者的同情，以及
对含混、混乱和无序的喜爱。心理保守主义者
则偏爱遵从传统所带来的安全感与稳定感。
心理自由主义与保守主义并不等同于政治立场，
但它们确实会使个体倾向于某些政党。`
    }
  ]
}

export default openness
