import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: 'Доброзичливість',
  shortDescription: 'Доброзичливість відображає індивідуальні відмінності в прагненні до співпраці та соціальної злагоди. Доброзичливі люди цінують гармонійні стосунки з іншими.',
  description: `Тому вони уважні, дружні,
щедрі, готові допомогти та йти на компроміс заради
інших. Доброзичливі люди також мають оптимістичний погляд на людську
природу. Вони вірять, що люди в основі своїй чесні, порядні та
заслуговують на довіру. <br /><br />
Недоброзичливі люди ставлять власні інтереси вище за злагоду з
іншими. Їм зазвичай байдуже до благополуччя інших, і тому
вони навряд чи докладатимуть зусиль заради когось іншого.
Іноді їхній скептицизм щодо мотивів оточуючих робить їх
недовірливими, недружніми та несхильними до співпраці.
<br /><br />
Доброзичливість, безсумнівно, допомагає здобувати та підтримувати
популярність. Доброзичливих людей люблять більше, ніж недоброзичливих.
З іншого боку, доброзичливість не корисна в ситуаціях,
що вимагають жорстких або цілком об'єктивних рішень. Недоброзичливі
люди можуть бути чудовими науковцями, критиками чи військовими.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твій результат за шкалою Доброзичливості низький, що вказує на менше
занепокоєння потребами інших, ніж власними. Люди сприймають тебе як
непоступливу, критичну та тверду людину.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твій рівень Доброзичливості середній, що вказує на певне
занепокоєння потребами інших, але, загалом, небажання
жертвувати собою заради інших.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твій високий рівень Доброзичливості вказує на сильну зацікавленість
потребами та благополуччям інших. Ти приємний, співчутливий
та схильний до співпраці.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Довіра',
      text: `Людина з високим рівнем довіри припускає, що більшість людей
справедливі, чесні та мають добрі наміри. Люди з низьким рівнем довіри
бачать інших егоїстичними, хитрими та потенційно небезпечними.`
    },
    {
      facet: 2,
      title: 'Моральність',
      text: `Ті, хто набирає високі бали за цією шкалою, не бачать потреби в
удаваності чи маніпуляціях у стосунках з іншими, і тому вони
відверті, щирі та прямолінійні. Ті, хто набирає низькі бали, вважають,
що певна частка обману в соціальних стосунках необхідна. Людям
порівняно легко взаємодіяти з прямолінійними
власниками високих балів за цією шкалою. Їм, як правило, важче
взаємодіяти з непрямими власниками низьких балів. Варто
зазначити, що низькі бали не означають безпринципності
чи аморальності; такі люди просто обережніші й менш схильні відкрито
розкривати всю правду.`
    },
    {
      facet: 3,
      title: 'Альтруїзм',
      text: `Альтруїстичні люди знаходять справжнє задоволення в допомозі
іншим. Тому вони, як правило, охоче допомагають тим, хто
потребує підтримки. Альтруїсти сприймають діяльність заради
інших як форму самореалізації, а не самопожертви. Ті, хто набирає
низькі бали за цією шкалою, не дуже люблять допомагати нужденним.
Прохання про допомогу здаються їм обтяжливими, а не можливістю
для самореалізації.`
    },
    {
      facet: 4,
      title: 'Співпраця',
      text: `Люди, які набирають високі бали за цією шкалою, не люблять
конфронтацій. Вони цілком готові йти на компроміс або
відмовлятися від власних потреб, аби жити в злагоді з іншими. Ті, хто
набирає низькі бали, частіше схильні залякувати інших, щоб
домогтися свого.`
    },
    {
      facet: 5,
      title: 'Скромність',
      text: `Ті, хто набирає високі бали за цією шкалою, не люблять стверджувати,
що вони кращі за інших. У деяких випадках таке ставлення
може випливати з низької впевненості в собі чи низької самооцінки. Водночас
деякі люди з високою самооцінкою вважають нескромність невластивою. Тих,
хто готовий описувати себе як вищих за інших, оточуючі схильні
сприймати як неприємно зарозумілих.`
    },
    {
      facet: 6,
      title: 'Співчуття',
      text: `Люди, які набирають високі бали за цією шкалою,
м'якосерді та співчутливі. Вони співпереживають біль інших
і легко схильні до жалю. Тих, хто набирає низькі бали, людське
страждання не зачіпає сильно. Вони пишаються тим, що ухвалюють
об'єктивні судження на основі розуму. Їх більше хвилюють
правда та неупереджена справедливість, ніж милосердя.`
    }
  ]
}

export default agreeableness
