import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: 'Сумлінність',
  shortDescription: 'Сумлінність стосується того, як ми контролюємо, регулюємо та спрямовуємо свої імпульси.',
  description: `Імпульси не є злом самі по собі;
іноді обмеження в часі вимагають швидкого рішення, і дія за
першим імпульсом може бути ефективною відповіддю. Крім того, у часи
відпочинку, а не роботи, спонтанні та імпульсивні дії можуть
бути веселими. Імпульсивних людей оточуючі можуть сприймати як
яскравих, веселих та непередбачуваних.
<br /><br />
Водночас дії за імпульсом можуть призводити до неприємностей у
багатьох випадках. Деякі імпульси є антисоціальними. Неконтрольовані
антисоціальні вчинки не лише шкодять іншим членам суспільства, а й
можуть спричинити покарання для винуватця таких імпульсивних дій. Інша
проблема імпульсивних вчинків полягає в тому, що вони часто дають
миттєву винагороду, але небажані довгострокові наслідки. Приклади:
надмірне товариське життя, що призводить до звільнення з роботи,
образа, що руйнує важливі стосунки, або вживання речовин, що
приносять задоволення, але зрештою руйнують здоров'я.
<br /><br />
Імпульсивна поведінка, навіть якщо вона не є серйозно руйнівною,
помітно знижує ефективність людини. Діючи імпульсивно, людина
не розглядає альтернативні шляхи дій, деякі з яких були б
мудрішими за імпульсивний вибір. Імпульсивність також збиває людей
з пантелику під час проєктів, що вимагають впорядкованої послідовності
кроків чи етапів. Тому досягнення імпульсивної людини
невеликі, розрізнені та непослідовні.
<br /><br />
Ознакою інтелекту, тим, що потенційно відрізняє людину
від ранніх форм життя, є здатність думати про майбутні
наслідки, перш ніж діяти за імпульсом. Розумна діяльність
передбачає обмірковування довгострокових цілей, організацію та планування
шляхів до них і наполегливий рух до своїх цілей попри
короткочасні імпульси протилежного спрямування. Ідею про те, що інтелект
передбачає контроль імпульсів, влучно передає термін розсудливість —
альтернативна назва домену Сумлінності. Розсудливий означає
водночас мудрий та обережний.
<br /><br/>
Людей, які набирають високі бали за
шкалою Сумлінності, оточуючі справді сприймають як розумних.
Переваги високої сумлінності очевидні. Сумлінні
люди уникають неприємностей і досягають високого рівня успіху завдяки
цілеспрямованому плануванню та наполегливості. Їх також позитивно
оцінують інші як розумних і надійних. З негативного
боку, вони можуть бути нав'язливими перфекціоністами та трудоголіками.
Крім того, надзвичайно сумлінних людей можуть вважати
нудними та занудними.
<br /><br />
Несумлінних людей можуть критикувати за
їхню ненадійність, відсутність амбіцій і небажання дотримуватися
рамок, але вони матимуть чимало короткочасних задоволень, і
їх ніколи не назвуть нудними.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твій результат за шкалою Сумлінності низький, що вказує на те, що ти
любиш жити моментом і робити те, що приносить задоволення зараз. Твоя
робота зазвичай недбала й неорганізована.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твій результат за шкалою Сумлінності середній. Це означає, що ти
достатньо надійний, організований та володієш самоконтролем.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твій результат за шкалою Сумлінності високий. Це означає, що ти ставиш
чіткі цілі та досягаєш їх з рішучістю. Люди вважають тебе
надійним і працьовитим.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Самоефективність',
      text: `Самоефективність описує впевненість у власній здатності
досягати результатів. Ті, хто набирає високі бали, вірять, що мають інтелект
(здоровий глузд), рішучість і самоконтроль, необхідні для досягнення успіху.
Ті, хто набирає низькі бали, не відчувають себе ефективними і можуть мати
відчуття, що не контролюють власне життя.`
    },
    {
      facet: 2,
      title: 'Організованість',
      text: `Люди з високими балами за шкалою організованості
добре організовані. Вони люблять жити за розпорядком і графіками.
Вони ведуть списки справ і складають плани. Ті, хто набирає низькі бали,
схильні бути неорганізованими та розпорошеними.`
    },
    {
      facet: 3,
      title: 'Відповідальність',
      text: `Ця шкала відображає силу відчуття обов'язку та
зобов'язань людини. Ті, хто набирає високі бали за цією шкалою, мають сильне
відчуття морального обов'язку. Ті, хто набирає низькі бали, вважають контракти,
правила та норми надто обмежувальними. Їх, імовірно, сприйматимуть як
ненадійних або навіть безвідповідальних.`
    },
    {
      facet: 4,
      title: 'Прагнення до досягнень',
      text: `Люди, які набирають високі бали за цією
шкалою, наполегливо прагнуть досягти досконалості. Їхнє бажання бути визнаними
як успішні тримає їх на шляху до високих цілей. Вони часто мають
сильне відчуття спрямованості в житті, але надзвичайно високі бали можуть
свідчити про надто однобоке зосередження та одержимість роботою. Ті, хто
набирає низькі бали, задовольняються мінімальним обсягом роботи і можуть
сприйматися іншими як ледачі.`
    },
    {
      facet: 5,
      title: 'Самодисципліна',
      text: `Самодисципліна — те, що багато хто називає
силою волі, — це здатність продовжувати виконувати складні чи неприємні
завдання до їх завершення. Люди з високою самодисципліною
здатні подолати небажання розпочати завдання і не збиватися з шляху,
незважаючи на відволікання. Ті, у кого низька самодисципліна, відкладають
справи на потім і не доводять їх до кінця, часто не завершуючи завдання —
навіть ті, які дуже хочуть завершити.`
    },
    {
      facet: 6,
      title: 'Обережність',
      text: `Обережність описує схильність обмірковувати
можливості перед дією. Ті, хто набирає високі бали за шкалою Обережності,
не поспішають, ухвалюючи рішення. Ті, хто набирає низькі бали, часто кажуть
або роблять перше, що спадає на думку, не зважаючи альтернативи та
імовірні наслідки цих альтернатив.`
    }
  ]
}

export default conscientiousness
