import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: 'Екстраверсія',
  shortDescription: 'Екстраверсія характеризується вираженою залученістю до зовнішнього світу.',
  description: `Екстраверти люблять бути серед людей, сповнені енергії та
часто відчувають позитивні емоції. Вони, як правило, ентузіасти,
орієнтовані на дію, які охоче скажуть "Так!" чи "Ходімо!"
на можливості яскравих вражень. У групах вони люблять говорити,
виявляти себе та привертати до себе увагу.
<br /><br />
Інтровертам бракує жвавості, енергії та рівня активності
екстравертів. Вони, як правило, тихі, стримані, зважені та
відсторонені від соціального світу. Їхня низька соціальна залученість
не повинна тлумачитися як сором'язливість чи депресія;
інтроверт просто потребує менше стимуляції, ніж екстраверт, і надає
перевагу самоті. <br /><br />Незалежність і стриманість інтроверта
іноді помилково сприймаються як недружелюбність чи зарозумілість. Насправді
інтроверт із високим рівнем доброзичливості не буде
шукати спілкування, але буде цілком приємним, коли до нього звернуться.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твій результат за шкалою Екстраверсії низький, що вказує на те, що ти
інтровертний, стриманий і тихий. Ти насолоджуєшся самотою та
самотніми заняттями. Твоє спілкування зазвичай обмежується кількома
близькими друзями.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твій результат за шкалою Екстраверсії середній, що вказує на те, що ти
ані тихий самітник, ані життєрадісний балакун. Тобі подобається час
з іншими, але й час наодинці.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твій результат за шкалою Екстраверсії високий, що вказує на те, що ти
товариський, відкритий, енергійний і жвавий. Ти віддаєш перевагу
перебуванню серед людей більшу частину часу.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Дружелюбність',
      text: `Дружелюбні люди щиро люблять інших людей
і відкрито демонструють позитивні почуття до них. Вони швидко
знаходять друзів, і їм легко формувати близькі, довірливі
стосунки. Ті, хто набирає низькі бали за шкалою Дружелюбності, не обов'язково
холодні та ворожі, але вони не прагнуть до інших і сприймаються
як віддалені та стримані.`
    },
    {
      facet: 2,
      title: 'Товариськість',
      text: `Товариські люди знаходять компанію інших
приємно стимулюючою та корисною. Вони насолоджуються
збудженням натовпу. Ті, хто набирає низькі бали, схильні відчувати себе
перевантаженими великими натовпами і тому активно їх уникають. Вони
не обов'язково не люблять іноді бувати серед людей, але їхня потреба
у приватності та часі для себе значно більша, ніж у тих, хто
набирає високі бали за цією шкалою.`
    },
    {
      facet: 3,
      title: 'Асертивність',
      text: `Ті, хто набирає високі бали за шкалою Асертивності, люблять
висловлюватися, брати на себе ініціативу та керувати діяльністю інших.
Вони, як правило, стають лідерами в групах. Ті, хто набирає низькі
бали, схильні небагато говорити і дозволяють іншим керувати
діяльністю груп.`
    },
    {
      facet: 4,
      title: 'Рівень активності',
      text: `Активні люди ведуть швидке, насичене
життя. Вони рухаються швидко, енергійно та запально, і
залучені в багато видів діяльності. Люди, які набирають низькі бали
за цією шкалою, дотримуються повільнішого, неквапливого,
розслабленого темпу.`
    },
    {
      facet: 5,
      title: 'Пошук гострих відчуттів',
      text: `Ті, хто набирає високі бали за цією шкалою, легко
нудьгують без високого рівня стимуляції. Вони люблять яскраве світло
і метушню. Вони схильні ризикувати та шукати гострих відчуттів. Ті, хто
набирає низькі бали, відчувають себе перевантаженими шумом і
метушнею та не схильні до пошуку гострих відчуттів.`
    },
    {
      facet: 6,
      title: 'Життєрадісність',
      text: `Ця шкала вимірює позитивний настрій та
почуття, а не негативні емоції (які належать до
домену Невротизму). Люди, які набирають високі бали за цією шкалою,
зазвичай відчувають широкий спектр позитивних почуттів, зокрема щастя,
ентузіазм, оптимізм і радість. Ті, хто набирає низькі бали, не так
схильні до такого енергійного, піднесеного настрою.`
    }
  ]
}

export default extraversion
