import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: 'Невротизм',
  shortDescription: 'Невротизм означає схильність переживати негативні почуття.',
  description: `Спочатку Фрейд використовував термін невроз для опису
стану, що характеризується психічним стресом, емоційним стражданням та
нездатністю ефективно справлятися зі звичайними вимогами життя. Він
припускав, що кожен проявляє певні ознаки неврозу, але ми
відрізняємося ступенем страждання та конкретними симптомами
стресу. Сьогодні невротизм означає схильність переживати
негативні почуття. <br /><br />Ті, хто набирає високі бали за шкалою Невротизму, можуть
переживати переважно одне конкретне негативне почуття, як-от тривогу,
гнів чи депресію, але, імовірно, переживатимуть кілька з цих
емоцій. <br /><br />Люди з високим рівнем невротизму емоційно реактивні. Вони
емоційно реагують на події, які не вплинули б на більшість людей, і
їхні реакції зазвичай інтенсивніші за норму. Вони частіше
інтерпретують звичайні ситуації як загрозливі, а незначні
розчарування — як безнадійно складні. <br /><br />Їхні негативні емоційні
реакції зазвичай тривають незвично довго, а це
означає, що вони часто бувають у поганому настрої. Ці проблеми з емоційною
регуляцією можуть зменшувати здатність людини з високим невротизмом мислити ясно, ухвалювати
рішення та ефективно справлятися зі стресом.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твій результат за шкалою Невротизму низький, що вказує на те, що ти
винятково спокійний, врівноважений і незворушний. Ти не реагуєш
інтенсивними емоціями навіть на ситуації, які більшість людей
описали б як стресові.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твій результат за шкалою Невротизму середній, що вказує на те, що твій рівень
емоційної реактивності типовий для загального населення.
Стресові та фруструючі ситуації дещо засмучують тебе,
але ти зазвичай здатен подолати ці почуття і впоратися з
цими ситуаціями.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твій результат за шкалою Невротизму високий, що вказує на те, що тебе легко
засмутити навіть тим, що більшість людей вважає звичайними вимогами
життя. Люди вважають тебе чутливим і емоційним.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Тривожність',
      text: `Система "бий або тікай" у мозку тривожних
людей вмикається надто легко й надто часто. Тому люди з
високим рівнем тривожності часто відчувають, ніби от-от станеться щось небезпечне.
Вони можуть боятися конкретних ситуацій або просто бути загалом боязкими.
Вони відчувають напругу, неспокій і нервозність. Люди з низьким рівнем Тривожності зазвичай
спокійні та безстрашні.`
    },
    {
      facet: 2,
      title: 'Гнів',
      text: `Люди, які набирають високі бали за шкалою Гніву, відчувають лють, коли
речі йдуть не так, як їм хочеться. Вони чутливі до справедливого ставлення
і відчувають образу та гіркоту, коли їм здається, що їх обманюють.
Ця шкала вимірює схильність відчувати гнів; те, чи виражає
людина роздратування та ворожість, залежить від її
рівня Доброзичливості. Ті, хто набирає низькі бали, гніваються нечасто й нелегко.`
    },
    {
      facet: 3,
      title: 'Депресія',
      text: `Ця шкала вимірює схильність відчувати сум, пригніченість
і розчарування. Ті, хто набирає високі бали, позбавлені енергії та мають труднощі з
початком діяльності. Ті, хто набирає низькі бали, зазвичай вільні від цих депресивних почуттів.`
    },
    {
      facet: 4,
      title: 'Самосвідомість',
      text: `Самосвідомі люди чутливі до того, що
інші про них думають. Їхнє занепокоєння щодо відторгнення та
глузування змушує їх почуватися сором'язливими та ніяковими серед інших. Їх
легко зніяковіти, і вони часто відчувають сором. Їхні страхи, що інші
критикуватимуть чи глузуватимуть з них, перебільшені й нереалістичні, але
їхня незграбність і дискомфорт можуть зробити ці страхи самоздійснювальним
пророцтвом. Ті, хто набирає низькі бали, навпаки, не страждають від хибного
враження, що всі стежать за ними та судять їх. Вони не відчувають
нервозності в соціальних ситуаціях.`
    },
    {
      facet: 5,
      title: 'Нестриманість',
      text: `Нестримані люди відчувають сильні потяги та
бажання, яким їм важко протистояти. Вони схильні бути
орієнтованими на короткострокові задоволення та винагороди, а не на довгострокові
наслідки. Ті, хто набирає низькі бали, не відчувають сильних, непереборних
потягів і тому не опиняються у спокусі надмірно вдаватися до задоволень.`
    },
    {
      facet: 6,
      title: 'Вразливість',
      text: `Ті, хто набирає високі бали за шкалою Вразливості, відчувають
паніку, розгубленість і безпорадність під тиском або стресом.
Ті, хто набирає низькі бали, відчувають себе більш стриманими, впевненими та ясномислячими
під час стресу.`
    }
  ]
}

export default neuroticism
