import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: 'Відкритість досвіду',
  shortDescription: 'Відкритість досвіду описує вимір когнітивного стилю, що відрізняє творчих, уявливих людей від приземлених, конвенційних.',
  description: `Відкриті люди інтелектуально допитливі,
цінують мистецтво та чутливі до краси. Вони, порівняно із закритими людьми,
зазвичай більш усвідомлюють свої почуття. Вони схильні
мислити і діяти індивідуалістично та неконформістськи.
Інтелектуали зазвичай набирають високі бали за шкалою Відкритості досвіду;
отже, цей фактор також називають Культурою чи
Інтелектом. <br /><br />Проте Інтелект, ймовірно, найкраще розглядати як один з аспектів відкритості
досвіду. Бали за шкалою Відкритості досвіду лише помірно
пов'язані з роками освіти та балами стандартних тестів інтелекту.
<br /><br />
Ще однією характеристикою відкритого когнітивного стилю є здатність мислити
символами та абстракціями, далекими від конкретного досвіду. Залежно від
конкретних інтелектуальних здібностей людини, це символічне пізнання може
набувати форми математичного, логічного чи геометричного мислення, художнього та
метафоричного використання мови, композиції чи виконання музики, або одного з
багатьох видів образотворчого чи виконавського мистецтва.
<br /><br />
Люди з низькими балами за шкалою відкритості досвіду, як правило, мають вузькі, звичайні
інтереси. Вони надають перевагу простому, прямолінійному та очевидному над
складним, неоднозначним та тонким. Вони можуть ставитися до мистецтва та науки з
недовірою, вважаючи ці заняття надто заумними або непрактичними.
Закриті люди надають перевагу звичному над новим; вони консервативні та
стійкі до змін.
<br /><br />
Відкритість часто подається психологами як здоровіша чи зріліша, адже
самі психологи часто відкриті до досвіду. Проте відкритий і закритий стилі
мислення корисні в різних середовищах. Інтелектуальний стиль
відкритої людини може добре слугувати професору, але дослідження показали, що закрите
мислення пов'язане з кращою продуктивністю у поліцейській роботі, продажах та
низці сфер обслуговування.`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `Твій результат за шкалою Відкритості досвіду низький, що вказує на те, що ти
любиш мислити простими й зрозумілими категоріями. Інші описують тебе як
приземлену, практичну та консервативну людину.`
    },
    {
      score: 'neutral', // do not translate this line
      text: `Твій результат за шкалою Відкритості досвіду середній, що вказує на те, що ти
цінуєш традицію, але готовий пробувати нове. Твоє мислення ані
просте, ані складне. Для інших ти виглядаєш освіченою людиною,
але не інтелектуалом.`
    },
    {
      score: 'high', // do not translate this line
      text: `Твій результат за шкалою Відкритості досвіду високий, що вказує на те, що ти
насолоджуєшся новизною, різноманіттям та змінами. Ти допитливий,
наділений уявою та творчий.`
    }
  ],
  facets: [
    {
      facet: 1,
      title: 'Уява',
      text: `Для людей з розвиненою уявою реальний світ
часто занадто простий і звичайний. Ті, хто набирає високі бали за цією шкалою, використовують фантазію як
спосіб створити багатший, цікавіший світ. Ті, хто набирає низькі бали за цією
шкалою, більше орієнтовані на факти, ніж на фантазію.`
    },
    {
      facet: 2,
      title: 'Художні інтереси',
      text: `Ті, хто набирає високі бали за цією шкалою, люблять красу, як у
мистецтві, так і в природі. Вони легко залучаються та поринають у художні
та природні явища. Вони не обов'язково мають художню освіту чи
талант, хоча багато хто з них має. Визначальними ознаками цієї шкали є
інтерес до природної та штучної краси та її цінування. Ті, хто набирає
низькі бали, позбавлені естетичної чутливості та інтересу до
мистецтва.`
    },
    {
      facet: 3,
      title: 'Емоційність',
      text: `Люди з високим рівнем Емоційності мають гарний доступ
до своїх почуттів та їх усвідомлюють. Ті, хто набирає низькі бали, менш усвідомлюють
свої почуття і схильні не виражати свої емоції відкрито.`
    },
    {
      facet: 4,
      title: 'Авантюрність',
      text: `Ті, хто набирає високі бали за шкалою авантюрності, прагнуть
пробувати нові види діяльності, подорожувати в чужі країни та пізнавати різні
речі. Вони знаходять звичне та рутинне нудним і оберуть новий
шлях додому просто тому, що він інший. Ті, хто набирає низькі бали, схильні відчувати себе
некомфортно зі змінами та надавати перевагу звичним рутинам.`
    },
    {
      facet: 5,
      title: 'Інтелект',
      text: `Інтелект і художні інтереси — два найважливіші,
центральні аспекти відкритості досвіду. Ті, хто набирає високі бали за шкалою
Інтелекту, люблять гратися з ідеями. Вони відкриті до нових та незвичних
ідей і люблять обговорювати інтелектуальні питання. Їм подобаються загадки, головоломки
та інтелектуальні ігри. Ті, хто набирає низькі бали за шкалою Інтелекту, надають перевагу роботі з
людьми чи речами, а не з ідеями. Вони вважають інтелектуальні вправи
марною тратою часу. Інтелект не слід ототожнювати з інтелектуальною здібністю.
Інтелект — це інтелектуальний стиль, а не інтелектуальна здібність, хоча
ті, хто набирає високі бали за шкалою Інтелекту, набирають трохи більше балів, ніж ті, у кого низький Інтелект,
у стандартизованих тестах інтелекту.`
    },
    {
      facet: 6,
      title: 'Лібералізм',
      text: `Психологічний лібералізм означає готовність
кидати виклик авторитету, конвенціям та традиційним цінностям. У своїй
найкрайнішій формі психологічний лібералізм може навіть являти собою відверту
ворожість до правил, співчуття порушникам закону та любов до неоднозначності,
хаосу та безладу. Психологічні консерватори надають перевагу безпеці та
стабільності, які приносить дотримання традицій. Психологічний лібералізм
та консерватизм не тотожні політичній приналежності, але, безумовно,
схиляють людей до певних політичних партій.`
    }
  ]
}

export default openness
