import { type TemplateDomain } from '../../types'

const agreeableness: TemplateDomain = {
  domain: 'A',
  title: '協調性',
  shortDescription: '協調性とは、他者との協力や社会的調和への関心における個人差を表す特性です。協調性の高い人は、他者と円満にやっていくことを大切にします。',
  description: `そのため、思いやりがあり、親切で、気前がよく、
進んで人を助け、他者と自分の利害を譲り合うことができます。
協調性の高い人は人間の本性について楽観的な見方を持っています。
人は基本的に正直で、まじめで、信頼できると信じているのです。 <br /><br />
一方、協調性の低い人は、他者とうまくやることよりも自分の利益を
優先します。他者の幸福にはおおむね無関心であり、そのため
人のために自らを張って何かをすることはほとんどありません。
他者の動機への懐疑心から、ときに疑い深く、非友好的で、
非協力的になってしまうこともあります。
<br /><br />
協調性は、人気を獲得し維持するうえで明らかに有利な特性です。
協調性の高い人は、低い人よりも好かれます。一方で、厳しい判断や
絶対的に客観的な決断が求められる場面では、協調性は役に立ちません。
協調性の低い人は、優れた科学者、批評家、あるいは軍人になることができます。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `あなたの協調性のスコアは低く、自分のニーズを他者のニーズより
優先する傾向があります。周囲からは、厳しく、批判的で、
妥協しない人だと見られているでしょう。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `あなたの協調性のスコアは平均的で、他者のニーズにある程度は
気を配るものの、一般に、他人のために自分を犠牲にすることには
消極的であることを示しています。`
    },
    {
      score: 'high', // do not translate this line
      text: `あなたの協調性のスコアは高く、他者のニーズや幸福への強い関心が
あることを示しています。あなたは心地よく、共感的で、
協力的な人です。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '信頼',
      text: `信頼の高い人は、ほとんどの人は公正で正直であり、
善意を持っていると考えます。信頼の低い人は、他者を利己的で、
不正直で、危険になりうる存在だと見なします。`
    },
    {
      facet: 2,
      title: '正直さ',
      text: `この尺度で高得点の人は、他者と接するときに見せかけや
操作の必要はないと考え、そのため率直で、正直で、誠実です。
低得点の人は、社会関係においてある程度の偽りは必要だと考えています。
この尺度で高得点の率直な人には、人は比較的簡単に親しみを覚えます。
一方、低得点の素直でない人には、一般に親しみを覚えにくいものです。
ここで明確にしておきたいのは、低得点の人が無節操あるいは
不道徳というわけではないということです。彼らは単に警戒心が強く、
真実をすべてオープンに明かすことに消極的なだけなのです。`
    },
    {
      facet: 3,
      title: '利他性',
      text: `利他的な人は、他者を助けることに心からの喜びを
見出します。そのため、困っている人には進んで手を差し伸べます。
利他的な人にとって、人のために何かをすることは自己犠牲ではなく、
自己実現の一つの形です。この尺度で低得点の人は、困っている人を
助けることをあまり好みません。援助の求めは、自己実現の機会ではなく
負担として感じられるのです。`
    },
    {
      facet: 4,
      title: '協力性',
      text: `この尺度で高得点の人は対立を好みません。
他者と円満にやっていくために、喜んで妥協したり、
自分の欲求を抑えたりします。この尺度で低得点の人は、
自分の思い通りにするために他者を威圧しようとする傾向があります。`
    },
    {
      facet: 5,
      title: '謙虚さ',
      text: `この尺度で高得点の人は、自分が他者より優れていると
主張することを好みません。この態度は、場合によっては自信や
自尊心の低さに由来することもあります。それでも、自尊心の高い人の
中にも、謙虚でないことを見苦しいと感じる人がいます。
自分を優れていると表現することをいとわない人は、周囲から
不快感を与えるほど傲慢だと見なされる傾向があります。`
    },
    {
      facet: 6,
      title: '共感',
      text: `この尺度で高得点の人は、心優しく、思いやりに
あふれています。他者の痛みを我がことのように感じ、容易に哀れみに
心を動かされます。低得点の人は、人の苦しみに強く心を動かされる
ことがありません。理性に基づいた客観的な判断を下せることを
誇りに思っています。慈悲よりも、真実と公平な正義を重んじるのです。`
    }
  ]
}

export default agreeableness
