import { type TemplateDomain } from '../../types'

const conscientiousness: TemplateDomain = {
  domain: 'C',
  title: '誠実性',
  shortDescription: '誠実性とは、私たちが自分の衝動をどのように制御し、調整し、方向づけるかに関わる特性です。',
  description: `衝動は本来、悪いものではありません。
時間的な制約から即断が求められることもあり、最初の衝動に従って
行動することが効果的な対応になる場合もあります。また、仕事ではなく
遊びの時間には、自発的で衝動的な行動が楽しみになることもあります。
衝動的な人は、周囲から個性的で、一緒にいて楽しく、風変わりな人だと
見なされることがあります。
<br /><br />
それでもなお、衝動に従った行動は、さまざまな形で問題を引き起こす
可能性があります。ある種の衝動は反社会的です。制御されない反社会的な
行為は、社会の他の構成員に危害を及ぼすだけでなく、衝動的な行為の
当事者自身に対する報復を招くこともあります。衝動的な行為のもう一つの
問題は、目先の報酬は得られても、望ましくない長期的な結果をもたらす
ことが多いという点です。たとえば、過度な付き合いが原因で職を
失うこと、口にした侮辱が大切な人間関係の破綻を招くこと、快楽を
もたらす薬物の使用がいずれ健康を損なうことなどが挙げられます。
<br /><br />
衝動的な行動は、重大な破壊的結果を伴わない場合でも、人の有効性を
大きく損ないます。衝動的に行動すると、他の選択肢を熟考することが
できず、その中には衝動的な選択よりも賢明なものがあったかもしれ
ません。衝動性はまた、段階的な手順やプロセスを要するプロジェクトの
途中で人を脱線させます。そのため、衝動的な人の成果は小さく、
散発的で、一貫性に欠けるものになります。
<br /><br />
知性の特徴の一つ、そして人間をそれ以前の生命体から区別しうるものは、
衝動に従って行動する前に将来の結果について考える能力です。
知的な活動には、長期的な目標についての熟考、その目標への道筋の
整理と計画、そして目先の反対の衝動に直面しても目標に向かって
粘り強く取り組むことが含まれます。知性には衝動の制御が含まれる
という考えは、誠実性領域の別称である「思慮深さ」という言葉に
うまく表れています。思慮深いとは、賢明であり、かつ慎重である
という意味です。
<br /><br/>
誠実性の尺度で高得点の人は、実際に、周囲から
知的だと認識されています。誠実性が高いことの利点は明白です。
誠実な人は、目的意識のある計画と粘り強さによってトラブルを
避け、高い成功を収めます。また、知的で信頼できる人として周囲から
好意的に評価されます。一方で、強迫的な完璧主義者や仕事中毒に
なることもあります。さらに、極端に誠実な人は、堅苦しく退屈な人だと
見なされることもあるでしょう。
<br /><br />
誠実でない人は、頼りにならない、向上心がない、決まりを
守らないとして批判されるかもしれませんが、多くの束の間の快楽を
経験し、堅苦しい人と呼ばれることは決してないでしょう。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `あなたの誠実性のスコアは低く、今この瞬間を生き、今気持ちの
よいことをすることを好む傾向があります。仕事は不注意で
まとまりのないものになりがちです。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `あなたの誠実性のスコアは平均的です。つまり、あなたは
そこそこ信頼でき、几帳面で、自制心があるということです。`
    },
    {
      score: 'high', // do not translate this line
      text: `あなたの誠実性のスコアは高いです。つまり、あなたは明確な
目標を立て、それを決意を持って追求します。周囲からは信頼でき、
よく働く人だと見なされています。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '自己効力感',
      text: `自己効力感とは、物事を成し遂げる自分の能力への
自信を表します。高得点の人は、成功を収めるために必要な知性
（常識）、推進力、自制心を備えていると信じています。
低得点の人は自分に効力を感じられず、自分の人生をコントロール
できていないという感覚を抱いているかもしれません。`
    },
    {
      facet: 2,
      title: '秩序性',
      text: `秩序性のスコアが高い人は、よく整理整頓されています。
日課やスケジュールに従って生活することを好みます。リストを作り、
計画を立てます。低得点の人は、まとまりがなく散漫になりがちです。`
    },
    {
      facet: 3,
      title: '義務感',
      text: `この尺度は、人の義務感の強さを反映します。この尺度で
高得点の人は、道義的な義務の感覚が強いです。低得点の人は、契約や
ルール、規則を過度に窮屈だと感じます。信頼できない、あるいは
無責任でさえあると見なされることが多いでしょう。`
    },
    {
      facet: 4,
      title: '達成追求',
      text: `この尺度で高得点の人は、卓越性を達成するために
懸命に努力します。成功者として認められたいという意欲が、
高い目標に向かう道から逸れないよう彼らを支えています。
人生における強い方向感覚を持っていることが多いですが、極端に
高いスコアの人は、一面的すぎて仕事に取りつかれていることも
あります。低得点の人は、最小限の仕事で済ませることに満足しており、
周囲から怠け者と見なされることがあります。`
    },
    {
      facet: 5,
      title: '自己規律',
      text: `自己規律――多くの人が意志力と呼ぶもの――とは、
困難な、あるいは不愉快な課題を、完了するまでやり遂げる能力を
指します。高い自己規律を備えた人は、課題を始めることへの
ためらいを克服し、気を散らすものがあっても軌道を外れずにいられ
ます。自己規律の低い人は先延ばしにし、最後までやり通す力に欠け、
課題を完了できないことが多く――それがどんなに完了したい課題で
あっても――同じです。`
    },
    {
      facet: 6,
      title: '慎重さ',
      text: `慎重さとは、行動する前に可能性を考え抜こうとする
性向を表します。慎重さの尺度で高得点の人は、意思決定に時間を
かけます。低得点の人は、他の選択肢やそれぞれの起こりうる結果を
熟考することなく、思いついたことをすぐに口にしたり実行したり
することがよくあります。`
    }
  ]
}

export default conscientiousness
