import { type TemplateDomain } from '../../types'

const extraversion: TemplateDomain = {
  domain: 'E',
  title: '外向性',
  shortDescription: '外向性は、外部世界への顕著な関わりによって特徴づけられます。',
  description: `外向的な人は人と一緒にいることを楽しみ、エネルギーに
あふれ、ポジティブな感情をよく経験します。熱心で行動志向の人が
多く、刺激の機会には「イエス！」「行こう！」と答える傾向が
あります。グループの中では、話すこと、自己主張すること、
注目を集めることを好みます。
<br /><br />
内向的な人には、外向的な人のような活気、エネルギー、活動レベルが
ありません。静かで、控えめで、慎重で、社会の世界からは一歩引いて
いる傾向があります。社会的な関わりの少なさは、内気さや抑うつと
解釈されるべきではありません。内向的な人は、単に外向的な人よりも
刺激を必要とせず、一人でいることを好むだけなのです。 <br /><br />内向的な
人の自立心や控えめさは、ときに非友好的さや傲慢さと誤解されることが
あります。実際には、協調性の次元で高得点の内向的な人は、自分から
人に近づくことはなくても、近づかれたときにはとても心地よい人です。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `あなたの外向性のスコアは低く、内向的で、控えめで、
静かな傾向があります。一人の時間や一人で行う活動を楽しみます。
社会的な付き合いは、親しい数人の友人に限られる傾向があります。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `あなたの外向性のスコアは平均的で、おとなしい一匹狼でも、
陽気なおしゃべりでもないことを示しています。他者と過ごす時間も、
一人の時間もどちらも楽しめます。`
    },
    {
      score: 'high', // do not translate this line
      text: `あなたの外向性のスコアは高く、社交的で、開放的で、
エネルギッシュで、活気があることを示しています。たいていの時間を
人と一緒に過ごすことを好みます。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '友好性',
      text: `友好的な人は、他者を心から好きになり、他者への
ポジティブな感情を率直に示します。すぐに友達を作り、親密で
深い関係を築くのも得意です。友好性で低得点の人は、必ずしも
冷たかったり敵対的だったりするわけではありませんが、自分から
人に近づかず、よそよそしく控えめな人だと見なされます。`
    },
    {
      facet: 2,
      title: '社交性',
      text: `社交的な人は、他者と一緒にいることに心地よい刺激と
報いを感じます。人混みのにぎわいを楽しみます。低得点の人は、
大勢の人混みに圧倒されがちで、そのため積極的に人混みを避けます。
人と一緒にいることが嫌いなわけでは必ずしもありませんが、
プライバシーや一人の時間への欲求が、この尺度で高得点の人よりも
はるかに強いのです。`
    },
    {
      facet: 3,
      title: '自己主張',
      text: `自己主張の高得点の人は、はっきりと意見を述べ、
主導権を握り、他者の活動を指揮することを好みます。グループの中で
リーダーになる傾向があります。低得点の人は、あまり話さず、
グループの活動は他者に任せる傾向があります。`
    },
    {
      facet: 4,
      title: '活動性',
      text: `活動的な人は、速いペースの忙しい生活を送っています。
素早く、エネルギッシュに、力強く動き回り、多くの活動に関わって
います。この尺度で低得点の人は、よりゆったりとした、のんびりと
リラックスしたペースをたどります。`
    },
    {
      facet: 5,
      title: '刺激追求',
      text: `この尺度で高得点の人は、高いレベルの刺激がないと
すぐに退屈してしまいます。明るい光や、にぎやかな雑踏を愛します。
リスクを取り、スリルを求める傾向があります。低得点の人は騒音や
騒ぎに圧倒され、スリルを求めることには消極的です。`
    },
    {
      facet: 6,
      title: '陽気さ',
      text: `この尺度は、ポジティブな気分や感情を測定するもので
あり、ネガティブな感情（神経症的傾向の領域に含まれます）を測る
ものではありません。この尺度で高得点の人は、幸福、熱意、楽観、
喜びなど、幅広いポジティブな感情を典型的に経験します。低得点の
人は、そのようなエネルギッシュな上機嫌にはなりにくい傾向が
あります。`
    }
  ]
}

export default extraversion
