import { type TemplateDomain } from '../../types'

const neuroticism: TemplateDomain = {
  domain: 'N',
  title: '神経症的傾向',
  shortDescription: '神経症的傾向とは、ネガティブな感情を経験しやすい傾向を指します。',
  description: `フロイトは当初、「神経症」という言葉を、精神的な苦悩や
感情の痛み、そして日常生活の通常の要求にうまく対処できない状態を
表すために用いました。彼は、誰もがある程度の神経症的な兆候を
示すものの、苦しみの程度や苦痛の具体的な症状は人によって異なると
考えました。今日では、神経症的傾向はネガティブな感情を経験する
傾向を指します。 <br /><br />神経症的傾向で高得点の人は、不安、怒り、
抑うつといった特定のネガティブな感情のいずれかを主に経験する
こともありますが、これらの感情のいくつかを経験する可能性が高い
でしょう。 <br /><br />神経症的傾向の高い人は、感情的に反応しやすい
人です。ほとんどの人には影響しないような出来事にも感情的に反応し、
その反応は普通より強いものになりがちです。ありふれた状況を脅威と
解釈し、些細な挫折を絶望的に困難なものと捉えてしまう傾向が
あります。 <br /><br />ネガティブな感情反応は、異常に長い間持続する
傾向があり、そのため気分が悪い状態にいることが多くなります。
こうした感情調整の問題は、神経症的な人が明晰に考え、決断を下し、
ストレスにうまく対処する能力を損なうことがあります。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `あなたの神経症的傾向のスコアは低く、非常に穏やかで、
落ち着いており、動じにくいことを示しています。ほとんどの人が
ストレスを感じると言うような状況でも、強い感情で反応することは
ありません。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `あなたの神経症的傾向のスコアは平均的で、あなたの感情的な
反応性のレベルは一般的な集団と同程度であることを示しています。
ストレスの多い、あるいはイライラする状況には多少動揺しますが、
一般にその感情を乗り越え、状況に対処することができます。`
    },
    {
      score: 'high', // do not translate this line
      text: `あなたの神経症的傾向のスコアは高く、ほとんどの人が日常生活の
普通の要求と考えることでも、容易に動揺してしまうことを示して
います。周囲からは敏感で感情豊かな人だと見なされています。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '不安',
      text: `不安の高い人は、脳の「闘争・逃走」システムが容易に、
そして頻繁に作動してしまいます。そのため不安の高い人は、何か
危険なことが起こりそうだと感じることが多くあります。特定の状況を
恐れることもあれば、漠然と全体的に恐れていることもあります。
緊張し、落ち着かず、神経質に感じます。不安の低い人は、一般に
穏やかで恐れを知りません。`
    },
    {
      facet: 2,
      title: '怒り',
      text: `怒りで高得点の人は、物事が思い通りにいかないときに
激怒を感じます。公正に扱われることに敏感で、不当な扱いを受けたと
感じると恨みや苦々しさを抱きます。この尺度は怒りを感じる傾向を
測定するものであり、その苛立ちや敵意を表に出すかどうかは、
その人の協調性のレベルによって変わります。低得点の人は、頻繁に、
あるいは容易に怒ることはありません。`
    },
    {
      facet: 3,
      title: '抑うつ',
      text: `この尺度は、悲しみ、落胆、意気消沈を感じる傾向を
測定します。高得点の人はエネルギーに欠け、活動を始めるのが
難しいです。低得点の人は、こうした抑うつ的な感情から比較的
自由でいられる傾向があります。`
    },
    {
      facet: 4,
      title: '自意識',
      text: `自意識の高い人は、他者が自分をどう思っているかに
敏感です。拒絶や嘲笑への懸念から、他者の前で内気になり、居心地の
悪さを感じます。すぐに当惑し、恥ずかしさを感じることがよく
あります。他者に批判されたりからかわれたりするのではないかという
恐れは誇張されており非現実的なのですが、ぎこちなさや居心地の
悪さが、その恐れを自己成就的な予言にしてしまうことがあります。
対照的に低得点の人は、みんなが自分を見て判断しているという
誤った印象に悩まされることがありません。社会的な場面で緊張する
こともありません。`
    },
    {
      facet: 5,
      title: '節制のなさ',
      text: `節制のない人は、抵抗するのが難しい強い渇望や衝動を
感じます。長期的な結果よりも、短期的な快楽や報酬に向かう傾向が
あります。低得点の人は、抗いがたい強い渇望を経験しないため、
過度に耽溺する誘惑に駆られることがありません。`
    },
    {
      facet: 6,
      title: '脆弱性',
      text: `脆弱性で高得点の人は、プレッシャーやストレスの下で
パニック、混乱、無力感を経験します。低得点の人は、ストレスを
受けているときでも、より落ち着き、自信を持ち、明晰に考えられる
と感じます。`
    }
  ]
}

export default neuroticism
