import { type TemplateDomain } from '../../types'

const openness: TemplateDomain = {
  domain: 'O',
  title: '開放性',
  shortDescription: '開放性とは、想像力豊かで創造的な人と、現実的で慣習的な人とを区別する認知スタイルの次元を表す特性です。',
  description: `開放的な人は、知的好奇心が高く、芸術を愛し、美に
敏感です。閉鎖的な人と比べて、自分の感情をより自覚している傾向が
あります。個人主義的で慣習にとらわれない考え方や行動をする傾向が
あります。知的な人は典型的に開放性で高得点を示します。そのため、
この因子は「文化」あるいは「知性」と呼ばれることもあります。 <br /><br />
とはいえ、知性はおそらく開放性の一側面として捉えるのが最も適切です。
開放性のスコアは、教育年数や標準的な知能検査のスコアと、ごく
わずかにしか関連していません。
<br /><br />
開放的な認知スタイルのもう一つの特徴は、具体的な経験から遠く離れた
象徴や抽象を用いて考える能力です。個人の具体的な知的能力に応じて、
この象徴的認知は、数学的・論理的・幾何学的な思考、芸術的・比喩的な
言語の使用、音楽の作曲や演奏、あるいは多くの視覚芸術や舞台芸術の
いずれかの形を取ることがあります。
<br /><br />
開放性のスコアが低い人は、関心が狭く平凡な傾向があります。
複雑で曖昧で繊細なものよりも、平易で率直で明白なものを好みます。
芸術や科学を懐疑的に見て、こうした営みを難解あるいは実用的でない
とみなすことがあります。閉鎖的な人は、新奇さよりも馴染みのある
ものを好み、保守的で変化に抵抗します。
<br /><br />
開放性は、心理学者（彼ら自身も開放的なことが多い）によって、
より健康的あるいはより成熟した特性として提示されることがよく
あります。しかし、開放的な思考様式と閉鎖的な思考様式は、それぞれ
異なる環境で有用です。開放的な人の知的なスタイルは大学教授には
役立つかもしれませんが、研究によれば、閉鎖的な思考は警察業務、
営業、そして多くのサービス職において優れた職務遂行と関連して
います。`,
  results: [
    {
      score: 'low', // do not translate this line
      text: `あなたの開放性のスコアは低く、平易で単純な言葉で考える
ことを好む傾向があります。周囲からは、現実的で実践的、保守的な
人だと見なされています。`
    },
    {
      score: 'neutral', // do not translate this line
      text: `あなたの開放性のスコアは平均的で、伝統を楽しみつつも、
新しいことに挑戦する意欲があることを示しています。あなたの考え方は
単純でも複雑でもありません。周囲からは、教養のある人には見えても、
知識人には見えないでしょう。`
    },
    {
      score: 'high', // do not translate this line
      text: `あなたの開放性のスコアは高く、新奇さ、多様性、変化を
楽しむことを示しています。あなたは好奇心が強く、想像力豊かで、
創造的です。`
    }
  ],
  facets: [
    {
      facet: 1,
      title: '想像力',
      text: `想像力豊かな人にとって、現実の世界はしばしばあまりに
平凡でありふれています。この尺度で高得点の人は、空想を、より豊かで
興味深い世界を作り出す手段として用います。低得点の人は、空想よりも
事実に重きを置く傾向があります。`
    },
    {
      facet: 2,
      title: '芸術への関心',
      text: `この尺度で高得点の人は、芸術と自然の両方において
美を愛します。芸術的・自然的な出来事に容易に没頭します。必ずしも
芸術的な訓練を受けているわけでも才能があるわけでもありませんが、
多くの場合はそうでしょう。この尺度の決定的な特徴は、自然の美と
人工の美への関心と鑑賞力です。低得点の人は、美的感受性や芸術への
関心に欠けています。`
    },
    {
      facet: 3,
      title: '情動性',
      text: `情動性の高い人は、自分自身の感情に十分にアクセスし、
それを自覚しています。低得点の人は、自分の感情への自覚が低く、
感情を表に出して表現しない傾向があります。`
    },
    {
      facet: 4,
      title: '冒険心',
      text: `冒険心で高得点の人は、新しい活動に挑戦し、外国へ
旅し、さまざまなことを経験したいと熱望しています。馴染みのある
ものや日課には退屈を感じ、ただ違うからという理由だけで新しい
帰り道を選ぶこともあります。低得点の人は変化に居心地の悪さを
感じがちで、慣れ親しんだ日課を好みます。`
    },
    {
      facet: 5,
      title: '知性',
      text: `知性と芸術への関心は、開放性の最も重要で中心的な
二つの側面です。知性で高得点の人は、アイデアで遊ぶことを愛します。
新しい、あるいは珍しいアイデアに心を開き、知的な問題について議論
することを好みます。なぞなぞやパズル、頭の体操を楽しみます。
知性で低得点の人は、アイデアよりも、人あるいは物事を扱うことを
好みます。知的な訓練を時間の無駄だと考えます。知性は知能と
同一視されるべきではありません。知性とは知的なスタイルであって、
知的な能力ではありません。ただし、知性で高得点の人は、標準化
知能検査において低得点の人よりもわずかに高いスコアを示します。`
    },
    {
      facet: 6,
      title: 'リベラリズム',
      text: `心理学的リベラリズムとは、権威、慣習、伝統的な価値観に
挑戦する姿勢を指します。その最も極端な形では、心理学的リベラリズムは、
ルールへの明白な敵意、法を破る者への共感、曖昧さや混沌、無秩序への
愛着を意味することさえあります。心理学的保守主義者は、伝統への
順守がもたらす安心感と安定を好みます。心理学的リベラリズムと
保守主義は、政治的な所属と同一ではありませんが、人を特定の政党へと
傾かせることは確かにあります。`
    }
  ]
}

export default openness
